{"id":10196,"permalink":"http:\/\/www.sailusfood.com\/2010\/07\/16\/coffee-flavored-cake-with-coffee-buttercream-frosting\/","title":"Coffee Flavored Cake with Coffee Buttercream Frosting","content":"Coffee Cake \r\n\r\nThere are many coffee cakes but this is a classic recipe with the flavors spot on. A moist, deep flavored cake that sports a topping with an unmistakable coffee aroma. The addition of coffee to the cake batter not only infuses the cake with more flavor but also perfumes your home with the heavenly aroma of coffee. The cake tastes good on its own but its outright delicious when adorned with coffee butter cream frosting.  \r\n\r\nCoffee flavored Cake - Coffee Buttercream Frosting\r\n\r\nI found this gorgeous fail proof coffee cake recipe at Shoba's blog who in turn found it at Divya's blog. Thank you, Shoba and Divya. :)\r\n\r\n\r\nCoffee Cake with Coffee Buttercream Frosting Recipe\r\nPreparation: 10 mts, Baking: 35-40 mt\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup all purpose flour\/maida\r\n\r\n1 tsp baking pwd\r\n\r\n3\/4 cup brown sugar or granulated white sugar\r\n\r\n3\/4 cup soft white butter\r\n\r\n2 eggs, room temperature\r\n\r\n1\/4 cup low fat milk\r\n\r\n2 tbsps instant coffee pwd\r\n\r\n1 tbsp boiling water\r\n\r\n1 tsp vanilla essence\r\n\r\nFor coffee buttercream frosting:\r\n\r\n1\/3 cup soft butter\r\n\r\n1 cup icing sugar \r\n\r\n1\/2 tbsp instant coffee pwd, mixed in a tbsp of boiling water\r\n\r\nfew drops vanilla essence\r\n\r\n\r\n\r\n1 Preheat oven to 175 C. Grease and flour a round baking pan. \r\n2 Sieve maida and baking pwd thrice and keep aside. \r\n3 Add instant coffee pwd to the boiling water and allow to dissolve. Keep aside.\r\n4 In a bowl, cream butter and sugar till smooth and creamy. Add one egg at a time and beat till well combined. Add vanilla essence and coffee mixture and combine.\r\n5 Add the flour in three additions alternating with milk, starting with flour and ending with flour. Do not over beat, just mix till well combined in low speed.\r\n6 Pour batter into the greased and floured pan. Bake in preheated oven for 35 mts or till a toothpick inserted into the cake comes out clean. Place on a wire rack to cool for 15 mts. Remove cake from pan and prepare frosting.\r\n7 To prepare butter cream frosting\/icing, beat butter and icing sugar on medium speed for 3 mts till smooth and creamy. \r\n8 Add coffee mixture, vanilla essence and beat for 2 mts on medium speed and you will have a frosting of spreading consistency.\r\n9 Spread the frosting on the cooled cake only on the top or all over including the sides. Top with nuts of your choice or almond praline or chocolate gratings. Chill the cake for 30-45 mts for the frosting to set. Slice and serve.\r\n\r\nCoffee flavored Cake with Coffee Buttercream Frosting","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/07\/coffee-cake-with-frosting.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/coffee-cake-with-frosting-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/coffee-cake-with-frosting-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["nut free","dairy","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"35","prep-time":"10","main-ingredient":["flour","eggs","butter","instant coffee","icing sugar","sugar"],"serves":"10","author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes","Sweet Dessert Recipes"],"tags":["buttercream","cake","coffee","coffee-cake"]}