{"id":10242,"permalink":"http:\/\/www.sailusfood.com\/2010\/08\/13\/chocolate-nankhatai\/","title":"Chocolate Nankhatai ","content":"Chocolate Nankhatai\r\n\r\n'Mama, can you make chocolate cookies?', asked my son as he walked out of the front door yesterday morning. \r\n\r\n'But you hardly ate any when I last made them!' \r\n\r\n'No, I like them. My friend gave me a chocolate cookie in school and it was very tasty. Please make the same ones for me also, Mama?' he pleaded.\r\n\r\nI smiled and assured him that he'd have his chocolate cookies once he's back from school in the afternoon. He gave me a tight hug and off he went to school. After cooking lunch, I got down to baking Chocolate Nankhatai. Its the first time I added cocoa powder to Nankhatai dough and must say that they turned out exceptionally well. My son loved them and so did we adults. :)\r\n\r\n\r\nChocolate Nankhatai Recipe\r\nPreparation: 10 mts, Baking: 20-22 mts\r\nMakes approx 18-20 cookies\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups all purpose flour (maida)\r\n\r\n1\/4 cup semolina\/sooji\r\n\r\n1 tbsp cocoa pwd\r\n\r\n1\/4 tsp baking soda\r\n\r\n1\/2 tsp vanilla essence\r\n\r\n1 1\/4 cups powdered sugar\r\n\r\n3\/4 cup ghee or melted butter or oil\r\n\r\n2 tbsps yogurt\/curd\r\n\r\n\r\n\r\n1 Sieve maida and baking soda. \r\n2 Blend the sugar, ghee, vanilla essence and yogurt till smooth. Its important you really combine well. Add the sieved ingredients and semolina to the sugar-ghee mixture. The dough should be kneaded well for at least 7-8 mts. If the dough is not stiff enough to roll out into balls, add a few tbsps of cold milk and chill for a few minutes. Divide into two parts.\r\n3 Take one part of the dough and add cocoa pwd and knead till its well combined, add a little milk if required. Make small balls of this dough. Keep aside.\r\n4 Pinch dough of the remaining dough and shape into small balls and roll each of them it into a thick cylindrical shape (snake shape). \r\n5 Now place a cocoa flavored ball on the surface. Along the edges of this cocoa colored ball, roll the cylindrical shaped white dough and gently flatten.\r\n6 Garnish with almonds or pista or cashews on top of each flattened ball by slightly pressing into the dough. Place on a greased tray with enough space between each ball as they spread out. Pre heat oven for 15 mts, bake at 180 C for about 20-22 mts. Once baked, the cookie will feel soft on touch. Remove from oven and cool and the cookies will harden. \r\n7 Cool on a wire rack and store in airtight container.\r\n\r\nChocolate Nankhatai","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/08\/chocolate-nankatai.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-nankatai-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-nankatai-300x300.jpg","style":["easy","quick","modern"],"course":["snack","dessert"],"special-diet":["eggless","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"20","prep-time":"10","main-ingredient":["maida","semolina","ghee","cocoa powder","sugar"],"author":null,"type":"post","categories":["All Recipes","Cookie Recipes","Eggless Cake &amp; Cookie Recipes","Indian Vegetarian Recipes"],"tags":["chocolate","cookies","nankhatai"]}