{"id":10294,"permalink":"http:\/\/www.sailusfood.com\/2010\/08\/07\/tutti-frutti-cake\/","title":"Tutti Frutti Cake","content":"Tutti Frutti Cake\r\n\r\nI am enjoying the season of cool temperatures and the kind of cooking and baking that it entails. I find myself drawn to firing up the oven more often than usual. Day before yesterday was a drizzly overcast day and I baked this simple yet interesting cake. We nibbled on it all day to find the cake disappear on the day of its preparation. If you want to bake this cake, try baking in a loaf pan and use pineapple essence which gives it a lot more flavor than vanilla essence. I used a part of the cake batter to prepare few cupcakes for Nehal's school snack box. \r\n\r\n\r\n\r\n\r\nTutti Frutti Cake Recipe\r\nPreparation: 10 mts, Baking: 35-40 mt\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups all purpose flour\/maida\r\n\r\n2 tsps baking pwd\r\n\r\n1\/2 tsp baking soda\r\n\r\n1 1\/4 cup granulated white sugar\r\n\r\n1\/2 cup soft white butter\r\n\r\n2 eggs, room temperature\r\n\r\n1\/2 cup low fat milk\r\n\r\n1\/2 cup tutti frutti\r\n\r\n2 tsps pineapple essence or vanilla essence\r\n\r\n\r\n\r\n1 Preheat oven to 175 C. Grease and flour a loaf tin. \r\n2 Sieve maida, baking soda and baking pwd thrice and keep aside. \r\n3 In a bowl, cream butter and sugar till smooth and creamy. Add one egg at a time and beat till well combined. Add pineapple essence and combine.\r\n4 Add the flour in three additions alternating with milk, starting with flour and ending with flour. Do not over beat, just mix till well combined in low speed. \r\n5 Sprinkle some flour over the tutti frutti to coat them. Add this tutti frutti to the batter and fold gently into the batter. Do not beat it but just fold until combined.\r\n6 Pour batter into the greased and floured loaf tin. Bake in preheated oven for 40-45 mts or till a toothpick inserted into the cake comes out clean. Place on a wire rack to cool for 15 mts. Remove cake from pan and slice.\r\n\r\nTutti Frutti Cupcakes","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/08\/tutti-frutti-cake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tutti-frutti-cake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tutti-frutti-cake-300x300.jpg","style":["easy","modern"],"course":["dessert","snack"],"special-diet":["nut free","dairy","kid friendly"],"cuisine":["western"],"cook-time":"45","prep-time":"10","main-ingredient":["tutti frutti","flour","eggs","butter"],"serves":"10","author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes"],"tags":["cake","tutti-frutti"]}