{"id":1037,"permalink":"http:\/\/www.sailusfood.com\/2008\/04\/30\/mamidi-turumu-pachadi-mukkalu-pachadi-instant-green-mango-pickles\/","title":"Instant Mango Pickles - Mamidi Turumu Pachadi & Mukkalu Pachadi","content":"April and May are mango months in India that evoke nostalgia and memories of family bonding, togetherness and fun. This heart shaped golden beauty brings families together. I have vivid memories of mango pickling during my growing years which was a huge affair, a whole day of mango madness, right from plucking the mangoes, soaking in water, wiping them clean, cutting the de-seeded mangoes and finally, pickling. An annual family culinary event where the king of fruits reigned supreme with all the elders taking part in the pickling process, its preparation, supervision and sharing with friends and neighbors. A day of excitement for us kids.:)\r\n\r\n\r\nInstant pickles need less oil, salt and spice and less shelf life. Usually unripe, mature green mangoes, with white flesh that is sour to taste, known as pachadi mamidikaya (pickle mangoes) are preferred. If the mango is green, hard on touch yet with a slightly yellow colored flesh with a sweet flavor, then it is rendered useless for pickling and is best left to ripen. I grew up eating a variety of mango pickles, a few were instant pickles, prepared with mangoes which had fallen off the trees in our backyard. If there were half a dozen such fallen mangoes, my mother would prepare two or three varieties of instant pickles. One such pickle is Mamidi turumu pachadi (also known as Pulihora avakai), made from grated mango, chilli powder, methi and seasoning of spices. The other instant pickle is Mamidi mukkala pachadi made from finely chopped pieces of mango, chilli powder and mustard powder. Both need to be refrigerated and can stored for atleast 2-3 months.\r\n\r\n\r\nMamidi Turumu Pachadi Recipe\r\nPrep &amp; Cooking: 20 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups of grated raw green mangoes (washed, wiped dry and skinned)\r\n\r\n2 tbsps red chilli pwd\r\n\r\n1 tbsp mustard pwd (ava pindi)\r\n\r\n1 1\/2 tsps roasted fenugreek pwd (methi\/menthi podi)\r\n\r\n1 1\/2 tbsps salt\r\n\r\n4-5 tbsps oil (sesame\/til\/nuvvulu)\r\n\r\nFor popu\/tadka\/tempering:\r\n\r\n1 tsp mustard seeds\r\n\r\n1 tsp split black gram dal - optional\r\n\r\n1 tbsp channa dal (bengal gram) - optional\r\n\r\npinch methi seeds\r\n\r\n2 dry red chillis\r\n\r\n1\/4 tsp asafoetida\/hing\/inguva\r\n\r\n10-12 curry leaves\r\n\r\n1\/2 tbsp oil\r\n\r\n\r\n\r\nCombine mango pieces, red chilli pwd, mustard pwd, methi pwd, salt and oil in a vessel. Heat 1\/2 tbsp oil in a vessel, add mustard seeds and let them splutter. Add methi seeds, dals, red chilli and stir fry till the dals turn red. Add curry leaves and asafoetida and stir fry for a few seconds before turning off the heat. Pour this seasoning over the mango mixture and combine well. Store in a clean, dry bottle and refrigerate. This pickle can be eaten within two to three hours of preparation.\r\n\r\n\r\nMamidikaya Mukkalu Pachadi Recipe\r\nPrep &amp; Cooking: 15 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups of finely chopped raw green mango pieces along with skin (washed and wipe dry)\r\n\r\n2 tbsps red chilli pwd\r\n\r\n2 tbsps mustard pwd (ava pindi)\r\n\r\n1 tbsp salt\r\n\r\n4-5 tbsps oil (sesame\/til\/nuvvulu)\r\n\r\n\r\n\r\nCombine all the above ingredients and store in a clean, dry bottle and refrigerate. Use a clean spoon to remove pickle. This pickle can be eaten within 8 hours of preparation.\r\n\r\nI had written a few tips on how to make pickles which will help you during the pickling process.\r\n\r\nNote:\r\nSun dry mustard seeds for a day and grind to a fine powder and store. For methi powder, dry roast methi seeds till it reaches a red color, cool and grind to a fine powder. Red chilli powder used for pickling is preferred. Its available in most super markets or departmental stores. Sesame oil is best, incase you don't have sesame, you can use any refined oil. Remember to prepare pickles in moisture free area.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/kondapalli_toy.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kondapalli_toy-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kondapalli_toy-300x300.jpg","main-ingredient":["raw mango"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Pickles","Indian Vegetarian Recipes"],"tags":["mangoes","mango_pickle"]}