{"id":10427,"permalink":"http:\/\/www.sailusfood.com\/2010\/09\/20\/teepi-kakarakaya-pachadi-sweet-bitter-gourd-pickle\/","title":"Teepi Kakarakaya Pachadi ~ Sweet Bitter gourd Pickle","content":"Teepi Kakarakaya Pachadi\r\n\r\nAm back after much needed rest. Thank you dear readers for sending kind, heart warming wishes my way. \r\n\r\nA much cherished and relished vegetable in our home is bitter gourd. A favorite of mine is today's bitter gourd pickle with a sweet flavor that happens to be one of Amma's specialty dishes. What makes it palate pleasing  is the addition of jaggery and tamarind combined with a tempering of curry leaves and dals that add for a bit of crunch. Sweet, sour and tangy flavors that are enticing and addictive. Bitter gourd never tasted better.\r\n\r\nFarm fresh bitter gourds ~ Peeled, de-seeded and sliced bitter gourd\r\n\r\nThe bitter gourds you see in the picture above are freshly plucked off the vine. Ensure that you use tender fresh bitter gourd. Discard the hard seeds. Taste and adjust salt and chili powder till it strikes the right balance with the tang and sweet flavors. Keeps well when refrigerated for a few weeks.  \r\n\r\nTeepi Kakarakaya Pachadi Recipe\r\nRecipe Source & Prep: Amma\r\nPrep & Cooking: 45 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg bitter gourds\/kakarakayalu\/karela, wash, dry, lightly peel and slice \r\n\r\n100 gms tamarind\r\n \r\n100 gms jaggery or sugar\r\n\r\n2 tbsps red chilli pwd (adjust)\r\n\r\n1\/2 tsp dry roasted methi pwd\r\n\r\n1 tsp mustard pwd\r\n\r\n1 tbsp coriander pwd\r\n\r\n1 1\/4 tbsps salt (adjust)\r\n\r\nFor tempering\/tadka\/poppu:\r\n\r\n12-15 peeled and crushed garlic cloves\r\n\r\n15-20 fresh curry leaves\r\n\r\n1 tsp mustard seeds\r\n\r\n1\/4 tsp methi seeds\/fenugreek seeds\/menthulu\r\n\r\n1\/2 tbsp split gram dal (optional)\r\n\r\n1 tbsp chana dal (optional)\r\n\r\n3-4 dry red chilies, tear and de-seed\r\n\r\n7-8 tbsps oil\r\n\r\n\r\n\r\n1 Cut the bitter gourd length wise and slice as shown in the picture above. Deep fry the sliced bitter gourd to a light brown shade. Drain and keep aside.\r\n2 In a stainless steel vessel, add the tamarind and enough water till the tamarind is immersed. Bring it to a boil and turn off heat and cool.\r\n3 Once cool, pour this into the blender jar along with salt, chili pwd and jaggery syrup or sugar. Grind a smooth paste, remove and keep aside. (this will be of a pouring consistency)\r\n4 Heat oil in a heavy bottomed vessel, once hot, reduce flame to medium. Add mustard seeds and as they splutter, add split gram dal, channa dal and methi seeds and allow them to turn red. Add curry leaves and crushed garlic and saute for a half a mt on low flame.\r\n5 Immediately add the ground tamarind-jaggery paste and combine. Add coriander pwd, mustard pwd and methi pwd and combine. Let it cook for a mt on low-medium flame.\r\n6 Add the deep fried bitter gourd pieces and combine. Cook on low flame for 4-5 mts. Turn off heat.\r\n7 Cool and store in an airtight bottle. Refrigerate.\r\n\r\nNote:If using jaggery, add few tbsps of water and allow it dissolve over low flame. Strain it for any particles and follow rest of the recipe.\r\n\r\nSweet Bitter gourd pickle ~ Meetha Karela Achar","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/08\/teepi-kakarakaya-pachadi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/teepi-kakarakaya-pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/teepi-kakarakaya-pachadi-300x300.jpg","style":["modern"],"course":["pickle"],"special-diet":["eggless","dairy free","vegetarian","vegan","pregnancy","kid friendly"],"cuisine":["andhra"],"cook-time":"15","prep-time":"30","main-ingredient":["bittergourd","tamarind","jaggery"],"goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["bitter-gourd","kakarakaya","karela","pachadi","pickle","sweet"]}