{"id":1048,"permalink":"http:\/\/www.sailusfood.com\/2008\/05\/05\/bellam-maagaya-teepi-maagai-sweet-grated-mango-pickle\/","title":"Bellam Maagaya - Sweet Grated Mango Pickle","content":"Wheat rava upma with teepi maagai\r\nMy grandmother's and mother's kitchen shelves are lined with an array of cylindrical ceramic jars containing different varieties of mango pickles. Of course, the famed 'Avakaya' stands majestic occupying the largest jar ('avakaya jaadi') of the lot while the lesser known yet delectable pickles stored in the smaller elegant jars. In one of those jars is a gem of a pickle and a regional classic, Bellam Avakai aka Teepi Avakaya, a sweet mango pickle prepared by North Coastal Andhraites. Though Avakaaya is the most beloved mango pickle to us Andhras, folks from Krishna and Guntur districts would express their profound love for the hot fiery mango pickle varieties while the coastal Andhraites for the sweet mango pickles. \r\n\r\nAt our home we prepare a sweet instant pickle with grated mango that needs to be refrigerated. Dried mango slices, chilli powder, methi powder and jaggery are the ingredients which go into its making. This recipe is more by way of 'andaz' with no fixed measurement of ingredients. If the mangoes are more sour, we just need to increase use of jaggery and vice versa. Makes a great accompaniment to curd rice and tiffins like upma. I also use it as a salad dressing by mixing with curd.\r\n&nbsp;&nbsp;mango slices sun drying&nbsp;&nbsp;sun-dried mango slices\r\n\r\nBellam Maagaya Recipe\r\nPrep & Cooking: 1 hr \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n3 raw green mangoes (washed, wiped dry, skinned and sliced)\r\n\r\n1\/2 tsp turmeric pwd\r\n\r\n2 tbsps red chilli pwd\r\n\r\n1 tsp roasted fenugreek seeds pwd (methi\/menthi podi)\r\n\r\n2 1\/2 tbsps salt\r\n\r\n3\/4 to 1 cup grated jaggery (melt and strain) or sugar\r\n\r\nFor popu\/tadka\/seasoning:\r\n\r\n1\/4 tsp asafoetida\/hing\/inguva\r\n\r\n1 1\/2 tbsp oil\r\n\r\n\r\n\r\nCombine turmeric powder and two tbsps salt with the mango slices, cover with lid and leave overnight. Next day, strain the water and sun- dry the mango slices for three days. On the fourth day, prepare the grated pickle. Boil 2 cups of water and turn off heat. Once the water reaches room temperature, add the dried mango slices and let it soak for an hour or till the pieces soften and water is absorbed. Meanwhile, boil the strained jaggery for 8-10 mts or till it reaches one string stage (paakam). Keep aside to cool for 7-8 mts. Combine red chilli pwd, methi pwd and salt (as required) to the soaked mango slices and mix well. Add the jaggery syrup and combine well. Heat oil in a pan, add asafoetida and fry for a few seconds till the flavor comes out and add to the mango pickle. Store in an air tight bottle and refrigerate. This pickle can be eaten immediately on preparation.\r\n\r\nMy favorite combination is eating curd rice or yogurt with this sweet mango pickle. Its a delight to the senses and a gratifying culinary experience.:) ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/teepi_maagai.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/teepi_maagai-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/teepi_maagai-300x300.jpg","main-ingredient":["raw mango"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Pickles","Indian Vegetarian Recipes"],"tags":["mangoes","mango_pickle"]}