{"id":1057,"permalink":"http:\/\/www.sailusfood.com\/2008\/05\/07\/vankaya-karam-petti-kura-stuffed-brinjal-roast\/","title":"Vankaya Karam Petti Kura - Stuffed Brinjal Roast","content":"\r\nBrinjals rule and more so in Andhra. I'd even go on to say that it makes the summer bearable. I find this purple beauty with a glossy skin to be the most good-looking vegetable around at the rythu bazaar (famer's market). There is something about this versatile summer vegetable that gets me excited whenever I venture to cook it for the day's meal. :) \r\n\r\nI woke up this morning craving for a brinjal roast with rice and pappu pulusu. With numerous stuffings to chose from I finally decided on a stir fry recipe which calls for toasted, coarsely ground spices stuffing for the brinjals that are roasted on slow fire till you achieve a succulent yet crisp texture. Small, purple tender brinjals work best for this recipe. Makes a delectable side with rice and pappu pulusu or sambar.\r\n\r\nVankaya Karam Petti Kura Recipe\r\nPrep & Cooking: 45-50 mts\r\nServes: 3-4 \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg purple brinjals, wash, make + quarters with stalk intact and apply oil\r\n\r\n1 tbsp oil\r\n\r\nfew curry leaves\r\n\r\nFor stuffing:\r\n\r\n1 1\/4 tbsps coriander seeds\/dhania\/dhanayalu\r\n\r\n3 tbsps channa dal\/bengal gram\/senaga pappu\r\n\r\n1 1\/2 tbsps urad dal\/split gram dal\/minappa pappu\r\n\r\n2-3 dry red chillis, tear and de-seed\r\n\r\n1\/2 tsp cumin seeds\/jeera\/jeelakara\r\n\r\npinch of methi seeds\/fenugreek\/menthulu (optional)\r\n\r\nbig pinch asafoetida\/hing\/inguva\r\n\r\nsmall gooseberry sized tamarind\r\n\r\nsalt to taste\r\n\r\n\r\n1 Add 1\/2 tsp oil in a cooking vessel, add coriander seeds and stir fry till it turns slightly dark in color. Remove. Similarly, add channa dal and urad dal, roast till them till they turn red and remove. Dry roast dry red chillis, methi seeds and cumin together for 2 mts and remove. Cool the dry roasted ingredients. Add turmeric pwd, salt, tamarind, hing to these roasted ingredients and grind them all together to a coarse pwd. It should not be wet.\r\n2 In the same vessel, add the remaining oil, add curry leaves and toss them for a few seconds. Place the stuffed brinjals in the oil and cook on high flame for 4-5 mts. Now, cover with lid and let them cook on medium flame for 10-12 mts. Keep checking in between and stir fry to ensure they don't burn or stick to the pan. \r\n3 Now on low flame nicely roast the brinjals without lid. It should take 35-40 mts for the brinjals to cook inside and be well roasted. \r\n4 Serve with rice, pappu pulusu or sambar and papad.\r\n\r\nNote: Alternately, you could place the stuffed brinjals in a aluminium foil, spray oil and bake till done. This recipe can be tried without tamarind too. Any left over stuffing can be used as a kura podi with stir fries (vegetables like okra\/brinjals\/bitter gourd ).\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/stuffed_brinjals.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/stuffed_brinjals-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/stuffed_brinjals-300x300.jpg","main-ingredient":["brinjal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["vankaya"]}