{"id":10627,"permalink":"http:\/\/www.sailusfood.com\/2010\/10\/25\/gutti-kakarakaya-stuffed-bitter-gourds\/","title":"Gutti Kakarakaya ~ Stuffed Bitter gourds","content":"Gutti Kakarakaya - Stuffed Bitter gourds\r\n\r\nWe visited a friends farm recently and came back loaded with farm fresh vegetables. I plucked a few tender bitter gourds off the vine keeping in mind a favorite recipe that calls for slender gourds. The recipe in question is an Andhra classic - Gutti Kakarakaya. Its a simple dish and my favorite go-to recipe for special occasions. The roasting process intensifies the flavor of the stuffing while charring and softening the bitter gourds. The unmistakable bitterness of kakarakaya is balanced with the spiced, tangy-sweet stuffing comprising of onions, garlic, jaggery, tamarind and red chilies.\r\n\r\n\r\n\r\nGutti Kakarakaya Recipe\r\nPrep & Cooking: 1 hr\r\nServes: 3-4\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n6-7 tender bitter gourds, make a slit length wise and remove the seeds\r\n\r\nsmall lemon sized tamarind, extract pulp\r\n\r\nFor stuffing:\r\n\r\n1 large onion, sliced\r\n\r\n4-5 garlic cloves\r\n\r\n1\" cinnamon stick\r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/4 tsp cumin pwd\r\n\r\npinch of roasted methi pwd\r\n\r\n1 1\/2 tsp coriander pwd\r\n\r\n1 tbsp grated jaggery or sugar (adjust)\r\n\r\nsalt to taste\r\n\r\nFor poppu\/tadka\/seasoning:\r\n\r\n1 1\/4 tbsps oil\r\n\r\n1\/4 tsp methi seeds\r\n\r\na sprig of curry leaves\r\n\r\n\r\n\r\n1 In a vessel, add 1\/4 cup buttermilk, pinch of salt and 1\/2 tsp turmeric pwd and combine. Place the partially slit whole bitter gourd in this mixture for 10-15 mts. Remove any trace of liquid off the bitter gourds. Keep aside. [Note: This process helps in removing bitterness of bitter gourd. You can skip the soaking in buttermilk process if you want.]\r\n2 Prepare the stuffing by heating a tsp oil in a cooking vessel, add garlic and cinnamon stick and saute for a few seconds. Add the sliced onions and saute till rawness disappears. Approx 4 mts. Keep aside to cool.\r\n3 Once cool, make a coarse paste. Remove the paste into bowl, add salt to taste, red chilli pwd, jaggery, coriander pwd, cumin pwd and methi pwd. Combine well and stuff the bitter gourds with this paste. \r\n4 Add the remaining oil in a vessel, add curry leaves and toss them for a few seconds. Add the methi seeds and let them turn brown. Place the stuffed bitter gourds in the oil along with any left over stuffing and cook on medium high flame for 2 mts. Now, cover with lid and let them cook on medium low flame for 15 mts. Keep checking in between and stir fry to ensure they don't burn or stick to the pan. \r\n5 Add the tamarind extract along 1\/4 cup of water. Reduce flame and place lid and cook over low flame for another 10-12 mts. The water content should reduce. Remove lid and cook over low flame and let the bitter gourds roast well and it appears like a dry saute (mudda kura). It should take about 8-10 mts for them to be well roasted. Turn off heat.\r\n6 Serve with rice.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/10\/gutti-kakarakaya.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/gutti-kakarakaya-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/gutti-kakarakaya-300x300.jpg","style":["easy","modern"],"course":["side"],"special-diet":["eggless","dairy free","nut free","vegetarian","vegan","kid friendly"],"cuisine":["andhra"],"cook-time":"45","prep-time":"15","main-ingredient":["bitter gourd","onion","tamarind"],"serves":"4","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["gutti-kakarakaya","karela","stuffed-bittergourd"]}