{"id":10721,"permalink":"http:\/\/www.sailusfood.com\/2010\/11\/22\/guacamole-mexican-avocado-dip\/","title":"Guacamole ~ Mexican Avocado Dip","content":"Guacamole\r\n\r\nRaw food at its best - Guacamole. Pleasing to the eye and palate, this delightful Mexican classic is a quick versatile dish usually served as a dip\/salsa or as a spread over sandwich or wraps. All of us at home relish avocados and use it to prepare a spread or go the salad way. The colorful avocado provides for a rich flavor and creamy texture and is loaded with nutrients and good fats. \r\n\r\nIn India, avocados are grown in a few regions of Tamil Nadu and Karnataka. You can read more about Avocado production in India. It goes by the name 'Venna Pandu' in Telugu and 'Makhanphal' in Hindi. They are not available in the rythu bazaars (farmers market) here in Andhra. You will find them in Spencer's (Vizag) occasionally. \r\n\r\nI was lucky to be gifted few avocados by a friend who chanced upon them on a visit to Coorg. The recipe I have used is close to the traditional Mexican guacamole. Use a slightly ripe avocado and two over ripe avocados while preparing this dish. The traditional recipe calls for a slightly chunky texture and not like a smooth puree. To give it an Indian twist, add a pinch each of roasted cumin, coriander, garam masala and chili powders.\r\n\r\nRipe Avocado, Makhanphal (Hindi) Venna Pandu (Telugu)\r\n\r\nGuacamole Recipe\r\nPreparation: 10 mts\r\nServes 3-4 persons\r\nCuisine: Mexican\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n3 medium size avocados, peel skin, pith and remove the pulp\r\n\r\n1 onion, finely chopped\r\n\r\n2 green chilies, finely chopped\r\n\r\n1 tomato, de-seed and chop finely\r\n\r\n2 tbsp lemon juice\r\n\r\n1 1\/2 tbsps coriander leaves\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 In a bowl, lightly mash the avocado pulp with a fork It should not be a smooth paste but slightly chunky.\r\n2 Add chopped onions, green chilies, tomatoes, coriander leaves, lemon juice and salt to taste. Mix well. Cover with a wrap and refrigerate till use. Use it as a dip or spread over sandwiches and wraps.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/10\/guacamole.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/guacamole-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/guacamole-300x300.jpg","style":["easy","quick","traditional"],"course":["side"],"special-diet":["eggless","dairy free","vegan","vegetarian","nut free","kid friendly","pregnancy"],"cuisine":["Mexican"],"prep-time":"10","main-ingredient":["avocado"],"serves":"4","goes-well-with":["corn chips"],"author":null,"type":"post","categories":["All Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Mexican Recipes","Raw Food Recipes","Recipes Vegetable Dishes"],"tags":["dip","guacamole","mexican"]}