{"id":1076,"permalink":"http:\/\/www.sailusfood.com\/2008\/05\/15\/8-healthy-summer-coolers\/","title":"8 Healthy Summer Coolers","content":"Carrot Delight\r\nHow do you beat the heat during hot summer days? Do you take to aerated colas or home made healthy juices and natural drinks like tender coconut water to quench thirst and soothe parched throats? There was a time during my growing years when I indulged in aerated cold drinks like Goldspot, Limca and Thums Up and its been a good number of years since I have refrained from drinking them. I can't recall when I last had a cola. \r\n\r\nIts sad and unfortunate that the trend in many of our Indian homes (both lower income and higher income groups) today is offering aerated drinks during birthday parties, get-togethers and weddings. With aggressive advertising by MNC's, the illiterate lot have begun to believe that colas are healthy. Visit any village, town or city across the Indian sub-continent and you can hardly find a tender coconut or sugarcane juice vendor who have since been replaced with pan shops carrying billboards of Pepsi and Coco Cola and crates of aerated drinks.  \r\n\r\nDo we need these multinational supplied drinks when we have a range of traditional drinks to chose from that are nutritious, delicious and not to mention, low-cost? Its time to go back to our roots, rediscover the goodness of our simple nimbu paani, buttermilk, lassi, and other traditional drinks like jal jeera, thandai, mango panna and panakam and preserve them from oblivion.\r\n\r\nI had recently done an article on 'Summer Coolers' for Marie Clarie magazine (India edition) 2008 May issue in which I shared recipes and images of healthy summer coolers with a South Indian flavor.\r\nSummer Coolers for Marie Claire Magazine\r\nEight summer coolers recipes with images (including recipes done for Marie Claire) have been complied into a document where you can zoom, scroll and print. There is also a downloadable  PDF file.\r\n\r\n\r\n\r\n\r\nRecipes for Marie Claire Magazine:\r\n\r\nMenthi Majjiga\r\nRagi Drink\r\nVasantha Neer\r\nCucumber Cooler\r\nPanakam\r\n\r\nOther recipes:\r\n\r\nWatermelon Surprise\r\nCarrot Delight \r\nWatermelon Treat\r\n\r\nOur family favorites which we relish during the summer months. Dear readers, enjoy these healthy recipes and 'Yeh Dil Maange NO more - Pepsi and Colas'.-:)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/summer-coolers.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/summer-coolers-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/summer-coolers-300x300.jpg","main-ingredient":["mango","tender coconut"],"author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes"],"tags":["drinks","features","summer_coolers"]}