{"id":10783,"permalink":"http:\/\/www.sailusfood.com\/2010\/11\/23\/vegetable-kati-roll\/","title":"Vegetable Kati Roll","content":"Vegetable Kati Roll\r\n\r\nMany a night, our dinner comprises of either soup, salad, wrap or sandwich. Last night I made Kati rolls with vegetable filling. I introduced the avocado based dip - Guacamole flavor to the roll which worked great as a spread and was SO delicious. Works great as a lunch box treat, one that you kid will surely relish. Makes for a complete meal and super easy to bring together. \r\n\r\n\r\nVegetable Kati Roll Recipe\r\nPrep &amp; Cooking: 30-40 mts\r\nMakes 6-7 rolls\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\nFor rotis:\r\n\r\n1 1\/4 cups whole wheat flour\/atta\r\n\r\n1\/2 cup maida\/all purpose flour\r\n\r\n1\/2 tsp salt\r\n\r\nwater to knead the dough\r\n\r\nFor filling:\r\n\r\n2 cups julienne mixed vegetables, beans, carrot, capsicum, beans and cabbage\r\n\r\n1 tsp ginger-green chili paste\r\n\r\npinch of turmeric pwd\r\n\r\n1\/2 tsp chaat masala pwd\r\n\r\n1 tsp Kitchen King Masala (optional)\r\n\r\n2 eggs, beaten (optional)\r\n\r\n1 tbsp lemon juice\r\n\r\n2 onions, finely sliced\r\n\r\nfew tbsps of green chutney\r\n\r\nfew tbsps of guacamole\r\n\r\n2-3 tbsps olive oil\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Add salt to the wheat flour and maida, combine, slowly add water to form a soft yet slightly firm dough. Cover and let it rest till you get the stuffing ready.\r\n2 Blanch the french beans for 3 mts and keep aside. Heat a tbsp of olive oil in a vessel, add the ginger-green chili paste and saute for few secs. Add carrots, cabbage and capsicum and saute for 7-8 mts. Add the blanched beans and saute for another 3 mts. Add turmeric pwd, kitchen king masala and chaat masala pwd and combine. Turn off heat.\r\n3 Add the lemon juice and salt to taste and mix. Keep aside.\r\n4 In a separate bowl, combine the raw sliced onions with 2-3 tbsps of green chutney and keep aside.\r\n5 Beat eggs in a bowl, add salt and pepper and keep aside. (Vegetarians can omit this step)\r\n6 To prepare rotis, pinch a large lemon sized ball of dough, dust the working surface with some atta and roll out the stuffed dough to form 6\"-7\" diameter circles.\r\n7 Heat a iron tawa and once its hot, place a parantha and let it cook lightly on both sides. Prepare all the rotis and place them in a casserole to keep soft.\r\n8 At the time of serving, drizzle some oil on a tawa, fry the roti on one side for 4-5 secs and on top pour 2-3 tbsps of the beaten egg and flip over the roti so that the egg gets cooked.\r\n9 Remove from tawa, place the egg coated side of the roti up and sprinkle some lemon juice on the egg coated side. Spread some guacamole or you can skip this part if you do not have guacamole. Place 3-4 tbsps of vegetable filling in the middle of the roti and sprinkle the onion-green chutney filling over it and roll the roti tightly to form a roll. To serve, wrap the lower part of the rotis in a butter paper or tissue. Enjoy!\r\n\r\nYou can find Chicken Kathi Roll recipe at my other blog, Kids Zone.\r\n\r\nNote: Vegetarians can omit the egg part of the recipe. Use a spread like Guacamole, eggless mayonnaise or green chutney and follow the rest of the recipe.\r\n\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/11\/kathi-roll1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kathi-roll1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kathi-roll1-300x300.jpg","style":["easy","quick","modern"],"course":["appetizer","snack"],"special-diet":["nut free","dairy free","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"20","prep-time":"20","main-ingredient":["vegetables","wheat flour"],"serves":"5","author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Breakfast Recipes","Indian Snacks and Starter Recipes","Lunch Box Recipes","Recipes Vegetable Dishes"],"tags":["kati-roll","rolls","vegetable","wraps"]}