{"id":108,"permalink":"http:\/\/www.sailusfood.com\/2006\/04\/05\/majjiga-mirapakaayalu-sun-dried-chillis\/","title":"Majjiga Mirapakaayalu - Sun-Dried Chillis","content":"Andhras love their mirapakaayalu (green chillis)! Not only do we use them liberally to spice up our curries, pachi mirapakaayalu are used to prepare mirchi bajjis(stuffed green chillis), mirchi khatta masala curry,mirchi ka salan(hyderabadi chilli delicacy) and a hot favorite (among the South Indians) is majjiga mirapakaaylu (sun-dried chillis).\r\n\r\nMajjiga Mirapakayalu\r\n\r\nMajjiga (buttermilk) mirapakaaya, a traditional Andhra recipe and as the name suggests, is green chillis soaked in sour buttermilk and sun-dried. Once the chillis are completely dried, their color changes to a nice beige and develop a withered look. We usually make them in bulk during the summer season and sun dry over our terraces where the heat of the sun is the maximum and preserved in air tight containers. They are also called vooru mirapakaayalu (telugu) and mor molagai (tamil) and when deep-fried, attain a lovely brown shade, a nice crispy texture and a subtle combination of a sour-salty-spicy flavors and are eaten as an accompaniment to pappu annam (dal and rice), rice and curry and especially with curd rice. \r\n\r\nMajjiga Mirapakaaya is a simple recipe but is a labor intensive process and requires some patience as the preparation is spread over a week. All you need are fresh green chillis, thick buttermilk(majjiga), salt and a bright hot sun. :) Usually I use the green chillis which have less spice (the ones shown in the picture below). Wash and pat dry the green chillis and make vertical slits half way along the green chilli on two sides. The slits have to be made such that the green chilli is intact and doesn't open up. Generally the seeds of this particular variety aren't too many so I don't really remove the seeds, as when you make the slits a few seeds do pop out on their own. You can remove a few seeds but ensure you dont break the green chilli. Now soak them in enough quantity of thick buttermilk (one kilo of green chillis will require 2 tbsps of salt) with salt added to it till they are well immersed for 3 days (and nights). Cover and shake them twice a day.\r\n\r\n\r\n\r\nTake out the green chillis from the butter milk on the fourth day morning and sun dry it all day by spreading them over 4-5 sheets of newspapers or thick plastic sheet and put them back in the same majjiga again later in the evening at sunset (I usually do this between 6-7 pm). Remember to remove them in the evening and put them back in the buttermilk and let them sit in it all night before you again remove them the next morning to be sun-dried. Continue this process for at least 3 days. Then throw away the left over sour buttermilk and continue to sun dry the chillis till completely dry (which is usually 3-4 days).\r\n\r\n\r\n\r\nStore them in an air tight container and deep fry them in hot oil till crisp and golden brown (like you fry papad and vadiyaalu) as and when required. These dried chillis aren't as spicy as they may appear and it also depends on the spice of the green chilli used in preparing the majjiga mirapakaayalu. If you are one of those who really likes a very spicy chilli then choose the spicer varieties of green chilli when preparing the majjiga mirapakaayalu. (The soaking of the chillis in majjiga will reduce the pungency of the green chilli whatever its spice level).There is another version of preparing the majjiga mirapakaayalu with stuffing (of carom seeds and cumin) which I hope to share in my future posts.\r\n\r\n\r\n\r\n\r\nThe classic combination of flavors of this traditional Andhra favorite, majjiga mirapakaaya, will delight you and I find it hard to put in words the feeling you experience when you bite into a cruncy sun-dried chilli and savor its taste. Its simply heavenly! Even a simple curd rice when eaten with a majjiga mirapakaaya makes it a special meal.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2006\/04\/majjiga_mirapa_kaayalu1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/majjiga_mirapa_kaayalu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/majjiga_mirapa_kaayalu1-300x300.jpg","main-ingredient":["green chillis"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"],"tags":["majjiga","mirapakayalu"]}