{"id":1088,"permalink":"http:\/\/www.sailusfood.com\/2008\/05\/20\/attukula-attu-poha-dosa-tomato-chutney\/","title":"Attukula Attu (Poha Dosa) - Tomato Chutney","content":"Among the myriad varieties of dosas, a special mention must be made of Attukula dosa which also goes by the name of 'Sponge Dosa' because of its soft and spongy character. Friends who have tasted this dosa for the first time at our home have asked for the recipe. Sponge dosas are light and soft in the center with a slight crisp along the edges, simple yet delicious. \r\n&nbsp;&nbsp;\r\nRice, rice flakes (poha\/attukulu) and fenugreek seeds are soaked in sour buttermilk overnight and ground to a smooth paste, the next morning. Unlike the masala dosa, here the dosa batter is not made into a large concentric circle on the tava. Ladleful of batter is poured on a hot tava to spread on its own, covered with lid and cooked to a soft and spongy texture. \r\n\r\nFor Attukula Dosa:\r\n \r\n2 cups rice\r\n1\/2 cup attukulu\/poha\/aval\/rice flakes\r\n3 1\/2 cups thick buttermilk (sour)\r\n1 tsp methi seeds\r\n1\/4 tsp cooking soda\r\n1\/2 tsp salt\r\noil as required\r\n\r\nSoak rice, poha, methi seeds in thick buttermilk overnight (8-10 hrs). Next morning, grind to a smooth paste. The batter should be of pouring consistency. Add salt and cooking soda and combine well. Leave aside for 2 hours.\r\n\r\nPre-heat an iron tawa on high for half a minute. Do the water test (sprinkle few drops of water over the hot tawa such that it sizzles) and reduce heat. Pour a large ladle full of dosa batter in the center of the tawa and gently with the back of the ladle make a very slight circular motion (as shown in the picture below) or just let the batter spread on its own naturally. Pour a half a tsp of oil like drops along the edge of the dosa. Cover with a lid and on medium heat let the dosa cook for a minute till the rawness disappears and the dosa browns. Flip the dosa and let it cook for a less than half a minute (need not cover with lid). Flipping the dosa and cooking on the other side is optional.\r\n\r\nFor Tomato Chutney:\r\n \r\n2 large tomatoes\r\n1 tsp cumin seeds\r\n2-3 green chillis\r\npinch of asafoetida\r\n1\/2 tsp salt\r\n3 1\/2 tsps oil\r\n\r\nHeat three tsps oil in a pan, add a tsp of cumin seeds and 3 green chillis and saute for a minute. Add 2 large sliced tomatoes and saute till they turn soft. Turn off heat and cool. Grind the sauteed tomatoes along with salt to a smooth paste (no water). For tempering, heat half a tsp of oil in a pan, add a half a tsp of mustard seeds and let them splutter. Add a dry red chilli, few curry leaves and pinch of asafoetida and  turn off heat. Pour this seasoning over the chutney and serve with sponge dosas.\r\n&nbsp;&nbsp;\r\n\r\nSponge dosa with tomato chutney ~ Breakfast today","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/08\/poha_dosa_tomato_chutney1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/poha_dosa_tomato_chutney1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/poha_dosa_tomato_chutney1-300x300.jpg","main-ingredient":["beaten rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Chutney Recipes - Pachadi"],"tags":["sponge_dosa"]}