{"id":109,"permalink":"http:\/\/www.sailusfood.com\/2006\/04\/07\/panakampanaka-traditional-indian-drink-summer-cooler\/","title":"Panakam,Panaka - Traditional Indian Drink (Summer Cooler)","content":"Today is Sri Rama Navami,an important festival especially among the Vaishnava sect of the Hindus. Sri Rama Navami falls on the ninth day of the Hindu lunar year (Chaitra Masam) and is observed as the wedding day of Lord Rama and Sita as well as the birthday of Lord Rama.This day also marks the end of the nine day Utsavam called Vasanthothsavam (festival of spring), that starts with Ugadi.Read more about Sri Rama Navami festival.Today we prepare Panakam (Telugu) or Panaka (hindi), a festive sweet drink and a summer cooler prepared with jaggery and flavored with dry ginger,cardamom and pepper.We also prepare Vada Pappu (split yellow moong dal) with Chalimidi (rice flour based sweet) as naivedyam or prasadam.\r\n\r\n\r\n\r\nPanakam Recipe \r\nIngredients:\r\n2-3 tbsps grated jaggery\r\n2 glasses water\r\npinch of dry ginger pwd\r\n1 coarsely crushed cardamom\r\n2 coarsely crushed pepper corns\r\n\r\nMix the grated jaggery in water and let it dissolve completely. Filter the jaggery water. Add dried ginger powder, crushed cardamom and crushed pepper. Mix well and serve it at room temperature or chilled.\r\n\r\nSometimes during the hot season I serve this traditional Indian drink as a summer cooler or a welcome drink to quench the thirst and its cooling properties helps to cool our system too. This age-old simple recipe has the luxury of the cardamom flavor,the sharp heat of the pepper and ginger pwd blending with the sweet flavor of jaggery water which is so refreshing that you can have 2-3 glasses at one go and still be asking for more. :)\r\n\r\nNote: Ginger, Pepper and Sonti (dry ginger) are traditionally recommended by Ayurvedic Nutrition to heal ailments of the stomach and throat and especially recommended as home remedies for cold and cough.\r\n\r\nVada Pappu And Chalimidi\r\n\r\n\r\n\r\nVada pappu is split yellow moong dal (pesara pappu) soaked in water for half an hour and strained. This dal is not cooked and is eaten along with chalimidi.\r\n\r\nChalimidi is prepared by soaking raw rice in water for 4-5 hours, strained and the rice is spread out on a dry cloth and left to dry completely before being ground to a fine powder. To this rice powder (1 cup), add grated jaggery (1\/2 cup) and coarsely crushed elachi (2). Wet your hands and mix the ingredients well till you get a smooth soft dough like consistency. Chalimidi is to be eaten in combination with vada pappu.\r\n\r\nPanakam is my favorite traditional summer drink after majjiga which is made not only as a festive sweet drink but also as a summer cooler and adds to my list of Indian Drinks And Sharbats.For those who havent tried panakam as yet,do try it and you will love it for sure. :)\r\n","main-ingredient":["jaggery"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Drink - Sharbat Recipes","Indian Festivals"]}