{"id":110,"permalink":"http:\/\/www.sailusfood.com\/2006\/04\/09\/badam-kheer-almond-dessert-drink\/","title":"Badam Kheer - Almond Dessert (Drink)","content":"An aromatic Indian culinary enticement that is an absolute delight to the sweet-toothed is Badam Kheer, a milk based dessert\/drink where ground almonds are cooked in milk and sugar and flavored with saffron and cardamom. Its not-so-creamy texture, mild nutty flavor of almonds,  aromatic rich flavor of saffron and cardamom make it a delicious sweet drink after a dinner party or a spicy meal.\r\n\r\nBadam Kheer Recipe\r\n\r\nIngredients:\r\n25 almonds (badam pappu)\r\n1 litre milk\r\n1\/4 cup water\r\n1\/2 cup sugar\r\n4-5 crushed green cardamoms\r\n10-15 strands saffron soaked in warm milk\r\n\r\nSoak almonds in hot water for 15 minutes and peel the skin and grind the almonds to a paste adding half a cup of water.\r\nBring the milk to a boil in a heavy bottomed vessel and add the sugar and almond paste and then on low heat keep stirring once in while till the milk is reduced to 3\/4 th of its quantity. Ensure that you stir so that it doesnt burn.\r\nAdd the cardamom pwd and stir well.Turn off heat.\r\nSoak saffron strands in some warm milk and stir it well and add it to the kheer.\r\nGarnish with silvered almonds and serve chilled.\r\n\r\nNote: Badam Kheer, which is one of my family's favorite drink, can be made to a thicker consistency by boiling the milk till it is reduced to half its original quantity like payasam. I prefer to make it to a drinking consistency by boiling the milk to 3\/4th of its original quantity. You can use low fat milk or half and half. The sugar quantity can be adjusted to your choice. It can also be served warm.\r\n\r\nAlmonds are highly nutritious and are essential nuts for growing children and also give a glow to our skin. Badam Kheer, a family favorite dessert drink, joins my list of Indian Drinks And Sharbats.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/badam_kheer_almond_sweet_drink1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/badam_kheer_almond_sweet_drink1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/badam_kheer_almond_sweet_drink1-300x300.jpg","main-ingredient":["almonds"],"author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes","Indian Sweets Recipes","Indian Vegetarian Recipes","Sweet Dessert Recipes"],"tags":["almonds","badam","kheer"]}