{"id":1100,"permalink":"http:\/\/www.sailusfood.com\/2008\/05\/21\/kheema-sandwich\/","title":"Kheema Sandwich","content":"You can hardly call this a recipe since it more of a brunch or lunch idea that I often resort to especially during summers since its simple, quick and easy. Sometimes I use left overs of vegetable stir fries (especially okra or eggplant) as sandwich fillings and today, I wanted to finish the left over mutton kheema and what best way than make a sandwich with minimum preparation work. Absolutely impressive in taste, this simple comfort food certainly made my day.:)  Its quite filling and best suited for brunch or lunch. Try it and you will be receiving accolades from those who have a bite of this kheema sandwich.\r\n\r\n\r\nFor Mutton Kheema:\r\nHeat one and half tbsps of oil in a pressure cooker. Add half a cup of chopped onions and saute till transparent. Add a tsp of ginger garlic paste and saute further for another 3 mts. Add 1\/4 kg washed kheema and cook for 7-8 mts on high heat, stir once in while. Add 1 tsp red chilli pwd, 1 tsp coriander pwd, 1\/4 tsp garam masala pwd and salt to taste. Combine well. Add half a cup of water and pressure cook till the kheema is completely cooked and soft. This could take about 15-20 mts. Turn off heat. Kheema is supposed to be semi dry, and can be cooked further without lid till there is no water content.\r\nTo assemble the sandwich:\r\nToasted bread, slices of onion, tomato, cucumber, capsicum and kheema. Pretty simple affair, just layer toasted bread with slices of tomatoes, onions and cucumber, a generous amount of the kheema, layer of capsicum rings and finally top with toasted bread and your meal is ready. I used white bread though both brown and ragi bread work fine.\r\n\r\n\r\nMy entry to the Sandwich festival, a food event started by Anupama of Food-n-More.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/05\/sandwich.gif","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sandwich-150x150.gif","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sandwich-300x300.gif","main-ingredient":["minced meat"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes"],"tags":["kheema","sandwich"]}