{"id":1103,"permalink":"http:\/\/www.sailusfood.com\/2008\/05\/22\/eggless-banana-crumb-muffins\/","title":"Eggless Banana Crumb Muffins","content":"There were a few over-ripe bananas on the kitchen counter waiting to be used and since no one was going to eat them, I decided to bake banana muffins.  Unfortunately, the heat we've been experiencing here didn't motivate me to bake yesterday. So, the first thing I did today morning on entering the kitchen was to make preparations to bake. My son woke up, walked into the kitchen which was filled with a wonderful aroma of baking and said, \"Amma, what are you making for breakfast? The house is smelling so nice.\" He sure had a sweet cute-cooking surprise for breakfast.:) \r\nEggless Banana Crumb Muffin\r\nThe recipe that I have followed with some tweaking is Allrecipes banana crumb muffin recipe which calls for a crunchy crumb topping for the banana muffins. The batter was easy to put together with rewarding results. The banana muffins were soft and moist, cinnamon added a wonderful flavor, the banana and chocolate chips pairing was just perfect and the crunchy sparkling crumb stole the show. Isn't it amazing that such sorry looking mushy bananas can be transformed into such wonderful treats?:)\r\n&nbsp;&nbsp;Banana muffin batter and with crumb topping before baking\r\n\r\n\r\nEggless Banana Crumb Muffins Recipe\r\nPreparation: 10 mts, Baking: 20-25 mts\r\nMakes approx 12 muffins\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n4 very ripe large bananas, mashed\r\n\r\n1 cup all purpose flour (maida)\r\n\r\n1\/2 cup whole wheat flour (atta)\r\n\r\n1\/3 cup unsalted butter, melted\r\n\r\n1 tsp baking powder\r\n\r\n1\/2 tsp baking soda\r\n\r\n1\/4 tsp salt\r\n\r\n1\/2 tsp cinnamon pwd\r\n\r\n1\/2 cup brown sugar\r\n\r\n1\/4 cup white sugar\r\n\r\n2 tbsps yogurt\r\n\r\n1 tsp vanilla essence\r\n\r\n1\/2 cup chocolate chips (optional)\r\n\r\nFor crumb:\r\n\r\n1 1\/2 tbsp brown sugar (I used demarara sugar)\r\n\r\n1 tbsp all purpose flour\r\n\r\n1\/2 tbsp butter\r\n\r\n\r\n\r\n1 Preheat oven to 350 degrees F (180 degrees C) and place the oven rack in the middle of the oven. \r\n2 In a large bowl combine the flours, sugars, baking powd, baking soda, cinnamon pwd, salt and chocolate chips. Use a whisk to combine. Set aside.\r\n3 In another bowl combine the mashed bananas, yogurt, butter and vanilla. With a wooden spoon, lightly fold the wet ingredients (banana mixture) into the dry ingredients until just combined and batter is thick. Do not over mix the batter. \r\n4 Prepare crumb by combining together the brown sugar, flour and butter. Keep aside.\r\n5 Spoon the batter into the prepared muffin liners half way through and sprinkle some crumble on top of each muffin. Bake for about 22-25 minutes or until a toothpick inserted in the center comes out clean.\r\n6 Place on a wire rack to cool and remove muffins from pan. Serve warm or at room temperature.\r\nNote:The original recipe called for an egg which I replaced with a mashed banana and 2 tbsps yogurt.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/05\/banana_crumble_muffin.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/banana_crumble_muffin-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/banana_crumble_muffin-300x300.jpg","main-ingredient":["bananas"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes","Fruit Recipes","Sweet Dessert Recipes"],"tags":["banana","features","muffins"]}