{"id":1110,"permalink":"http:\/\/www.sailusfood.com\/2008\/06\/06\/bloggers-unite-support-bri\/","title":"Bloggers Unite - Support Bri","content":"We, bloggers, have come together to support a noble cause. Fellow food blogger, Brianna Brownlow, who blogs at Figs With Bri, is battling against breast cancer and to meet the treatment costs not covered by her health insurance, we are raising funds. We need to raise $12,000 by 15th July, 2008 and Bri needs all the support we can extend to her. \r\n\r\nAt the age of 15, Bri lost her 41-year old mother to cancer. Now, Bri is battling against breast cancer. Bri was diagnosed with breast cancer two and a half years ago. A mastectomy, chemotherapy and two years of relatively good health later, the cancer is back. It has metastasized to other parts of her body. She is going through intensive chemo and is trying holistic methods of treatments to boost her immune system. Unfortunately, her health insurance does not cover holistic treatments. \r\n\r\nBee and Jai of Jugalbandi have dedicated a special edition of CLICK to Bri and are instrumental in organising this fundraiser. CLICK is a monthly theme-based photography contest hosted by Bee and Jai. This month's theme is Yellow, the color of hope. The deadline for entries is June 30, 2008. The entries can be viewed here. The fundraiser will extend until July 15, 2008. \r\n\r\nThere's a raffle with exciting prizes on offer. After viewing the list, you may make your donation here or at the Chip-In button placed on any participating website\/blog which will take you to a secure donation page. Your donation can be made through credit card or Pay Pal that goes directly to Bri's account.\r\n\r\nYou can support this campaign by donating to the fundraiser, by participating in CLICK and by publicizing this campaign. We appeal to our fellow bloggers and readers to help achieve the goal of raising $12,000 to meet Bri's treatment costs.\r\n\r\n I'm in the midst of a blogging break (vacation) and will continue to be away for a while. I received an email from Bee of Jugalbandi seeking support for Bri, hence took time out to help spread the word. Will resume blogging after 15th June. My friend is handling issues at Taste of India during my absence. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/06\/yellow_hibiscus.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/yellow_hibiscus-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/yellow_hibiscus-300x300.jpg","author":null,"type":"post","categories":["All Recipes","Misc"],"tags":["fundraiser"]}