{"id":1115,"permalink":"http:\/\/www.sailusfood.com\/2008\/06\/18\/vegetable-noodles-vegetables-in-spicy-garlic-sauce\/","title":"Vegetable Noodles & Vegetables in Spicy Garlic Sauce","content":"I'm back from a much needed blogging break. My son's school re-opened on Monday after a 2 month summer vacation break and he is super excited to find 'new' friends in his 'new' class (he's in 1st Std). Can't put in words the surge of feelings I felt as I watched him mingle with his classmates and class teacher (I learnt she's a sweet lady and popular among her students). I don't know if he felt I should leave the school premises but I didn't have the heart to leave. An easy transition from primary school and a happy moment in my life. We learned a lot this past academic year about his likes and dislikes, strengths and weaknesses and I can't wait to see how he faces new challenges and what he accomplishes this year. Any first grader mommies there who read me? :)\r\n\r\n&nbsp;&nbsp;\r\nVegetable Noodles and Vegetables in Spicy Garlic Sauce\r\nI love Indian Chinese fusion cooking and I hardly know anyone who doesn't relish Indo-Chinese food. Today's lunch was Vegetable Noodles and to compliment it was Vegetables in Spicy Garlic Sauce where vegetables are tossed in a spicy garlic flavored tomato sauce. A satisfying complete meal loaded with vegetables and starch.\r\n\r\n\r\nVegetable Noodles\r\nVegetable Noodles Recipe\r\nPrep & Cooking Time: 30 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1 packet egg noodles (boiled, drained in cold water and tossed in 1-2 tsps oil)\r\n\r\n1\/4 cup spring onions, finely chopped\r\n\r\n1 onion sliced\r\n\r\n2 cups julienned vegetables (carrots, beans, cabbage and capsicum)\r\n\r\n1 tsp soya sauce\r\n\r\n1 tsp green chilli paste (optional)\r\n\r\n1\/2 tbsp vinegar\r\n\r\npepper pwd as required\r\n\r\nsalt as required\r\n\r\n1 1\/2 tbsps sesame oil or peanut oil\r\n\r\n\r\n\r\n1 Heat a tbsp and a half of sesame oil in a large wok and once the oil is piping hot, add the spring onions and sliced onions and stir fry for 1 mt on high.\r\n2 Add the rest of the vegetables and toss them on high heat for 4 mts.\r\n3 Add salt, pepper pwd, soya sauce and combine. Add the drained noodles and combine well. \r\n4 Add vinegar and toss the noodles and vegetables on high heat for a few seconds. Turn off heat. Garnish with chopped spring onion greens and serve hot with vegetables in spicy garlic sauce.\r\n\r\nVegetables in Spicy Garlic Sauce\r\n\r\nVegetables in Spicy Garlic Sauce Recipe\r\nPrep & Cooking Time: 35-40 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n2 tbsps finely minced garlic\r\n\r\n1 tsp finely minced ginger\r\n\r\n1\/4 cup spring onions, finely chopped\r\n\r\n1 finely chopped green chilli\r\n\r\n2 1\/2 cups vegetables (tomatoes, baby corn, capsicum, beans, carrot, cabbage), chopped into bite sized pieces\r\n\r\n1 tsp red chilli paste\r\n\r\n1 tsp light soya sauce (optional)\r\n\r\n1\/2 tbsp vinegar\r\n\r\n1 1\/2 tsps brown sugar\r\n\r\n2 tbsps tomato ketchup\r\n\r\n1 1\/2 tbsp cornflour\r\n\r\n1 1\/2 cups water\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsps sesame oil or peanut oil\r\n\r\n\r\n\r\n1 Heat a tbsp of sesame oil in a large wok and once the oil is piping hot, add the minced garlic and ginger stir fry for half a minute.\r\n2 Add the chopped spring onion whites and green chillis stir for a few seconds. Add the chopped vegetables (except tomatoes) and stir fry on high for 4-5 mts, constantly tossing them.\r\n3 Reduce to medium heat and add the red chilli paste, brown sugar, soya sauce, tomato ketchup and vinegar. Combine well and cook for 2 mts.\r\n4 Add the tomato quarters and stir fry till the spices coat the vegetables well for about a minute or two. Keep stirring constantly lest it burns.\r\n5 Add water and salt and cook on high till the water reduces to half its quantity. Combine a little water to the cornflour such that there are no lumps and slowly add to vegetables, stirring constantly.\r\n6 Keep stirring till the sauce thickens and turn off heat. Garnish with spring onion greens and serve hot with noodles or fried rice.\r\n\r\nNote: You can also add mushrooms, tofu and green peas.\r\nMy entry to AWED - Chinese food event hosted by Dhivya of Culinary Bazaar.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/06\/vegetable-noodles.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable-noodles-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable-noodles-300x300.jpg","main-ingredient":["noodles","carrots"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Recipes Vegetable Dishes"],"tags":["indo_chinese_food","noodles"]}