{"id":112,"permalink":"http:\/\/www.sailusfood.com\/2006\/04\/13\/palak-kofta-vegetable-balls-served-in-creamy-spinach-sauce\/","title":"Palak Kofta - Vegetable Balls Served In Creamy Spinach Sauce","content":"\r\nA major influence on Indian cuisine is the Muslim method of cooking, the Mughlai style, which is distinct in the fact that a lot of stress is laid on cooking the food over slow fire and the use of rich spices and nuts like saffron, almonds, cashewnuts, poppy seeds,e lachi, dalchini and jaiphal to name a few, liberal use of desi ghee and tandoor. Most traditional Mughlai food preparations include the use of curds and cream to produce a rich creamy gravy and the most important part of Mughlai cuisine is the perfect blending of the spices using the right proportions bringing a distinct aroma and flavor to the dish, be it the paneer kebab or meat kebabs.\r\n\r\nPalak Kofta is one such rich Mughalai dish where koftas which are balls made with spinach, potatoes and paneer are deep-fried and cooked and served in a rich creamy sauce prepared with spinach, onions, tomatoes and cashewnut paste. Its a labor intensive dish but its worth the effort and makes a great main course party dish and goes well with butter naan and rotis.\r\n\r\n\r\n\r\n\r\nPalak Kofta Recipe\r\n\r\nIngredients:\r\n\r\nFor Koftas:\r\n2 tbsp grated paneer\r\n1 cup palak leaves (washed and chopped finely)\r\n1 cup of mashed boiled potatoes\r\n2 green chillis finely chopped\r\n1\" ginger piece minced\r\nsalt to taste\r\n2 slices of bread\r\nMix all the above ingredients and make small lemon sized balls, roll them in corn flour\/bread crumbs and deep fry in oil.\r\n\r\nFor the Gravy:\r\n1 big bunch of palak (spinach)- washed,blanched and pureed\r\n2 big onions (blanch the onions and make a paste)\r\n2 medium tomatoes (blanche the tomatoes and make a paste)\r\n1 tsp ginger garlic paste\r\n1\/4 tsp garam masala pwd\r\n1 tsp red chilli pwd\r\n2 tbsps cashewnut paste\r\nsalt to taste\r\n2 tbsp ghee (clarified butter)\r\n1 tsp shah jeera (caraway seeds)\r\ncream for garnish(optional)\r\n\r\nHeat ghee in a cooking vessel and add the shah jeera and let them pop. Add the onion paste and fry for 4-5 minutes on medium heat ensuring that it doesnt burn. Add the ginger garlic paste and fry for another 2-3 mts. Add red chilli pwd and combine. Add the tomato puree and let it cook over slow fire till the ghee separates. Add the palak paste and the cashewnut paste and combine. Add a cup of water and salt. Cover and cook for 10-12 minutes on low heat. Stir once in a while. Lastly add the garam masala and mix well. Turn off heat.\r\n\r\nJust before serving, spread the koftas on a serving plate and pour the creamy gravy over the koftas and garnish with cream (optional). Serve with hot rotis or naan. If you are serving the dish immediately on cooking, then you can add the koftas to the gravy and simmer over heat for a minute before serving.\r\n\r\nThis recipe with soft melt-in-the-mouth koftas served in an aromatic and rich gravy is an absolutely tantilising, irresistable dish that will have your family or guests licking their fingers..:)\r\nRecipe Source:Adapted from an Indian cooking magazine\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/07\/palak_kofta_curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/palak_kofta_curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/palak_kofta_curry-300x300.jpg","main-ingredient":["spinach"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Milk Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["kofta","palak","spinach"]}