{"id":11246,"permalink":"http:\/\/www.sailusfood.com\/2011\/01\/03\/eggless-rainbow-zebra-cake\/","title":"Eggless Rainbow Zebra Cake","content":"Eggless Rainbow Cake\r\n\r\nNehal insisted I bake a colorful cake for him. So, I decided on an eggless rainbow zebra cake since I ran out of eggs. This cake is more on the lines of the 'Zebra Cake' I blogged sometime ago on Kids Zone. Only difference being, I used more colors to make it colorful. \r\n\r\nNehal was excited watching me layer the colored batter into the pan and couldn't wait to see the final product. It was fun making the cake and the taste was awesome. I had only 3 edible colors on hand but you can use at least 7-8 colors of your choice.\r\n\r\n\r\n\r\n\r\n\r\n\r\nEggless Rainbow Zebra Cake Recipe\r\nPreparation: 15 mts, Baking: 50-55 mts\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups flour\/maida\r\n\r\n1\/4 tsp baking soda\r\n\r\n1\/4 tsp baking pwd\r\n\r\n1 tin condensed milk (400 gms)\r\n\r\n1\/2 cup butter\r\n\r\n2 tbsps oil\r\n\r\n1\/4 tsp vanilla essence (optional)\r\n\r\n3\/4 cup milk\r\n\r\nedible colors of your choice\r\n\r\n\r\n\r\n1 Beat butter, oil and condensed milk till smooth. Add vanilla essence and mix.\r\n2 In a separate bowl, sieve maida, baking soda and baking pwd from a height\r\n3 Add a tbsp of flour and mix, alternating with a tbsp of milk. Repeat the process till the flour is completely incorporated with the wet ingredients. If the batter is too thick, you can add more milk.\r\n4 Take 3 small bowls. Pour 2 heaped tablespoons of plain batter into each of the 3 bowls. I used 3 colors. Add few drops of each of the edible colors in each bowl. Mix well.\r\n5 Preheat the oven to 200 C. Grease the baking pan. The most important part is assembling the cake batter in a baking pan. \r\n6 Pour 1\/2 tbsp of plain white batter in center of the baking pan. Allow it to spread a little. Pour a tsp of one of the colored batter (chocolate color) on top of it and allow to spread a little. Again pour a little less than 1\/2 tbsp of plain batter on top of it. Next add a tsp of another colored batter (pink color) on top of it and pour less than 1\/2 tbsp of plain batter on it. Next add a tsp of another colored batter (yellow color) and on top of it add less than 1\/2 tbsp of plain batter. Keep repeating this process till the batter is complete. \r\n7 Remember to pause for a while for each of the colors to spread before adding the next layer. There is another optional step where you can run a toothpick on top to create a floral effect as shown in the picture above.\r\n8 Bake for 10 minutes at 200 C and reduce temp to 175 C and bake for another 40-45 mts. Insert a toothpick into the center of the cake and it should come out clean. Remove from the oven. Leave aside for 30 mts and invert the cake onto a cooling rack. Turn the cake back over and cool further. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/01\/rainbow-eggless-cake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rainbow-eggless-cake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rainbow-eggless-cake-300x300.jpg","style":["easy","modern"],"course":["snack","dessert"],"special-diet":["eggless","dairy","nut free","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"60","prep-time":"15","main-ingredient":["condensed milk","flour","edible colors","butter"],"serves":"8","goes-well-with":["milk","chocolate milk","flavored milk","coffee"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Eggless Cake &amp; Cookie Recipes","Eggless Dessert Recipes","Flour Recipes","Indian Milk Recipes","Sweet Dessert Recipes"],"tags":["cake","eggless","rainbow-cake","zebra-cake"]}