{"id":1128,"permalink":"http:\/\/www.sailusfood.com\/2008\/06\/30\/allam-pachadi-ginger-chutney\/","title":"Allam Pachadi - Ginger Chutney","content":"A simple every day ingredient that adds punch to our meals is ginger. I cannot emphasize enough the  amazing healing and medicinal properties of this knobbly rhizome that have been vividly described in Ayurvedic texts. Those of you who love ginger or like to include ginger in your diet, try this recipe. Though ginger plays the lead role in this pachadi, its flavor is not overpowering. The pungency of ginger is perfectly balanced with the sweetness of jaggery and tangy tamarind. With just a hint of garlic, some protein boost in the form of lentils and topped with toasted mustard seeds this pachadi makes a great accompaniment to idlis, dosas and vadas.\r\n\r\nAllam Pachadi Recipe\r\nPrep & Cooking: 15-20  mts\r\nServes 3-4 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2\" to 2\" ginger root, remove skin, slice (reduce if you can't take spice)\r\n\r\n1 tbsp split black gram dal (minapa pappu)\r\n\r\n1 1\/2 tbsps bengal gram (senaga pappu) \r\n\r\n1 green chilli\r\n\r\n2 dry red chillis (adjust to suit your spice level)\r\n\r\n2 garlic cloves (optional)\r\n\r\nsmall lemon sized tamarind\r\n\r\n2-3 tbsps grated jaggery\r\n\r\n1\/4 cup water (adjust)\r\n\r\nsalt to taste\r\n\r\n2-3 tsps oil\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n6-7 fresh curry leaves\r\n\r\n1 tsp oil or ghee\r\n\r\n\r\n\r\n1 Heat a tsp of oil in a non-stick pan. Add the split gram dal, bengal gram and let them turn slightly red and a nice aroma emanates. Add the red chillis, green chilli and garlic and saute for a minute. Remove and keep aside.\r\n2 In the same pan, add the remaining oil, add ginger and saute till it turns red (approx 3 mts). Remove from heat and cool.\r\n3 Grind the roasted dal mixture, sauteed ginger, tamarind, jaggery along with salt, to a slightly coarse paste by adding about one-fourth cup of water. \r\n4 Heat oil or ghee in a pan and add the mustard seeds, let them pop and add the curry leaves and fry for a few seconds. Add this seasoning to the ground pachadi. Serve with idlis, dosas or vadas.\r\n","main-ingredient":["ginger"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes","Recipes Vegetable Dishes"],"tags":["allam","ginger","pachadi"]}