{"id":1150,"permalink":"http:\/\/www.sailusfood.com\/2008\/07\/11\/small-breads-buns-pav-bowknot-twist-rolls\/","title":"Small breads - Buns, Pav, Bowknot & Twist Rolls","content":"Although I bake pretty regularly, I'm yet to master the art of baking especially breads. My recent quest with bread making, had me gingerly tip toeing into preparing different types of dinner rolls from the 'basic white bread dough'. I was pleasantly surprised at how easy it was to shape different types of rolls or small breads from the left over bread dough I made few weeks ago. It took a little practice but it was fun.:)\r\n\r\n&nbsp;twist roll and bowknot roll\r\n&nbsp;buns and garlic flavored pav (bread)\r\n\r\nEarlier I had posted the white bread recipe which was prepared using a quarter portion of the prepared bread dough. I used the remaining 3 quarters to prepare plain buns, sesame buns, foot-long hot dog buns, garlic flavored pav breads, twist and bowknot rolls. I tried to make 'pav' and I added chopped garlic to the bread dough for a garlic flavored pav and used a pie dish to bake pav.\r\n\r\n&nbsp;bowknot roll dough and garlic pav dough before baking\r\n\r\nBowknot Rolls: Lightly grease a cookie sheet. Use a quarter of the prepared bread dough, cut into 2 equal pieces. On a lightly floured surface, use the palm of your hand to roll each piece into a 9 inch long rope. Tie each rope into a knot. Place both the twist rolls atleast 3 inches apart on the greased cookie sheet. Let rise in a warm place until double in size for 30 mts. Brush with milk and bake in a pre-heated oven at 400 F for 15-17 minutes or until golden. Remove from sheet and cool on wire racks. Brush with butter while warm.\r\n\r\nGarlic flavored pav buns (Pull-Apart Rolls): Pull-apart rolls are made by placing balls of dough close together in a square tin and the baked rolls are pulled apart into individual rolls. The famous 'pav bhaji' bread (pav) is prepared using this method. I used a greased pie dish and placed large lemon sized balls of dough in a circle and in the center as shown in the picture above. Let rise in warm place until double in size for 30 mts (as shown in the image below). Bake in a pre-heated oven at 400 F for 15-17 mts or until golden. Remove from sheet and cool on a wire rack.\r\n\r\ngarlic pav dough after rising, ready to bake\r\n\r\nBuns: Lightly grease a cookie sheet. Using quarter of the dough, divide into 4 equal pieces. Shape 2 of these pieces into a ball, pulling edges under to make a smooth top. Place buns smooth side up on the greased sheet at least 2-3 inches apart. I prepared foot long hot dog buns with the remaining two pieces. Roll the dough into an oblong shape. Let rise in warm place until double in size for 30 mts. Bake in a pre-heated oven at 400 F for 15-17 mts or until golden. Remove from sheet and cool on a wire rack. I sprinkled sesame seeds on one foot long and one round bun. You can top buns with sesame or poppy seeds or whatever your desire. \r\n\r\nTwist rolls: Take half of quartered portion of the dough and roll into a 12 inch rope, fold in half and twist. Seal the ends. Place on greased cookie sheets and proof until doubled in size for about 30 minutes. Brush each roll with milk. You can sprinkle rolls with sesame or poppy seeds. Place on a greased cookie sheet atleast 2-3 inches apart and bake in a pre-heated oven at 400 F for 15-17 mts or till golden. Remove from sheet and cool on a wire rack. Make 2 twist rolls from quarter portion of basic bread dough recipe.\r\n\r\nI'm sending this entry to Bread Baking Day - Small Breads  event started by Zorra  and hosted by Aparna of My Diverse Kitchen.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/buns1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/buns1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/buns1-300x300.jpg","main-ingredient":["flour"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Lunch Box Recipes"],"tags":["buns","dinner_rolls"]}