{"id":1153,"permalink":"http:\/\/www.sailusfood.com\/2008\/07\/09\/idli-karam-podi\/","title":"Idli Karam Podi","content":"\r\nI'm a podi freak. Home made podis come to my rescue when I race against time or on those 'just don't feel like cooking days'. It spares me those extra few minutes in grinding a chutney or prepare a subzi to go with dosas. Simple in preparation, nutritious since most podis are packed with proteins and not to mention, tasty. Today, its Idli karam podi, not that you cannot eat this podi with dosas. Sure you can, its just that the podi smeared with ghee or oil makes a delectable combination with soft fluffy idlis. This same podi can be prepared with innumerable permutations and combinations. I hope to share more of these variations in future posts. For today, I hope you enjoy this recipe.:)\r\n\r\n\r\nIdli Karam Podi Recipe\r\nPreparation: 20 minutes\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n\r\n1 1\/2 tsps oil\/ghee for roasting the dals and spices\r\n\r\n1 cup bengal gram dal\/senaga pappu\r\n\r\n1\/4 cup black gram dal\/minappapu\r\n\r\na little less than 1\/2 cup coriander seeds\r\n\r\n10 dried red chillies, tear into two and de-seed (adjust to suit your spice level)\r\n\r\n8 garlic cloves\r\n\r\nsalt to taste\r\n\r\n\r\n1 Drizzle oil in a heavy bottomed vessel and roast the channa dal on low to medium heat for 3-4 mts. Add split gram dal, coriander seeds and dry red chillis to the roasting channa dal and continue to roast till the dals release their flavor and turn golden. Remove and cool.\r\n2 Place the cooled dals and spices along with salt in a blender and grind to make a coarse powder. Add the garlic towards the end and grind for a few seconds.\r\n3 Store in an air tight container and serve with South Indian tiffins like dosas and idlis with a generous helping of ghee or oil.\r\n\r\nNote: There are many variations to the karam podi. One variation, add a small gooseberry sized tamarind to the above ingredients to get that tangy flavor. Add the tamarind at the time of grinding the ingredients. Another variation is to replace garlic with a little less than 1\/4 tsp asafoetida. Always grind the ingredients only after they are completely cool, otherwise they will a form a lump and you will not achieve the desired powder consistency if ground when still hot. Always store in dry air tight bottles and use a dry spoon to remove the podi. Podis are best consumed within 3-4 weeks of preparation, as they don't retain the freshness after a month or so. You can also refrigerate for a longer shelf life and freshness. ","main-ingredient":["chana dal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Podi Recipes","South Indian Recipes"],"tags":["karam","podi"]}