{"id":11685,"permalink":"http:\/\/www.sailusfood.com\/2011\/06\/20\/pressure-cooker-eggless-mango-cake\/","title":"Pressure Cooker Eggless Mango Cake ","content":"\r\n\r\nA deliciously unfussy and super quick to bring together eggless mango cake prepared in a pressure cooker. Many of you have made requests to post a recipe for a cake prepared in a pressure cooker. I got down to making one on Saturday. Its the first time I made an egg less mango cake and am quite happy with the outcome. A dense cake with a slight bread texture. Cardamom brings a fragrance and flavor of its own complimenting the flavor of mango.\r\n\r\n\r\n\r\nPressure Cooker Eggless Mango Cake Recipe\r\nPreparation: 10 mts, Baking: 35 mts\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/4 cups all-purpose flour\/maida\r\n\r\n1\/4 tsp baking soda   \r\n\r\n1 1\/4 tsps baking powder\r\n\r\npinch of salt\r\n\r\n2\/3 cup sugar \r\n\r\n1\/2 tsp cardamom powder\r\n\r\n3\/4 cup mango puree\r\n\r\n1\/2 cup refined oil\r\n\r\n1\/2 cup buttermilk\r\n\r\n\r\n\r\n1 Heat pressure cooker with lid on high for 5 mts (without the rubber gasket and whistle). Grease and flour an 8\"-9\" inch aluminum baking pan. Keep aside.\r\n2 Sieve flour, baking pwd, baking soda and salt. Add sugar and cardamom powder to the flour mixture and mix. \r\n3 In a bowl, add vegetable oil, buttermilk and mango puree and mix well. Now, add the flour mixture and mix with the wet ingredients. Do not over mix. Gently tap the pan on the kitchen counter once to release any air bubbles.\r\n4  Pour into the prepared aluminum tin.\r\n5 Remove the pressure cooker lid and place a separator at the bottom of the pressure cooker. DO NOT ADD WATER. Using tongs, place the aluminum tin into the pressure cooker. Close lid and on high heat let it cook for 2 mts.\r\n6 Reduce heat to low and cook for 40 mts. Turn off heat and do not open the lid for 5 mts.\r\n7 After 5 mts remove the pressure cooker lid and carefully remove the aluminum pan and cool the cake for 15 mts. Overturn the cake onto a plate and slice. \r\n\r\nNote: Use at least 3 lts pressure cooker pan. Rubber gasket and whistle are not required for the process of baking a cake in the pressure cooker. There is no need to add water to the pressure cooker. We are not steaming the cake. Do not open the lid till 30 mts of cooking time. To check if cake is done, you can open the lid after 30 mts and insert a toothpick to see if the cake is done. \r\n\r\nUpdate: I always bake in an OTG (oven) and never in a pressure cooker. I have posted this recipe due to numerous requests made by readers for a pressure cooker cake. You have to be very cautious when using a cooker to make a cake. I suggest you use an old pressure cooker for preparing cake exclusively. I have used an old cooker. If you regularly make cake in a pressure cooker it will get damaged. Its not good to heat the cooker (without water) for long periods and is unsafe.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/06\/mango-cake-pressure-cooker.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-cake-pressure-cooker-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-cake-pressure-cooker-300x300.jpg","style":["easy","modern"],"course":["snack","dessert"],"special-diet":["eggless","nut free","dairy","vegetarian","vegan","kid friendly"],"cuisine":["western"],"cook-time":"40","prep-time":"10","main-ingredient":["flour","mango","sugar","cardamom"],"serves":"6","goes-well-with":["ice cream"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Eggless Cake &amp; Cookie Recipes","Eggless Dessert Recipes","Fruit Recipes","Indian Vegetarian Recipes"],"tags":["cake","eggless-cake","mango"]}