{"id":11741,"permalink":"http:\/\/www.sailusfood.com\/2011\/06\/27\/chocolate-fudge\/","title":"Chocolate Fudge","content":"Chocolate Fudge\r\n\r\nThere's something magical about 'chocolate'. I'm a chocolate freak and can't seem to get enough. On Friday as Nehal stepped out of home to go to school, he asked me to make something 'chocolate-y'. I was craving chocolate too and the moment he got into the car and waved me goodbye, I went to the pantry to check if I had a tin of condensed milk. YES, I had all the three ingredients - butter, chocolate and condensed milk to make a soft chocolate fudge.\r\n\r\nI love the combination of peanut butter and chocolate and decided to frost the fudge with peanut butter. Its pure harmony to my palate. With a happy smile, I was off to a good start. It took me 15 minutes to make the fudge mixture and about 3 hours to set in the fridge. I indulged myself to a spoonful of the warm chocolate-y mixture before pouring it into the greased and lined pan. Hmm, heaven on earth! :)\r\n\r\nIts not a traditional fudge recipe. Soft on bite with a deep chocolate flavor and what makes it special is the peanut butter frosting. \r\n\r\n\r\nChocolate Fudge with Peanut Butter Frosting Recipe\r\nPrep & Cooking: 15 mts, Setting: 3-4 hrs\r\n Yields: approx 9 squares \r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 tin sweetened condensed milk\r\n\r\n1 1\/2 tbsps butter\r\n\r\n1 1\/2 tbsps creamy peanut butter\r\n\r\n2 1\/4 cups grated chocolate\r\n\r\n\r\n\r\n1 Heat a small pan, add peanut butter and 3 tbsps of condensed milk. Stir to make a smooth creamy mixture on a very low flame. Turn off flame. Allow to cool for a few mts.\r\n2 Melt chocolate in a double boiler. Alternately, heat a stainless steel vessel with about an inch of water, bring to a boil and lower the flame completely. Over the stainless steel vessel, place another vessel (the bottom of this vessel should not touch the water of the stainless steel vessel) such that is rests on the rim of the lower vessel. Place the grated chocolate in the upper vessel. The chocolate will melt due to the steam released from the hot water. Keep stirring till the chocolate melts completely. \r\n3 Turn off the flame, remove the vessel which has the melted chocolate and keep it aside. \r\n4 Take a square baking pan, grease and line with parchment\/butter paper such that the paper is longer than the pan. (Once the fudge is set, its easy to lift out the fudge with the ends of the parchment paper). Pour the creamy peanut butter mixture and spread all over to form a thin layer. Use a flat spatula to spread it out evenly.\r\n5 In another pan, add 1 1\/2 tbsps butter and let it melt on low flame. Add the remaining condensed milk and mix. Add the melted chocolate and keep stirring for appprox 2-3 mts.. Turn off heat.\r\n6 Over this layer, pour the chocolate mixture and allow it to spread all over the pan evenly using a spatula. Let it cool before setting it in the fridge. (I use a large bowl filled with 1 1\/2 cups of cold water to place the baking pan so that it cools down before placing in the fridge to set).\r\n7 Once it cools, cover the baking pan with a plastic wrap and set in fridge for 3-4 hours.\r\n8 After the fudge is set, remove from fridge. Using the ends of the parchment paper, lift it out of the baking pan and place on a plate. Cut into squares and store in an air tight container. It will stay for 3-4 days.\r\n\r\nChocolate Fudge with Peanut Butter Frosting\r\n\r\nNote: You can also do without the peanut butter layer. If you are not using peanut butter, replace the peanut butter with 1 \/2 tbsps of white butter and use the whole tin of sweetened condensed milk to make the chocolate fudge. Instead of 2 1\/4 cups of grated chocolate, use 2 3\/4 cups. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/06\/fudge.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fudge-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fudge-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"cuisine":["western"],"cook-time":"10","prep-time":"5","main-ingredient":["condensed milk","chocolate","peanut butter","butter"],"serves":"8","goes-well-with":["milk"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Indian Milk Recipes","Sweet Dessert Recipes"],"tags":["chocolate","chocolate-fudge","fudge"]}