{"id":11797,"permalink":"http:\/\/www.sailusfood.com\/2011\/10\/27\/cornflakes-chocolate-crispies-easy-chocolate-recipe\/","title":"Cornflakes Chocolate Crispies ","content":"Cornflakes Chocolate Crispies\r\n\r\nChocolate and cornflakes are my son's favorite foods and when I combine them both to prepare an easy peasy chocolate covered cornflake crispies they are bound to disappear on the day of preparation itself. Crisp, decadent without being too sweet. Not at all a complicated recipe and its super quick to bring together. Its the setting which takes a bit of time but worth the wait as the crispies sit in the refrigerator. Golden syrup is essential but if you do not have it on hand, you can substitute it with equal parts of honey and corn syrup. \r\n\r\nPresenting my kid's favorite chocolate recipe for your little ones. Hope your kids enjoy it as much as Nehal did. \r\n\r\n\r\nCornflakes Chocolate Crispies Recipe\r\nPrep & Cooking: 15 mts, Setting: 2-3 hrs\r\n Yields: approx 12 crispies \r\n.\r\n\r\n\r\nIngredients:\r\n\r\n3 cups cornflakes (I used Kellogs Cornflakes)\r\n\r\n1\/2 tbsp golden syrup\r\n\r\n1 tbsp butter\r\n\r\n200 gms grated dark chocolate or milk chocolate (I used Morde brand)\r\n\r\n\r\n\r\n1 Melt chocolate, butter and golden syrup in a double boiler. Alternately, heat a stainless steel vessel with about an inch of water, bring to a boil and lower the flame completely. Over the stainless steel vessel, place another vessel (the bottom of this vessel should not touch the water of the stainless steel vessel) such that is rests on the rim of the lower vessel. Place the grated chocolate, butter and golden syrup in the upper vessel. The chocolate will melt due to the steam released from the hot water. Keep stirring till most of the chocolate melts. \r\n2 Turn off the flame, remove the vessel which has the melted chocolate. Add cornflakes, a few tablespoons at a time and mix it well. Adjust cornflakes quantity based on the chocolate mixture.\r\n3 Take a muffin pan or cupcake liners, add a heaped tbsp of the cornflakes chocolate mixture to the cupcake liners. Allow to cool to room temperature.\r\n4 Once the crispies cool, set in fridge for 2-3 hours.\r\n5 After the chocolate crispies are set, remove from fridge and serve.\r\n\r\nChocolate Covered Cornflakes","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/06\/chocolate-corn-flakes.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-corn-flakes-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-corn-flakes-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"5","prep-time":"5","main-ingredient":["cornflakes","chocolate"],"serves":"6","goes-well-with":["milk"],"author":null,"type":"post","categories":["All Recipes","Eggless Cake &amp; Cookie Recipes","Eggless Dessert Recipes","Sweet Dessert Recipes"],"tags":["chocolate","cornflakes","cornflakes chocolate","cripsies"]}