{"id":11803,"permalink":"http:\/\/www.sailusfood.com\/2011\/06\/29\/indian-chinese-fusion-american-chop-suey-vegetarian\/","title":"Indian Chinese Fusion ~ American Chop Suey (Vegetarian)","content":"American Chop Suey - Vegetarian\r\n\r\nI happen to be blessed with quite a few good chefs\/cooks in my life, who are more than willing to share their culinary knowledge and tips. Most of the Indo Chinese dishes that make their way to this space are attributed to these kind souls. God bless them. Its no secret that I love Indian Chinese fusion cuisine. On many a special occasion its Indian Chinese fusion food for starters and Sweet Corn Chicken Soup is a must. :)\r\n\r\nNehal is extremely fond of American Chop Suey and I created magic at my stove, replicating the restaurant flavor. He loved it and am one happy mommy! Must mention that the fried egg you see in the picture above is not part of the Chop Suey recipe. Nehal loves egg with Chop Suey and I wanted him to feel like he was eating in a restaurant. :)\r\n\r\nAmerican Chop Suey Vegetarian Recipe\r\nPrep & Cooking Time: 45 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n2 onions, each cut into 8 pieces\r\n\r\n1 carrot, cut into thick pieces\r\n\r\n8-10 french beans, cut into 1\" pieces\r\n\r\n1 cup cabbage, cut into big pieces\r\n\r\n4-5 babycorns, cut diagonally into two to three pieces\r\n\r\n2 green bell peppers, cut each into 8 pieces\r\n\r\n1 tsp light soya sauce \r\n\r\n1 1\/2 tsps chilli sauce\r\n\r\n3\/4 tbsp vinegar\r\n\r\n1 1\/2 tbsps tomato sauce\r\n\r\n1 tsp brown sugar\r\n\r\n1 1\/2 tbsps cornflour combined in 1 cup water\r\n\r\nsalt to taste\r\n\r\nblack pepper powder to season\r\n\r\n2 tbsps sesame oil or peanut oil\r\n\r\nFor fried noodles:\r\n\r\n3 cups par-boiled noodles, drained and dried on a kitchen towel, sprinkle a tbsp of cornflour and mix\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 To parboil vegetables, boil a liter of water with 1\/2 tsp salt. Add carrot, cabbage and beans to the boiling water and cook for 2-3 mts. Remove from heat, strain and pour cold water over the vegetables and strain again. Keep aside.\r\n2 Heat oil in a large wok, once the oil is hot, add the onions and saute on high for 2 mts.\r\n3 Add the baby corn and capsicum and saute for 5 mts. Add parboiled vegetables and saute for another 3 mts.\r\n4 Add soy sauce, vinegar, chilli sauce, tomato sauce, black pepper, sugar and salt and mix. Add 2 cups of water and bring to a boil. Reduce flame and cook for 3-4 mts. Add the corn flour along with water and go on stirring continuously till it thickens slightly and coats the vegetables. Remove from heat and keep aside.\r\n5 To prepare fried noodles, heat oil for deep frying in a heavy bottomed vessel. Once hot, reduce flame to medium and place around 1 1\/2 cups of noodles (if the vessel is small, add only one cup) and cook till it turns golden brown. Remove onto absorbent paper and repeat with rest of the noodles.\r\n6 To serve, place the fried noodles on a plate. Ladle the vegetables over the bed of fried noodles and top with a bull's eye (fried egg). Topping with egg is purely optional. Serve warm.\r\n\r\nNote: Alternately, you can bake the noodles till crisp. Maggi or Top Ramen Noodles work best. Grease a baking tray, break the noodles and place on the tray. Bake at 200 C for  10-12 mts till crisp and brown. After 5 mts of baking, mix them well and bake further for 6-7 mts.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/06\/american-chop-suey.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/american-chop-suey-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/american-chop-suey-300x300.jpg","style":["easy","modern"],"course":["main"],"special-diet":["nut free","dairy free","vegetarian","kid friendly"],"cuisine":["indian chinese"],"cook-time":"30","prep-time":"15","main-ingredient":["noodles","carrots","beans","cabbage","beans"],"serves":"4","author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["american-chopsuey","chop-suey","indo-chinese"]}