{"id":1183,"permalink":"http:\/\/www.sailusfood.com\/2008\/08\/25\/tomato-pickle\/","title":"Tomato Pickle","content":"Issues that required my immediate attention and also the planning, preparation and celebration of a themed birthday party for Nehal, who turned 6 a few days ago, had me away from the blogging world and internet. I have a long email list to clear and a couple of queries that need to be answered which hopefully will get done this week. :)\r\n\r\nLast summer we grew a few tomato plants which gave a good yield of tomatoes. This summer we had a good bumper crop from our backyard vegetable garden at our ancestral home in our village. Early March this year, my mother prepared tomato pickle. There have been requests for a tomato pickle recipe (since its summer in US with many a backyard garden growing tomatoes) and I am blogging this recipe today. \r\n\r\nI swear by Amma's recipe for sun-dried tomato pickle. There are two types of tomato pickle she usually prepares, based on availability of fresh tomatoes, time and a good amount of sunshine. The sun dried version is labor intensive but totally worth the effort and time. Having said that, the other version she prepares is an instant tomato pickle that tastes equally good. It's full flavored, well balanced, a little spicy with a superb garlicy tang and not to mention - a beautiful vibrant shade of red! \r\n\r\n&nbsp;Tomato pickle - Ravva dosa with tomato pickle\r\n\r\nThis flavorful, tangy and spicy pickle works good with idlis, dosas and rice. One mouth-watering favorite combination of mine is to combine a tablespoon of tomato pickle in a cup of thick yogurt and serve with hot aloo parathas. Remember to use fresh, ripe and firm tomatoes for this pickle recipe.\r\nGarden fresh tomatoes ready to be pickled\r\nTomato Pickle recipe\r\nRecipe Source & Prep: Amma\r\nPrep & Cooking: 1 hr 15 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 kg tomatoes, wash, dry and slice \r\n\r\nlarge lemon sized tamarind (use if the tomatoes lack tang)\r\n\r\n2 tbsps red chilli pwd (adjust)\r\n\r\n1 tsp methi pwd\r\n\r\n1 1\/2 - 2 tbsps salt (adjust)\r\n\r\n2-3 tbsps oil\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1 tsp mustard seeds\r\n\r\npinch of methi seeds\r\n\r\n15 fresh curry leaves\r\n\r\n3-4 dry red chillis\r\n\r\n15 cloves garlic, slightly crushed\r\n\r\n2 tbsps oil \r\n\r\n\r\n\r\n1 Heat oil in a heavy bottomed vessel, add the sliced tomatoes and cook on high heat for 5 mts. Reduce heat to medium high and continue to cook till the oil separates and the tomatoes turn mushy. \r\n2 Towards the end of the cooking process as the oil seperates, reduce heat and keep stirring till the oil separates completely (the tomatoes could take a good 45 mts to an hour to cook). Turn off heat, add the tamarind and place lid. The tamarind will soften with the heat of the cooked tomatoes. Cool completely.\r\n3 Once cool, add salt and grind the cooked tomatoes along with tamarind to a paste. Remove onto a vessel. Add chilli pwd and methi pwd. Combine.\r\n3 In a pan, add 2 tbsps oil, add mustards seeds, methi seeds and fry till the mustard splutters and the methi turns red. Add the dry red chillis, curry leaves and saute for a few seconds and turn off heat. Add the crushed garlic and leave aside the tempering for 4-5 mts.\r\n4 Once cool, add this tempering along with oil to the tomato paste. Combine well. Cool and store in an airtight bottle. Refrigerate. \r\nNote: Use tamarind only if the tomatoes are sweet without any tang. Usually slightly tangy tomatoes work best for this pickle. \r\nTomato Pickle","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/07\/rava_dosa_tomato-pickle.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava_dosa_tomato-pickle-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava_dosa_tomato-pickle-300x300.jpg","main-ingredient":["tomato"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Pickles","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["pachadi","pickle","tomato"]}