{"id":1190,"permalink":"http:\/\/www.sailusfood.com\/2008\/09\/09\/ayurvedic-food-sprouts\/","title":"Ayurvedic Food - Sprouts","content":"Guest author Claudia Davila writes about different types of sprouts that are beneficial for individual doshas, how to make sprouts and ways in which sprouts could be used to pep up our meals. I like the tip on pureeing the sprouts along with tahini (sesame paste) to make hummus. One of my favorite way to use sprouts is by preparing chaat or bhel. ~ Sailaja\r\n\r\nRaw Food: Sprouts \r\n\r\nMy friend Joanne is an avid sprouter and raw foodist who has always encouraged me to sprout my own grains. Alas, after a few failed attempts I admit I was a bit discouraged from trying again -- but I did and it worked! Sprouting seeds, grains, beans and lentils has fantastic health benefits and helps add live food to our diet, especially during the winter when the only fresh food available is imported from hundreds of miles away. Once sprouted, however, you can eat them raw or cooked. See below for ideas of how to use sprouts!\r\n\r\n1\/4 cup whole mung beans\r\n1\/4 cup whole lentils\r\na jar\r\nthin, porous fabric (like cheesecloth)\r\nrubber band\r\n\r\nPick over the beans and lentils removing blackened or split ones. Wash thoroughly, then soak in a jar filled with water. Soak 8 hours (away from of direct light) or overnight, then wash again, strain, and place back in the jar. Cover the opening with the cloth, held in place with the rubber band, and rest on its side but with the bottom slightly tilted to help drain the excess water. Repeat the cycle of rinsing, draining and resting on a tilt 3 times in the day and overnight again (this keeps the beans moist). The next morning you should have a jar of sprouts! If not, repeat the rinse cycle until sprouted (maybe 1 more day). The sprouts are ready when the tails are about the length of the beans themselves. Rinse and drain once more before storing refrigerated; consume within a few days.\r\n\r\nHOW TO USE THE SPROUTS\r\n~ Toss in salads\r\n~ Use in place of cooked legumes in lentil\/bean salad recipes\r\n~ Add into sandwiches or wraps\r\n~ Puree with tahini, lemon juice, etc, to make a raw hummus\r\n(my favourite way to eat sprouts!)\r\n~ Stir-fry with diced vegetables, garlic and cumin to eat with rice\r\n~ Use in baked goods recipes as you would nuts and seeds\r\n~ Top on soups and stews\r\n\r\n\r\nGet lots more information just Googling \"how to sprout grains\" or check out this Living Foods website. Ayurveda considers sprouted grains, beans and seeds sattvic, the healthiest kind of food. Pictured here in a highly digestible quick saute in ghee with diced carrots, fresh garlic and ginger, and powdered turmeric, coriander and cumin with a pinch of sea salt and dusting of minced parsley.\r\n\r\nSPROUTS FOR INDIVIDUAL DOSHAS\r\nVATAS choose aduki or mung beans, black lentils, and any nuts and seeds; consume with digestive spices like ginger, black pepper, cumin ~NOTE: Vatas benefit most from homogenously prepared foods, as in one-bowl soups or stews or salad meals with plenty of healthy oils, where ingredients are all raw or, better still, all cooked together\r\nPITTAS choose any legumes except black lentils; sprout any raw nuts\/seeds except almonds, pumpkin and sunflowers\r\nKAPHAS sprouting is particularly beneficial for Kaphas; choose any legumes except mung beans, lentils, soybeans and kidney beans (ie. choose almonds, chickpeas, beans like aduki, black, white, navy, pinto, etc); consume with digestive spices like ginger, black pepper, cumin\r\n\r\n~ by Claudia\r\n\r\nPrevious Articles by Claudia Davila\r\nAyurveda and Wellness\r\nGhee - An Ayurvedic healing food\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/08\/sprouts.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sprouts-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sprouts-300x300.jpg","main-ingredient":["sprouts"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Guest Blogger","Indian Vegan Recipes","Indian Vegetarian Recipes","Salad Recipes"],"tags":["Ayurveda","sprouts"]}