{"id":11963,"permalink":"http:\/\/www.sailusfood.com\/2011\/09\/26\/lettuce-salad-with-roasted-bell-peppers\/","title":"Lettuce Salad with Roasted Bell Peppers","content":"\r\n\r\nLettuce salad is a favorite high raw food salad with Mango Lettuce Salad being my all time favorite. I tend to go the raw food way once in a while to detox the body. Detox foods or high raw food help to cleanse the system and its good to rest our system once every few days. Not to mention they also aid weight loss. :)\r\n\r\nI used what I had in the fridge to make myself a light and filling salad. I like the smoky flavor of roasted bell peppers and they make a great addition to today's lettuce salad. Avocado provides the healthy fat and pomegranate is rich is antioxidants. \r\n\r\nIf you are looking to detox your system or lose weight with healthy food then hop over to check out some raw food recipes that I have blogged earlier.\r\n\r\nLettuce Salad \r\n\r\nLettuce Salad Recipe\r\n\r\nRoast one red bell pepper, one green bell pepper and one yellow bell pepper. Cool and peel the charred skin and chop. Place in a large salad bowl. Peel and slice a cucumber, add to the bowl. Peel, cut an avocado into pieces and add to the bowl. Peel, slice a red onion and add to the bowl. Wash, pat dry a head of iceberg lettuce and tear into bite sized pieces and add.\r\n\r\nFor salad dressing, whisk 1 1\/2 tbsps olive oil, 1 tbsp eggless mayo, salt to taste, crushed garlic clove, 1\/2 tsp paprika, 1 tbsp lemon juice and 1 tbsp honey. Pour this dressing over the raw lettuce salad and toss well. Sprinkle a few pomegranate seeds and refrigerate until use. Serve lettuce salad chilled.\r\n\r\nOptional: Finish with a sprinkling of toasted sesame seeds.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/09\/lettuce-salad.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/lettuce-salad-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/lettuce-salad-300x300.jpg","style":["easy","quick","modern"],"course":["meal","salad"],"special-diet":["eggless","nut free","gluten free","dairy free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"5","prep-time":"15","main-ingredient":["lettuce","bell peppers","pomegranate"],"serves":"2","goes-well-with":["juice"],"author":null,"type":"post","categories":["All Recipes","Green Leafy Vegetables","Raw Food Recipes","Recipes Vegetable Dishes","Salad Recipes"]}