{"id":12,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/12\/ayurvedic-recipe-remedy-indigestion\/","title":"Ayurvedic Powder - Remedy for indigestion","content":"Ayurvedic powder for good digestion is easy to make. An Ayurvedic recipe made from ghee (clarified butter) and spices is a simple and effective way to stimulate the digestion and help the body detoxify.\r\n\r\nDigestive Spice Powder Recipe\r\n\r\n2 tsps ghee\r\nbig pinch turmeric pwd\r\n1 tbsp cumin seeds\r\n1 tbsp  coriander seeds\r\n1 tbsp fennel seeds (saunf)\r\n\r\nHeat ghee in a small pan. Add all the above spices except turmeric and fry for 2-3 mts on low-medium heat such that the aromas are released. Remove from heat before the spices burn. Cool and grind to make a fine powder and mix turmeric pwd. Use this spice powder to top cooked vegetables, semi-cooked vegetables and salads. Regular use of this spice powder aids digestion and cleanses our system naturally. \r\n\r\nTurmeric contains the flavanoid Curcumin, which is known to have Anti-inflammatory properties. This wonder spice helps detoxify the liver, balance cholesterol levels, fight allergies, stimulate digestion, boost immunity and enhance the complexion. Cumin and coriander contain oils that are effective in helping to detoxify the liver and aid digestion.\r\n\r\nMade this salad today.\r\n\r\nRaw Papaya Salad\r\n\r\n1 cup raw papaya, pinch of turmeric pwd, 1\/4 cup of coarsely ground peanuts, 1 tbsp fresh grated coconut, 1 tbsp chopped coriander leaves, salt, 1 tsp oil, 1\/2 tsp mustard seeds, 1 tbsp lemon juice, 2 green chillis (slit length wise)\r\n\r\nAdd turmeric and salt to the grated raw papaya. Combine well. Set aside for 15-20 minutes and lightly squeeze the water from the papaya. Add the coarsely powdered peanuts, grated fresh grated coconut and chopped coriander leaves. Combine well.\r\n\r\nHeat 1 tsp of oil in a pan. Add mustard seeds and let them splutter. Add green chillis and remove from heat. Add this to the papaya salad with lemon juice and combine. Adjust salt. (Optionally you can use powdered chick pea powder instead of peanuts)","style":["traditional"],"course":["meal"],"special-diet":["nut free","eggless","vegetarian","vegan","dairy free","healthy"],"cuisine":["indian"],"cook-time":"3","prep-time":"10","main-ingredient":["papaya"],"serves":"3","goes-well-with":["buttermilk","juice"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Vegetarian Recipes","Podi Recipes","Salad Recipes"],"tags":["Ayurveda","papaya","salad"]}