{"id":12017,"permalink":"http:\/\/www.sailusfood.com\/2011\/09\/18\/vankaya-nuvvula-masala-brinjals-in-sesame-sauce\/","title":"Vankaya Nuvvula Masala ~ Brinjals in Sesame Sauce","content":"Andhra cuisine has a vast array of brinjal recipes. Today's Vankaya Nuvvula Masala or brinjal curry is a classic Andhra vegetarian recipe that is prepared on special occasions and can be considered for a party vegetarian menu. Quite a few Andhra vantalu (dishes) call for the use of sesame seeds be it a spiced Nuvvula Podi or a calcium rich Indian sweet like Nuvvula Unda (sweet sesame balls) or a curry like brinjals in sesame sauce. Sesame seeds lend a nutty flavor and body to the dish.\r\n\r\nVankaya Nuvvula Masala - Brinjals in Sesame Seeds\r\n\r\nI receive quite a few requests for Andhra Vegetarian recipes and vegan recipes. Hopefully I should be able to post more such recipes for the benefit of my readers. Brinjal curry in sesame seeds sauce is a vegan dish that goes well with rice or rotis.\r\n\r\nVankaya Nuvvula Masala Recipe\r\nPrep & Cooking: 50-60 mts\r\nServes: 4-5\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg purple brinjals, wash, make + quarters with stalk intact\r\n\r\n1 1\/2 - 2 tbsps oil\r\n\r\n1 large onion, sliced\r\n\r\n3-4 green chilies\r\n\r\n1 tbsp khus khus\/gasagasalu\/white poppy seeds, dry roast for 3 mts\r\n\r\n2 tbsps nuvvulu\/til\/white sesame seeds, dry roast\r\n\r\n1\/2 tsp cumin seeds\r\n\r\nfew fresh curry leaves\r\n\r\n1 tsp ginger garlic paste\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/4-1\/2 tsp red chilli pwd\r\n\r\n1 tsp coriander pwd\r\n\r\n1\/4 tsp cumin pwd\r\n\r\npinch of roasted methi\/fenugreek\/menthi pwd (optional)\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Place the brinjal with + quarters and stalks intact in salted water and keep aside for 10 mts.\r\n2 Add 1\/2 tbsp of oil in a cooking vessel, add the brinjals and roast them till brown, approx 7-8 mts. Remove and keep aside.\r\n3  In the same vessel, add the green chilies and sliced onions and saute for 4 mts on low to medium flame. Remove and cool.\r\n4  Grind the onions and green chilies to a fine paste. Remove.\r\n5  Grind the lightly roasted khus khus and sesame seeds to a fine paste, adding 2 tbsps water. Remove.\r\n6  Add the remaining oil in the vessel, add cumin seeds and as they splutter add the curry leaves and onion paste. Saute for 3 mts. Add ginger garlic paste and saute for another 3 mts.\r\n7  Add the khus khus paste and cook for 3 mts. Add turmeric pwd, red chili powder, coriander powder, methi powder, cumin powder and salt. Mix. Add 2 cups water and bring to a boil.\r\n8  Reduce flame, add the roasted brinjals and allow to simmer for 8-10 mts and the curry thickens. Adjust salt. Turn off heat\r\n9  Serve Vankaya Nuvvulu Masala or brinjal curry with flavored rice or rice or roti.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/07\/vankaya-nuvvula-kura.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vankaya-nuvvula-kura-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vankaya-nuvvula-kura-300x300.jpg","style":["easy","modern","quick"],"course":["main"],"special-diet":["eggless","dairy free","gluten free","vegetarian","vegan","kid friendly"],"cuisine":["andhra"],"cook-time":"40","prep-time":"20","main-ingredient":["brinjals","sesame seeds"],"serves":"5","goes-well-with":["rice","pulao"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["brinjal","brinjal-curry","vankaya","vankaya-masala","vegan"]}