{"id":1224,"permalink":"http:\/\/www.sailusfood.com\/2008\/08\/29\/chicken-curry\/","title":"Chicken Curry","content":"\r\n\r\nMany a time, infact very often, I cook a dish (especially chicken) with the available ingredients at home and no particular recipe in mind. Trusting my instincts, take the risk and play with the ingredients (I'm sure like me there are quite a few of you who do that with your cooking more often than not. Isn't it?!-:) Sometimes I receive compliments and on a number of occasions its just smiles (good souls who don't have the heart to say anything negative). :)\r\n\r\nYesterday, I followed my instincts and prepared a chicken curry, mildly flavored with a slight hint of mint. I used poppy seed paste to give some body and garam masala and fennel seed powder to balances the flavors. Quick to make and makes a decent curry with rotis and rice and even coconut rice. Satish liked the flavor and so did I.\r\n\r\nChicken Curry Recipe\r\nRecipe source: My own\r\nPrep & Cooking: 30 mts\r\nServes 5 persons\r\nCuisine: Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg chicken, washed and cut into medium sized pieces\r\n\r\n1\/2 cup yogurt\r\n\r\njuice of 1\/4 lemon\r\n\r\n1\/4 tsp turmeric\r\n\r\n1 tsp chilli pwd\r\n\r\n1 tbsp coriander powder\r\n\r\n1 tsp fennel pwd (saunf)\r\n\r\n1 tbsp poppy seed paste\r\n\r\n1 onion, coarsely crushed\r\n\r\ngaram masala pwd (1\" dalchini and 4 cloves finely ground)\r\n\r\nfresh coriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsps oil\r\n\r\nMake a paste:\r\n\r\n4-5 green chillis (adjust to suit your spice level)\r\n\r\n1 1\/2\" ginger\r\n\r\n4-5 cloves garlic\r\n\r\n5-6 mint leaves\r\n\r\n1 tbsp fresh coriander leaves\r\n\r\n\r\n\r\n1 Marinate the chicken in yogurt, coriander pwd, turmeric pwd, lemon juice and ground paste for 10 mts. \r\n2 Heat oil in a cooking vessel, add the crushed onions and fry till transparent.\r\n 3 Add the marinated chicken and cook on high heat for 4-5 mts, combining the ingredients once in a while. \r\n4 Reduce to medium heat, add the salt and poppy seed paste and combine well. Let the chicken cook in this paste for 8-10 mts, uncovered. Cook till oil separates. Add one cup water (add more water if you want more gravy) and combine. \r\n5 Finally add the fennel pwd and garam masala pwd, combine well and remove the contents to a pressure cooker. Pressure cook the chicken for 3-4 mts or upto one whistle. Turn off heat and garnish with fresh coriander leaves.\r\n6 Serve hot with white steamed rice, coconut rice or rotis.\r\nChicken curry garnished with coriander leaves","main-ingredient":["chicken"],"author":null,"type":"post","categories":["All Recipes","Indian Chicken Recipes","Indian Curry Recipes","Indian Non-Vegetarian Recipes"],"tags":["chicken","curry"]}