{"id":1228,"permalink":"http:\/\/www.sailusfood.com\/2008\/09\/08\/beans-vepudu-french-beans-stir-fry\/","title":"Beans Vepudu - French beans stir fry","content":"Beans Vepudu\r\n\r\nThe past few days were like hot summer. It drizzled this morning with the temperature cooling down quite a bit. I was sitting by the bedroom window after Nehal left for school, sipping hot ginger flavored tea, watching the flowers sway to the drizzle and listening to Bhim Sen Joshi's classical music. Beautiful and rejuvenating! I sat there not wanting to move for a good half hour doing nothing but watch the drizzle. But trust the telephone not to ring and its back to the daily grind. :)\r\n\r\nOn the kitchen front, its all about french beans and not hot pakodas or roasted corn cob (those monsoon food cravings!) French beans in my kitchen are used for Chinese cooking or an occasional vegetable pulao or upma. Though I like to cook beans in combination with potatoes or carrots for added flavor, today I decided on a beans stir fry with roasted ground nut powder.\r\n\r\nFrench Beans\r\n\r\n\r\n French Beans Vepudu Recipe\r\nPrep & Cooking: 25 mts\r\nServes 4 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/4 kg french beans, stringed and chop into small pieces (par boil with salt and turmeric for 4-5 mts)\r\n\r\n1 onion finely chopped\r\n\r\nbig pinch methi pwd (optional)\r\n\r\n1 - 1 1\/2 tbsps roasted groundnut pwd\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/4 tsp cumin seeds\r\n\r\n1\/2 tsp split gram dal\r\n\r\n2-3 dry red chillis, de-seed and tear\r\n\r\n10-12 curry leaves\r\n\r\n\r\n\r\n1 Heat oil in a cooking vessel, add mustards seeds and let them pop. Add the cumin seeds and split gram dal and once they turn slightly red, add fresh curry leaves, dry chillis and chopped onions and saute on medium heat for 5 mts or till the onions turn transparent. \r\n2 Add the methi pwd and combine.\r\n3 Add the par-boiled broad beans and combine. Sprinkle a 1-2 tbsps of water and place lid. Simmer for about 8-10 mts.\r\n4 Adjust salt and stir fry the beans without lid on high flame for 3 mts, add the ground nut pwd and combine well. Turn off heat and serve with rice. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/09\/french-beans.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/french-beans-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/french-beans-300x300.jpg","main-ingredient":["french beans"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["french_beans"]}