{"id":1239,"permalink":"http:\/\/www.sailusfood.com\/2008\/09\/15\/kakara-kaya-vepudu-bitter-gourd-stir-fry\/","title":"Kakara Kaya Vepudu - Bitter Gourd Stir fry","content":"Usri Kaya pachadi, kakara kaya vepudu, pappu anapakaya with white rice\r\n\r\nAs a child, just hearing the word 'Kakarakaya' aka 'bittergourd' from my mother would keep me away from the day's meal. It was only as a young teenager that I began to start liking it ever since I tasted a bittergourd stir fry with toasted cashewnuts at a cousin's wedding. I would never have tasted it had I known it was bittergourd. It didn't look like bittergourd that I disliked but with pleasing looks, an appetite-pleasing vegetable stir fry, cashewnuts and all. When told it was kakarakaya vepudu, with disbelief writ on my face, I asked for a second helping. My love for this knobbly, bitter-tasting vegetable grew leaps and bounds since then. \r\n\r\nSometimes we're hesistant to give vegetables that we are resistant to, a second chance to prove themselves. Bittergourd haters, maybe you should give bittergourd a second try, you'll be sold forever. :) And those with diabetes should definitely give bittergourd high priority in their daily meals.\r\n\r\nBittergourd, Kakarakaya, Karela\r\n\r\nThe following is a favorite in our home, a nicely roasted stir fry with a tangy sweet flavor.\r\n\r\nKakarakaya Vepudu Recipe\r\nPrep & Cooking: 40 mts\r\nServes: 3-4 \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg bitter gourd, peel, slice into rounds\r\n\r\nbig pinch turmeric pwd\r\n\r\n1 1\/2 tbsp tamarind paste (adjust)\r\n\r\n2 medium onions, finely sliced\r\n\r\n1-2 tsps jaggery pwd\r\n\r\n1 1\/2 tbsps oil\r\n\r\nsalt to taste\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\npinch of asafoetida\/hing\/inguva\r\n\r\n10-12 curry leaves\r\n\r\nDry roast and make a fine powder:\r\n\r\n1 tsp coriander seeds\r\n\r\n1\/2 tsp fennel seeds\r\n\r\n2 dry red chillies\r\n\r\npinch of fenugreek seeds\/methi\r\n\r\n\r\n\r\n1 Add two cups of water, tamarind paste, turmeric and salt to the peeled bittergourd rounds. Cook for 15 mts or till the bitter gourds are three-fourth cooked. Drain any left over water and keep aside the cooked bitter gourd pieces.\r\n2 Heat oil in a pan, add the mustard seeds and let them pop. Add the curry leaves and asafoetida and stir fry for a few seconds. Add the sliced onions and fry for 6-7 mts till they turn brown.\r\n3 Add the ground spice pwd and jaggery and combine well.\r\n4 Add the cooked bitter gourds and stir fry. Constantly stir fry on medium heat ensuring they don't burn or stick to the pan. Keep frying till they well roasted and this could take about 15-18 mts.\r\n5 Adust salt and serve hot with rice. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/09\/kakarakaya_bitter_gourd.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kakarakaya_bitter_gourd-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kakarakaya_bitter_gourd-300x300.jpg","main-ingredient":["bittergourd"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["bittergourd","kakarakaya"]}