{"id":1241,"permalink":"http:\/\/www.sailusfood.com\/2008\/09\/10\/sesame-noodles-vegetables-and-paneer-in-sweet-and-sour-sauce\/","title":"Sesame Noodles & Vegetables and Paneer in sweet and sour sauce","content":"\r\nSunday was an Indo-Chinese inspired meal. Loaded with fresh produce from the rythu bazaar (farmer's market), I was tempted to use as many vegetables as possible for the day's meal. Indo Chinese it was! Vegetable noodles tossed in toasted sesame seeds and to accompany it was, vegetables and paneer cubes cooked in a sweet and sour sauce. \r\nSesame Noodles\r\n\r\n\r\nAn easy noodle recipe that can be customized in numerous ways with available vegetables on hand or in-season. I like to toss these noodles in a good dose of calcium rich toasted sesame seeds and it can get addictive.:) \r\n\r\n&nbsp;Julienned and chopped vegetable and Sesame noodles\r\n\r\nSesame Noodles Recipe\r\nPrep & Cooking Time: 30 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1 packet egg noodles (boiled, drained in cold water and tossed in 1-2 tsps oil)\r\n\r\n1\/4 cup spring onions, finely chopped\r\n\r\n2 cups julienned vegetables (carrots, beans, cabbage and capsicum)\r\n\r\n1 tsp soya sauce\r\n\r\n1 tsp grated ginger\r\n\r\n2-3 tsps vinegar\r\n\r\n1\/2 tsp brown sugar (optional)\r\n\r\npepper pwd as required\r\n\r\nsalt as required\r\n\r\n1 1\/2 tbsps sesame oil or peanut oil\r\n\r\n1 tbsp toasted sesame seeds\r\n\r\n1 tbsp chopped spring onion greens, finely chopped\r\n\r\n\r\n\r\n1 Heat a wok with sesame oil till piping hot, add the spring onions and ginger and stir fry for 1 mt on high.\r\n2 Add the rest of the vegetables and toss them on high heat for 4 mts.\r\n3 Add salt, pepper pwd, soya sauce and brown sugar and combine. Add the drained noodles and combine well. \r\n4 Add vinegar and toasted sesame seeds and toss the noodles and vegetables on high heat for a few seconds. Turn off heat. Garnish with chopped spring onion greens and serve hot with vegetables and paneer in sweet and sour sauce.\r\nVegetables and paneer in sweet and sour sauce\r\n\r\n\r\nThe tender paneer paired beautifully with the assorted vegetables cooked in sweet and sour sauce. For a non-veg version, replace paneer with cooked chicken or fish pieces. Just ensure the vegetables retain their crunch and refrain from overcooking them.\r\n&nbsp;Chopped vegetables and vegetables and paneer in sweet and sour sauce\r\n\r\nVegetables & Paneer in sweet and sour sauce Recipe\r\nPrep & Cooking Time: 40 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups vegetables (tomatoes, onions, baby corn, capsicum, beans, carrot, cabbage), chopped into bite sized pieces\r\n\r\n1\/2 cup paneer cubes, saute in a tsp of oil for 3 mts\r\n\r\n1-2 finely chopped green chilli\r\n\r\n1 tsp grated ginger\r\n\r\n1 1\/2 tsps light soya sauce \r\n\r\n1 tbsp vinegar\r\n\r\n1 tbsp brown sugar\r\n\r\n1 tbsp tomato ketchup\r\n\r\n2 tbsps tomato puree\r\n\r\n1 tbsp cornflour\r\n\r\n1 1\/4 cups water\r\n\r\nsalt to taste\r\n\r\n1 1\/4 tbsps sesame oil or peanut oil\r\n\r\n2 tbsps finely chopped spring onion stalks\r\n\r\n\r\n\r\n1 Heat oil in a large wok and once the oil is piping hot, add the green chillis and grated ginger and stir fry on high for a few seconds.\r\n2 Add the chopped vegetables (except tomatoes) and stir fry on high for 4-5 mts, constantly tossing them.\r\n3 Reduce to medium heat and add the brown sugar, soya sauce, tomato ketchup, tomato puree and vinegar. Combine well and cook for 2 mts.\r\n4 Add the tomato quarters and sauteed paneer cubes and stir fry till the spices coat the vegetables and paneer well, for two mts. Keep stirring constantly lest it burns.\r\n5 Add water and salt and cook on high till the water reduces to half its quantity. Combine a little water to the cornflour such that there are no lumps and slowly add to vegetables, stirring constantly.\r\n6 Keep stirring till the sauce thickens and turn off heat. Garnish with spring onion greens and serve hot with noodles or fried rice.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/09\/sesame_noodles1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sesame_noodles1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sesame_noodles1-300x300.jpg","main-ingredient":["noodles"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Recipes Vegetable Dishes"],"tags":["indo-Chinese_recipes"]}