{"id":12458,"permalink":"http:\/\/www.sailusfood.com\/2011\/09\/28\/navratri-recipe-special-sweet-pongal\/","title":"Navratri Special ~ Sweet Pongali","content":"The festive season has begun in India. Navratri is here and its time for some special festival sweets. The first day of Navaratri has Sweet Pongal as an offering to Goddess Durga.\r\n\r\nSweet Pongal is the easiest to make of all the festival recipes. Creamy, infused with cardamom, garnished with roasted raisins and cashew nuts, this delicious jaggery based pudding comforts and warms the soul. You can use sugar instead of jaggery but the flavor of sweet pongal is best when sweetened with iron rich jaggery.\r\n\r\nNavratri Recipe ~ Sweet Pongali\r\n\r\nSweet Pongal Recipe\r\nCooking Time: 50 mts\r\nCuisine: Andhra\r\nServes 6-7 persons\r\n. \r\n\r\nIngredients:\r\n\r\n1 cup raw rice washed and drained\r\n\r\n1\/2 cup yellow moong dal\/pesara pappu\r\n\r\n1 1\/2 cup grated jaggery\r\n\r\n4 1\/2 cups water\r\n\r\n1\/4 tsp salt\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n3 tbsps ghee\r\n\r\n12-15 cashewnuts \r\n\r\n2 tbsps raisins\/kishmish\r\n\r\n1 Heat a pan, add 1\/2 tbsp of ghee and toast the cashewnuts and raisins till golden brown. Remove from pan, keep aside. In the same pan, add the moong dal and roast till its lightly red. Remove.\r\n2 Heat a vessel, add grated jaggery. Let the jaggery melt over slow flame till its sticky on touch. Don't over cook it, it should basically completely melt. Strain the jaggery and cool.\r\n3 In a separate vessel, bring water to a boil. Lower heat, add the rice and washed moong dal to the water. Cook till the rice is soft and the mixture turns thick. \r\n4 Reduce flame to low, add the jaggery syrup to the cooked rice and dal mixture and mix. Add the cardamom pwd, salt and toasted cashews and raisins. Let it cook for 2-3 mts and turn off flame. \r\n5Serve warm or bring to room temperature and refrigerate until chilled. It tastes good both warm and chilled. \r\n\r\nKitchen Tips - Add the jaggery syrup only after the rice is completely cooked. Ensure the flame is very low when adding the jaggery syrup. You can substitute jaggery with granulated sugar. Optional - Toast finely chopped fresh coconut in little ghee and add along with cashew nuts and raisins.\r\n\r\nNavarati Special - Sweet Pongal","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/09\/sweet-pongal.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sweet-pongal-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sweet-pongal-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","gluten free","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"40","prep-time":"5","main-ingredient":["rice","moong dal","jaggery"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Sweets Recipes","Navratri Recipes","Sweet Dessert Recipes"],"tags":["festivals","navarati special","navratri recipes","sweet pongal","sweet pongali"]}