{"id":12486,"permalink":"http:\/\/www.sailusfood.com\/2011\/09\/29\/navratri-special-vada\/","title":"Navratri Special ~ Vada","content":"Vadas - light and fluffy on the inside with a crisp exterior, packed with flavor, make for a perfect offering to Goddess Durga. This Navratri special Vada recipe is basically a classic South Indian breakfast fare served with sambar and chutney.\r\n\r\nMake sure the Vadas are cooked to crispy perfection till a beautiful golden shade is achieved and always serve them warm. Its the crisp exterior that makes the Vadas unique and delightful to savor with hot sambar.\r\n\r\nVada\r\n\r\nDon't skimp on the pepper corns because there's something irresistibly delightful about the role they play in these savory Vadas. You will love the pepper-y flavor in each bite of the crispy Vada. \r\n\r\nNavratri festival special ~ Vadai\r\n\r\nVada Recipe\r\nPrep & Cooking: 20 mts, Soaking time: 1 1\/2 hrs\r\nMakes: 10-12 vadas\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup whole urad dal\/skinned whole black gram dal\/minappappu\r\n\r\n10-12 black pepper corns, lightly crushed\r\n\r\n1\/2 tsp cumin seeds, lightly crushed\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Soak whole black gram dal in water for 1 1\/2 to 2 hours.\r\n2 Strain the water, and grind the dal to a paste sprinkling very little water. Use small portions of dal to grind batch wise as its easier to grind into a soft paste. Add salt, crushed cumin seeds and pepper corns and beat till fluffy.\r\n3 Heat oil for deep frying in a heavy bottomed vessel and heat till piping hot. Reduce flame to medium.\r\n4 Wet your hands with water, take a lemon-sized ball of batter and flatten it into a vada on a greased sheet or banana leaf. Make a hole in the centre of the vada so that it cooks evenly all over.\r\n5 Slowly drop the vada into the hot oil and fry it on both sides on medium flame to a golden brown color. Deep fry 4-5 vadas per batch depending on the size of the vessel. \r\n6 Remove the vadas onto a serving plate. Serve warm while the crust is still crisp and serve warm with chutney and sambar. \r\n\r\nKitchen Tips: If urad dal or whole skinned black gram dal is soaked for over 8 hours, the vadas absorb less oil and are tastier than the vadas prepared from dal which is soaked for only 2 hours\r\n\r\nUrad Dal Vada ~ Garelu","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/09\/how-to-make-vada.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-vada-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-vada-300x300.jpg","style":["easy","traditional"],"course":["breakfast","snack"],"special-diet":["eggless","dairy free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"20","prep-time":"10","main-ingredient":["black gram dal"],"serves":"4","goes-well-with":["sambar","chutney"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Breakfast Recipes","Indian Dal Recipes","Indian Festivals","Indian Lentil Recipes","Navratri Recipes","South Indian Recipes"],"tags":["navratri","vada-recipe","vadai"]}