{"id":12514,"permalink":"http:\/\/www.sailusfood.com\/2011\/09\/30\/curd-rice-recipe-daddojanam-yogurt-rice\/","title":"Navratri Special ~ Daddojanam - Yogurt Rice","content":"Curd Rice is a comforting South Indian rice recipe that makes for a filling complete meal with pickle. During Navratri, Daddojanam (the name Yogurt rice goes by in Andhra) is prepared as a festival food and offered to Goddess Durga. \r\n\r\nThe key to a tasty curd rice lies in mashing the cooked rice lightly, fresh yogurt and the use of asafoetida in the tempering. Fresh curry leaves, coriander leaves (cilantro) and pomegranate seeds not only bring color to the Yogurt rice but also alleviate the flavor profile of this humble rice dish.\r\n\r\nNot much of a recipe really. Even a 10 year old can whip it up in a five minutes provided there is cooked rice on hand\r\n\r\nCurd Rice ~ Daddojanam\r\n\r\nCurd Rice Recipe\r\nPrep & Cooking Time: 25 mts\r\nCuisine: Andhra\r\nServes 4 persons\r\n. \r\n\r\nIngredients:\r\n\r\n1 cup raw rice, washed, cooked till soft and lightly mashed \r\n\r\n3 cups fresh curd\/yogurt\r\n\r\n2 green chillies, slit length wise\r\n\r\n1\" ginger piece, finely chopped\r\n\r\nchopped coriander for garnish \r\n\r\nfew pomegranate seeds for garnish (optional)\r\n\r\nTempering\/Poppu\/Tadka:\r\n\r\n2 tsps oil\r\n\r\n1\/2 tsp mustard\r\n\r\n1\/2 tsp black gram dal\/minapa pappu (optional)\r\n\r\n1 dry red chili, tear\r\n\r\n8-10 curry leaves\r\n\r\n1\/4 tsp asafoetida\/inguva\/hing\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Mix the yogurt and salt with the cooled cooked rice. Mix well. \r\n2 Add chopped ginger and green chilies. Mix with the curd rice.\r\n3 Heat oil in a pan, add mustard seeds and let them splutter. Add the black gram dal, red chilies and curry leaves. Allow the dal to turn lightly red, approx a mt. Add asafoetida and turn off heat and immediately add to the curd rice. Stir the tempering into the rice and mix. Adjust salt if required. If the curd rice consistency is too thick, add a few tbsps of water or boiled milk and mix.\r\n4 Garnish with coriander leaves and pomegranate seeds. Serve chilled or at room temperature with pickle or papad.\r\n\r\nKitchen Tips: If you have prepared the curd rice well in advance, add 1\/4 cup milk to the curd rice 10 minutes before serving as milk removes any sourness of the curd. If you eat the curd rice immediately on preparation then there is no need to add milk. You can garnish with finely chopped onions or fruits of your choice like pomegrante or grapes.\r\n \r\nYogurt Rice","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/09\/yogurt-rice.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/yogurt-rice-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/yogurt-rice-300x300.jpg","style":["easy","quick","traditional"],"course":["meal"],"special-diet":["eggless","dairy","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"20","prep-time":"5","main-ingredient":["rice","yogurt"],"serves":"4","goes-well-with":["pickle","papad"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Festival Foods","Indian Festivals","Indian Rice recipes","Navratri Recipes","South Indian Recipes"],"tags":["curd","curd-rice","dadojanam","rice"]}