{"id":1258,"permalink":"http:\/\/www.sailusfood.com\/2008\/09\/16\/kanda-vadalu-yam-vada-suran-kebabs\/","title":"Kanda Vadalu - Yam Vada","content":"Kanda aka Suran Vadas\r\n\r\nLike bittergourd, I disliked yam aka 'suran' (kanda in Telugu) as a child. It was a chance encounter with this vegetable in the form of kebabs, from a friend's tiffin dabba, that I had to re-think my opinion of suran. One bite into the kebab and I was sold. At first I thought it was raw banana vada but was told they were kebabs made with boiled suran. \r\n\r\nAs monsoon calls for deep-fried comfort food, it was Kanda Vadas on a rainy weekend. Simple recipe and the vadas taste best when eaten hot off the stove. Just ensure you clean raw kanda with several changes of water before boiling it till soft.\r\n\r\nElephant foot yam, Kanda, Suran\r\nKanda Vada Recipe\r\nPrep & Cooking: 40 mts\r\nMakes 25-30 vadas \r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n3 cups of peeled and boiled yam\/kanda\/suran cubes\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\nsmall lemon sized tamarind \r\n\r\n1 1\/2 tsps ginger garlic paste\r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/2 tsp garam masala pwd\r\n\r\n2 tbsps cornflour\r\n\r\n1 tbsp dessicated coconut pwd\r\n\r\n3-4 bread slices (remove sides) (adjust)\r\n\r\n1 1\/2 tbsps putnala pappu\/roasted chick pea\/dalia pwd\r\n\r\n2 tbsps fresh coriander leaves\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Boil kanda along with turmeric pwd, salt and small lemon sized tamarind till cooked and soft. Drain any left over water and cool. Grate or mash kanda cubes and combine with rest of the ingredients (except oil) and shape into oblong shaped pattis or into any shape of your choice. Adjust bread slices to suit patti consistency. Refrigerate for 15-20 mts. \r\n2 Heat oil for deep frying in a heavy bottomed vessel and once oil is piping hot, reduce to medium flame. You can place 6-8 kebabs based on the size of the vessel and fry till golden brown. Once golden brown, drain and place on absorbent paper.\r\n3 Serve hot with tomato sauce or date and tamarind chutney.\r\n\r\nNote: Take some precautions while handling yam. Apply oil to hands, peel and cut. Wash in several changes of water before pressure cooking till soft. Yam takes a while longer than most vegetables to cook.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/09\/kanda_vadalu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kanda_vadalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kanda_vadalu-300x300.jpg","main-ingredient":["yam"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"],"tags":["elephant-food","kanda","suran"]}