{"id":12588,"permalink":"http:\/\/www.sailusfood.com\/2011\/10\/03\/kesari-recipe-rava-kesari-halwa\/","title":"Navratri Special ~ Rava Kesari - Semolina Pudding","content":"Rava Kesari - moist, melt in the mouth Indian semolina dessert that is prepared as a festival special for occasions like Navratri. Not too complicated, just a few ingredients like semolina, clarified butter, sugar and cardamom mingle together to bring out something magical and exotic.\r\n\r\nThe key to a delicious Kesari is to slow roast semolina in ghee aka clarified butter till light pink without burning it. And when infused with a warming aromatic spice like cardamom the flavor of Rava Kesari is alleviated by leaps and bounds. Delightful when adorned with roasted cashews and raisins.\r\n\r\nKesari ~ Navratri Special\r\n\r\nKesari Recipe\r\nPrep & Cooking: 20-22 mts\r\nServes: 7-8 persons\r\nCuisine: Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup sooji\/semolina\/upma rava\r\n\r\n1 1\/2 cups sugar (adjust to suit your taste)\r\n\r\n2 1\/2 cups water\r\n\r\n5-6 saffron strands, soaked in a tbsp of milk\r\n\r\n4 tbsps melted ghee\/clarified butter\/neyyi\r\n\r\n12-15 cashew nuts\/kaju\/jeedi pappu\r\n\r\n15-20 raisins\/khis mish\r\n\r\n3\/4 tsp cardamom powder\r\n\r\n\r\n\r\n1 Heat a heavy-bottomed vessel, add 2 tbsps of melted ghee, add cashew nuts and raisins and toast them till golden brown. Remove them and keep aside.\r\n2 In the same ghee, add sooji\/semolina and fry till light pink approx for 6 mts. You have to constantly stir it or else it will burn. Turn off heat, add sugar and mix.\r\n3 Add water and cook on slow flame stirring constantly. It will come together like a thick pudding. It will take approx 8-10 mts to cook on slow flame.\r\n4 Add saffron and half of the roasted nuts and raisins and mix. Cook on low flame for another mt. Add 2 tbsps of warm ghee and mix. Turn off flame, remove onto a serving bowl.\r\n5 Garnish with the remaining nuts and raisins and serve warm. \r\n\r\nKitchen Tips: For a rich flavor, add 1\/2 cup milk and 2 cups water. Saffron can be substituted with Kesar color by adding a pinch of it to a tbsp of water.\r\n\r\nRava Kesari \r\n\r\nP.S With power cuts abound in Andhra Pradesh and erratic internet connection, I could not blog yesterday's offering to Goddess Durga.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/10\/kesari-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kesari-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kesari-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"20","prep-time":"3","main-ingredient":["semolina","sugar"],"serves":"6","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Navratri Recipes","Sweet Dessert Recipes"],"tags":["kesari","rava kesari","suji ka halwa"]}