{"id":12618,"permalink":"http:\/\/www.sailusfood.com\/2011\/10\/04\/navratri-special-chitti-budagalu-recipe\/","title":"Navratri Special ~ Chitti Budagalu - Savory Crackers","content":"Savory snack enthusiasts will love today's Navrati Special offering to Durga Ma. Addictively satisfying, Chitti Budagalu are adorable, tiny puffed up crisps with a hint of spice. Only 3 ingredients go into its making - urad dal aka black gram dal, rice flour and chili powder. \r\n\r\nIt does take some time to prepare but its worth the effort. Serve these crispy treats with a cup of chai and you will have your family and guests asking for seconds and thirds. :)\r\n\r\nChitti Budagalu ~ Crispy Snack\r\n\r\nChitti Budagalu Recipe\r\nPrep & Cooking: 40-45 mts, Soaking time: 2 hrs\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 cup whole urad dal\/skinned whole black gram dal\/minappappu\r\n\r\n2 cups rice flour\/biyyam pindi\r\n\r\n1 tsp red chili powder\r\n\r\n1\/2 tsp ajwain\/vaamu\/carom seeds (optional)\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Soak whole black gram dal in water for 2 hours.\r\n2 Strain the water and grind the dal to a paste sprinkling very little water. Remove from the grinder.\r\n3 To the ground urad dal, add rice flour, salt and chili powder, mix well. Add little water to make a smooth dough.\r\n4 Heat oil for deep frying in a heavy bottomed vessel and heat till piping hot. Reduce flame to medium.\r\n5 Make very small balls from the dough. Grease two sheets or 2 small banana leaves. Place a small ball in between two greased sheets (place a small ball on the greased sheet and place the greased side down of the other sheet over the ball). \r\n6Lightly flatten the ball using a flat spatula or tumbler. Remove the flattened dough and place on a plate. Prepare with rest of the dough and keep aside\r\n7 Slowly drop the flattened rounds into the hot oil and cook them on medium flame. They will puff up on touching the hot oil. Fry the chitti budagalu on both sides to a golden brown color. Deep fry 8-10 budagalu per batch depending on the size of the vessel. \r\n8 Remove the chitti budagalu onto a serving plate. Bring to room temperature and store in an air tight container. Stays fresh upto 3-4 days.\r\n\r\nKitchen Tips: You can add ajwain or carom seeds for flavor. Its optional though.\r\n\r\nNavratri Special ~ Chitti Budagalu","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/10\/chitti-budagalu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chitti-budagalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chitti-budagalu-300x300.jpg","style":["easy","traditional"],"course":["snack"],"special-diet":["eggless","dairy free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"20","prep-time":"20","main-ingredient":["urad dal","rice flour"],"serves":"15","goes-well-with":["tea","coffee"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Flour Recipes","Indian Dal Recipes","Indian Festivals","Indian Snacks and Starter Recipes","Navratri Recipes"],"tags":["chitti-budagalu","dasara","navaratri"]}