{"id":12693,"permalink":"http:\/\/www.sailusfood.com\/2011\/10\/09\/recipes-of-chips-taro-root-arbi-recipe\/","title":"Chamadumpa Chips ~ Taro Root (Arbi) Chips","content":"Are you familiar with this exotic underground stem? Goes by the name Taro root, Elephant Ears, Colocasia, Arbi in Hindi and Chamadumpa in Telugu. You will find it at across all the Rythu Bazaars (farmer's market) in Andhra. \r\n\r\nIts the sliminess and slippery feel of taro root which keeps away many from relishing its flavor. Please don't let that put you away from trying it. It is full of fiber, lot of starch and has a delicious creamy texture.\r\n\r\nTaro Root Chips\r\n\r\nToday's recipe for chips is a deep fried version. You can even shallow fry the taro root slices which would yield a less crisp exterior but tasty nevertheless. I'm yet to try baking them. Do try this Arbi recipe you wouldn't want to miss.\r\n\r\nTaro Root-Colocasia-Arbi-Chamadumpa\r\n\r\n\r\nTaro Root Chips Recipe\r\nPrep & Cooking: 45-50 mts\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/4 kg taro root\/arbi\/chamadumpa\r\n\r\noil for deep-frying\r\n\r\nsalt to taste\r\n\r\nchilli pwd to taste \r\n\r\n1\/2 tsp coriander powder\r\n\r\npinch of cumin powder\r\n\r\n\r\n\r\n1 Boil taro roots with enough water till soft. Drain water and cool. Peel the taro roots and slice them slightly thick.\r\n2 Heat oil in a heavy bottomed vessel. To test if oil is hot enough for deep frying chamadumpa aka arbi root slices, drop a slice into the oil, if the oil bubbles around it with a sizzling noise, the oil is ready.\r\n3 Into the hot oil, drop the sliced taro roots (depending on the size of vessel used for deep frying, drop just enough arbi slices such that the vessel isn't overcrowded). On medium flame, deep fry chamadumpa slices.\r\n4 Use a slotted stainless steel ladle to stir the taro root chips gently. When they reach golden brown color, remove them onto a paper towel to absorb any excess oil. Repeat with the remaining batch of arbi slices. \r\n5 Season chamadumpa slices with salt, chilli pwd, cumin pwd and coriander pwd. Remove onto a serving plate and serve.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/10\/taro-root-chips.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/taro-root-chips-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/taro-root-chips-300x300.jpg","style":["easy","modern"],"course":["snack"],"special-diet":["eggles","nut free","gluten free","vegan","vegetarian","dairy free","vegetarian","kid friendly"],"cuisine":["andhra"],"cook-time":"20","prep-time":"30","main-ingredient":["taro root"],"serves":"6","goes-well-with":["tea","coffee","juice","rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["chamadumpa","chips","colocasia","taro-root"]}