{"id":1289,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/01\/baked-vegetable-jalfrazi\/","title":"Baked Vegetable Jalfrazi","content":"Baked Vegetable Jalfrazi with Home made bread\r\nThough this recipe is time consuming in terms of preparation, its worth the effort and time. Makes for a satisfying, nutritious, and delicious one pot meal. And not to mention, its a great way to get Nehal to eat his vegetables. \r\n\r\nBe prepared for some good amount of chopping. I chopped and chopped and chopped! :) You'll need to plan ahead by chopping the vegetables and pureeing the tomatoes, but believe me, it's well worth the effort, and if you chop some extra quantity of vegetables you'll be prepared for cooking another vegetable-laden meal. I had some chopped vegetables left after preparing the vegetable jalfrazi which I used for preparing Mexican rice. We had the jalfrazi with homemade bread while my son had it with sesame buns.\r\n\r\n&nbsp;Chopped mixed vegetables ~ Assembling vegetables, tomato puree and grated paneer\r\nVery simple to put together. Chop mixed vegetables finely (carrots, baby corn, cabbage, green peas, onions, beans, cauliflower, tomato and capsicum). Heat 1 tbsp of olive oil in a heavy bottomed vessel, add onions and saute for 2 mts. Add rest of the vegetables and saute for 7-8 mts. Add kasuri methi (1 tsp), fresh coriander leaves (1 tbsp), salt and red chilli powder to taste. Garam masala powder is an optional ingredient and a large pinch can be added for those who like masala flavor. Combine well and keep aside. \r\n\r\nBlanch tomatoes for 3-4 mts, peel skin and puree. Heat a tbsp of olive oil in a vessel, add some crushed garlic (3-4 cloves) and one chopped onion and saute for 4 mts. Add four chopped tomatoes and cook for 10-12 mts. Add salt, large pinch red chilli powder and a teaspoon of jaggery. Turn off heat and cool. Once cool, blend to a fine paste. Keep aside the onion-tomato paste aside.\r\n\r\nGrate paneer (1\/4 cup) and keep aside. If you want a cheesy flavor, use cheese in place of paneer.\r\n\r\n&nbsp; Baked vegetable jalfrazi served with homemade bread\r\nTake an oven proof square glass baking pan. Spread a layer of the sauteed vegetables, then spread a layer of the onion-tomato paste over the vegetables. Finally sprinkle grated paneer or cheese all over. Bake in a pre-heated oven at 200 C for 10-12 mts. Serve with bread or buns.\r\n\r\nThis recipe is my entry to the food blog event 'The Saas, Bahu Aur Sensex Contest'  hosted by the lovely Nags of Edible Garden to celebrate the spirit and individuality of Indian women worldwide.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/baked_vegetable_jalfrazie_with_bread.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/baked_vegetable_jalfrazie_with_bread-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/baked_vegetable_jalfrazie_with_bread-300x300.jpg","main-ingredient":["carrots","beans","cauliflower"],"author":null,"type":"post","categories":["All Recipes","Easy Pasta Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["jalfrazi","vegetables"]}