{"id":13008,"permalink":"http:\/\/www.sailusfood.com\/2011\/11\/12\/vegetable-manchurian-dry-recip\/","title":"Vegetable Manchurian","content":"Many of you following my blog for sometime would know that I enjoy Indian Chinese food immensely. I haven't posted any Indian Chinese recipes in a while and was going through the archives when I realized that I had not blogged a popular Indian Chinese appetizer, Vegetable Manchurian. Its prepared almost on the same lines as Gobi Manchurian except that we use finely chopped mixed vegetables instead of Gobi (Cauliflower). \r\n\r\nThere are two versions of Vegetable Manchurian, wet and dry. Made with generous amount of garlic and ginger and flavored with soy sauce and vinegar, the wet Vegetable Manchurian (with gravy) complements steamed white rice and is best when drizzled on a serving of steaming hot rice, fried rice or noodles. The dry Vegetable Manchurian is best served as an appetizer and is a favorite in our home.\r\n\r\nDry Vegetable Manchurian\r\n\r\nI do get a lot of requests to post snacks and appetizer recipes and I try my best to update the site with such recipes. Please be patient with me as I try to cater to your requests. For today, I am happy to post a favorite appetizer. Do make this popular appetizer at home and surprise your family.\r\n\r\nVegetable balls ready to be deep fried ~ Fried Vegetable balls\r\n\r\nVegetable Manchurian Recipe\r\nPrep & Cooking Time: 40 mts\r\nServes 4-5 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups finely chopped capsicum, cabbage, carrot, beans and spring onion whites (packed cups)\r\n\r\n2 tbsps maida\/all-purpose flour\r\n\r\n2 tbsps cornflour\r\n\r\n1\/2 tbsp rice flour \r\n\r\n1 tbsp ginger-garlic-green chilli paste\r\n\r\n1\/4 tsp soy sauce\r\n\r\n1\/2 tsp black pepper powder\r\n\r\nwarm water as required (less than 1\/2 cup is needed)\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\nFor sauce:\r\n \r\n1\/4 cup spring onions, finely chopped\r\n\r\n1 1\/2 tbsps finely minced garlic\r\n\r\n1\/2 tbsp finely minced ginger\r\n\r\n2 finely chopped green chillis\r\n\r\n1\/2 tsp red chilli powder (preferably Kashmiri)\r\n\r\n2 tsps soya sauce\r\n\r\n1\/2 tbsp chilli sauce\r\n\r\n2 tsps vinegar\r\n\r\n2 tbsps tomato sauce\r\n\r\n1 tsp brown sugar \r\n\r\nsalt as required\r\n\r\n1 tbsp sesame oil\r\n\r\n1 1\/2 - 2 tbsps finely chopped coriander leaves OR spring onion greens\r\n\r\n\r\n\r\n1 Heat oil for deep frying in a heavy bottomed vessel. \r\n2 In a bowl, combine maida, cornflour, rice flour, salt, ginger-garlic-green chilli paste, pepper pwd, soy sauce, salt and all the finely chopped vegetables. Sprinkle little water to make a thick mixture. Add water little by little and use only as much water as required to form small balls. You should be able to make small balls as shown in the picture above. \r\n3 Carefully place each ball into the hot oil. Do not crowd the vessel. Reduce flame and deep fry the vegetable balls till cooked. Increase the flame towards the end of the cooking process and fry till they turn golden brown. Remove onto absorbent paper and keep aside.\r\n4 Heat oil in a large wok and once the oil is piping hot, add the chopped garlic and stir fry for a few seconds. Add the green chillis and ginger and stir fry on high for a few seconds.\r\n5 Add the whites of spring onions and stir fry on high for 2 mts, constantly tossing them. \r\n6 Add the vegetable balls and stir fry for another 3 mts. They should retain their crunch. Reduce to medium heat and add the brown sugar, soya sauce, tomato ketchup, chilli sauce and vinegar. Mix well and cook for 2 mts. Add 3-4 tbsps of water and cook for 2 mts.\r\n7 Toss on high flame for 1-2 mts. Turn off heat. Garnish with the chopped spring onion greens and\/or coriander leaves. \r\n\r\nFor Wet Vegetarian Manchurian (with gravy) follow the steps below.\r\n\r\nWet Vegetable Manchurian\r\n\r\n1 Mix a tbsp of cornflour in a little water. Keep aside.\r\n2 After following step 5 above, add 1 1\/2 cups water and bring to a boil. Reduce to medium heat and add the brown sugar, soya sauce, tomato ketchup, chilli sauce and vinegar.\r\n3 Add the cornflour water slowly and keep stirring till it takes a thick gravy like consistency. Cook for 1-2 mts. Turn off heat. \r\n4 Add the balls to the gravy at the time of serving. Garnish with chopped spring onion greens and\/or coriander leaves. \r\n\r\nYou will find more such easy to make Indian recipes on the blog.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/11\/vegetable-manchurian-dry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable-manchurian-dry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable-manchurian-dry-300x300.jpg","style":["easy","modern"],"course":["appetizer"],"special-diet":["eggless","nut free","dairy free","vegetarian","kid friendly","pregnancy"],"cuisine":["Indian Chinese"],"cook-time":"20","prep-time":"20","main-ingredient":["carrots","beans","cabbage"],"goes-well-with":["rice","noodles"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["indian-chinese","indo_chinese_food","manchurian","vegetable-manchurian"]}