{"id":13006,"permalink":"http:\/\/www.sailusfood.com\/2011\/11\/29\/nuvvula-laddu-til-ke-laddu-recipe-sesame-seeds-balls\/","title":"Nuvvula (Sesame Seeds) Unda ~ Til Ke Laddu","content":"I like to feed Nehal healthy desserts made from nutrition rich ingredients rather than a fat-rich cake or mithai. Sesame seeds Laddu falls under the category of a healthy dessert. Nuvvula Unda or Nuvvula Laddu is a classic Andhra style sweet prepared for festivals like Nagula Chavati. At home, we make this calcium rich sweet often. I usually make small laddus (compared to the size of the sesame seeds laddus you see in this post) and serve as an after lunch dessert to Nehal. \r\n\r\nVery simple to prepare with only two ingredients going into the making of traditional Nuvvula Laddu recipe. I tend to add roasted almond meal or roasted and powdered oats to boost the nutritional profile. The taste of Nuvvula Unda will depend on the quality of jaggery and sesame seeds. Use fresh sesame seeds and good quality jaggery to enjoy the chewy nutty taste of sesame seeds and the sweet flavor of jaggery. A unique combination of flavors that is bound to get you addicted.\r\n\r\nNuvvula Unda ~ Til Ke Laddu\r\n\r\nNuvvula Unda Recipe\r\nPreparation & Cooking Time: 30 mts\r\nMakes approx 20-22 laddus\r\n. \r\n\r\nIngredients:\r\n\r\n1 1\/2 cups white sesame seeds\/nuvvulu\/til\r\n\r\n1 1\/4 cups grated jaggery\/gud\/bellam (grated or cut into small pieces)\r\n\r\n1\/2 cup oats, dry roasted for 5 mts, cooled and ground to a powder (optional)\r\n\r\n10-12 almonds or cashew nuts or fistful of peanuts, dry roast, cool and make a coarse powder (optional)\r\n\r\n1 1\/2 - 2 tbsps milk\r\n\r\n1\/2 tsp cardamom pwd (optional)\r\n\r\n1 Dry roast sesame seeds in a heavy bottomed vessel till the rawness disappears and a nutty aroma emanates the kitchen. Roast on low flame and do not burn them. Remove onto a wide plate and allow to cool.\r\n2 In the same vessel, add the oats and dry roast on low flame for 5 mts. Remove onto a plate and cool.\r\n3 In the same vessel, add the almonds and dry roast on low flame for 5 mts. Remove onto a plate and cool.\r\n4 First grind the almonds till coarse. Remove onto a bowl. Next grind the oats to a powder (5 seconds). Remove onto a bowl with almond powder.\r\n5 Next blend the sesame seeds for 5-6 seconds. You have to make a coarse powder of the sesame seeds. Add the grated jaggery and blend till combined. Add 1-2 tbsps of milk and blend. You can see the oil (sesame seeds) oozing out of the mixture.\r\n6 Remove onto a plate and add the oats powder and almonds powder. Mix and make small balls with this mixture. \r\n7 Store in an air tight container and they stay good for a week to ten days. You can store in the fridge too for longer shelf life.\r\n\r\nSesame Seeds Laddu\r\n\r\nKitchen Tips: Cardamom powder is an optional ingredient and I usually do not add it. If you are not using oats, reduce the quantity of jaggery by 1\/4 cup. You can add 1\/4 cup of desiccated coconut for variation.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/11\/til-ke-laddo.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/til-ke-laddo-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/til-ke-laddo-300x300.jpg","style":["easy","quick","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","vegetarian","gluten free","vegetarian","kid friendly"],"cuisine":["andhra"],"cook-time":"15","prep-time":"10","main-ingredient":["sesame seeds","jaggery"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["laddu","nuvvula-laddu","nuvvulu","sesame-seeds","til","unda"]}