{"id":13010,"permalink":"http:\/\/www.sailusfood.com\/2011\/11\/10\/chocolate-truffles\/","title":"Chocolate Truffles","content":"Truffles are hard to resist decadent treats and for a chocolate freak like me its impossible to stop myself from indulging in this rich temptation. They make for a perfect gift and are super easy to make with just two ingredients ~ chocolate and heavy cream. There are numerous ways by which you can flavor the truffles -alchohol, orange zest\/citrus peel, cayenne chili, cinnamon and expresso being some of them. \r\n\r\nThis is a basic chocolate truffle recipe and one cannot go wrong with it. Bitter sweet chocolate works best but I used both milk chocolate and dark chocolate. \r\n\r\nChocolate Truffles\r\n\r\nThe key is to use good quality ingredients. These have a melt in the mouth texture and the next time I make them I will coat them with tempered chocolate.  Nehal can finish 2 to 3 truffles in one go and loves them plain without any adornment. Truffles are best when served at room temperature.\r\n\r\nTruffles dusted with cocoa powder\r\n\r\n\r\nChocolate Truffles Recipe\r\nPrep & Cooking: 10 mts, Setting: 3-4 hrs\r\n Yields: approx 20 small truffles \r\n.\r\n\r\n\r\nIngredients:\r\n\r\n200 ml\/1 cup heavy cream (I used Amul Fresh Cream)\r\n\r\n1 tbsp butter\r\n\r\n225 gms finely chopped dark bitter sweet chocolate (I used Morde brand -100 gms milk chocolate and 125 gms dark chocoalate)\r\n\r\ncocoa powder OR chopped toasted nuts of your choice OR desiccated coconut OR icing sugar OR chocolate rice for dusting\r\n\r\n\r\n\r\n1 Heat a pan, add butter and fresh cream. Bring to a boil (as bubbles appear along the edges of the vessel) turn off heat. \r\n2 Place chopped chocolate in a stainless steel vessel. Pour the cream over grated chocolate and let it stand for 3 mts. Use a whisk to gently stir till smooth. (Do not beat). Bring to room temperature.\r\n3 Cover the stainless steel vessel with a cling wrap and place in the refrigerator. Allow to set till firm for 4 hours or overnight.\r\n4 Place a little cocoa powder or desiccated coconut or icing sugar or chopped nuts like pistachios\/almonds in a plate.\r\n5 Remove the cling wrap off the stainless steel vessel, use a melon scoop or spoon to remove the chocolate and make small balls.  Dust your hands with cocoa powder while rolling the balls so that they do not stick to your hands.\r\n6 Roll the truffles in the coating of your choice.  Shake truffles in a sieve to eliminate excess cocoa if using cocoa to dust. Place them on parchment\/butter paper lined plate, cover and refrigerate the truffles. \r\n7 At the time of serving bring them to room temperature. Store in an air tight container in the fridge.\r\n\r\nChocolate Truffle","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/11\/chocolate-truffles-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-truffles-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-truffles-recipe-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"5","prep-time":"15","main-ingredient":["chocolate","heavy cream"],"serves":"10","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Featured Recipes","Sweet Dessert Recipes"],"tags":["chocolate","truffles"]}