{"id":1307,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/07\/janthikalu-andhra-savory-snack\/","title":"Janthikalu - Andhra Savory Snack","content":"The queen of Andhra pindivantalu (festival foods prepared with flours) would undoubtedly be Janthikalu, a classic traditional savory snack. No auspicious occasion, picnic or a family get together is ever complete without these crunchy treats. Many a student will recall how their mothers or grandmothers lovingly packed their suitcases with a dabba of these favorite home made janthikalu among other goodies like Kissan mixed fruit jam and Bournvita. Any hostelites or ex-hostelites, remember those days? :)\r\n\r\nJantikalu\r\n\r\nTo savor these irresistable munchies, bribe your Andhra friends or colleagues into giving you a dabba of janthikalu or prepare them at home following this recipe. Just do it and you'll understand why these munchies are adored by Andhras. :) In recent past, almost every town and city in Andhra have their friendly neighbourhood home food stores, Swagruha or Abhiruchi, selling traditional sweets and snacks like chegodi, janthikalu, murukkulu and chekalu to name a few. \r\n\r\n&nbsp;\r\n&nbsp;\r\nA favorite recipe among many a home cook of Andhra. It was a delight watching Ammamma press concentric layers of janthikulu onto a heavy bottomed vessel of hot oil and deep fry to a vibrant golden shade with effortless ease - food art at its best. The main actors are rice flour and besan with salt, chilli powder, ajwain, sesame seeds and ghee or butter providing the supporting roles. The deep frying needs to be done on medium flame to ensure eveness in cooking, crispness and to achieve that golden shade.\r\nJanthikalu Recipe\r\nPrep & Cooking: 1 hr 15 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups rice flour\r\n\r\n1 cup chick pea flour\/besan\/senaga pindi\r\n\r\n1 1\/2 tbsp sesame seeds \r\n\r\n1 tbsp ajwain\/vaamu\r\n\r\n1 tsp red chilli pwd\r\n\r\nsalt to taste\r\n\r\n2 tbsps hot ghee\r\n\r\noil for deep frying\r\n\r\n\r\nMurukku press\/Janthikalu gottam or chatram\r\n1 Put together rice flour, gram flour, salt, hot ghee, chilli pwd, ajwain and sesame seeds, and combine them well. Slowly add water little by little to make a soft dough, just soft enough that it is pressed through easily with the janthikalu press. Test the dough for salt and chilli pwd before deep-frying.\r\n2 Heat a wide heavy bottomed vessel with enough oil for deep frying. Take the janthikalu gottam aka murukku press and use the disc with small holes. Fill half of the press with the dough and once the oil is hot, reduce to medium flame and using circular motion, press the jantikalu gottam to make concentric layers of the janthikalu dough. As you press the dough into the hot oil, you will find the oil froth up in bubbles which will eventually subside as the janthikalu turn to a golden shade. Remember the frying has to be done on medium flame to achieve that golden color and crispness.\r\n3 When the janthikalu turn a golden color, turn over to the other side and let it also cook to a golden brown. Use a slotted ladle to remove onto an absorbent paper and cool. Repeat the same process till the rest of the dough is done. Cool completely before storing in an air tight metallic container.\r\nNote: There are many variations to prepare jantikalu. You can replace the hot ghee with a tbsp of butter OR a mashed potato. Each gives a nice flavor to the jantikalu. Another variation is to replace besan with roasted chickpea (dalia) powder OR roasted urad dal powder.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/jantikalu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/jantikalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/jantikalu-300x300.jpg","main-ingredient":["rice flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Flour Recipes"],"tags":["janthikalu","snacks"]}