{"id":13107,"permalink":"http:\/\/www.sailusfood.com\/2011\/11\/14\/mocha-brownies-recipe\/","title":"Mocha Brownies","content":"Mocha brownies are to die for. With deep notes of expresso, fudge like texture, mocha brownies have decadence written all over them. An indulgent treat with hardly any preparation time, you will need to bake them for a good 40 minutes till the edges and top turn crack-y.\r\n\r\nDo use good quality dark chocolate and make sure you use coffee granules when making these brownies. Its the addition of coffee granules which gives it a nice bitter flavor. A great way to end a meal is with chocolate, serve Mocha Brownies as a party dessert and you will wow your guests who are sure to ask for the recipe.\r\n\r\nMocha Brownies\r\n\r\n\r\nMocha Brownies Recipe\r\nPreparation: 15 mts, Baking: 40 mts\r\nAdapted from Martha Stewart\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/2 cup all-purpose flour\r\n\r\n1\/4 tsp salt\r\n\r\n1\/4 tsp baking powder   \r\n\r\n1 1\/2 tbsps unsweetened cocoa powder\r\n\r\n4 tbsps butter\r\n\r\n1\/2 teaspoon vanilla essence\r\n\r\n1 cup chopped dark\/bitter sweet chocolate\r\n\r\n2 tsps instant coffee powder\/expresso (I used Nescafe)\r\n\r\n2 eggs, lightly beaten\r\n\r\n3\/4 cup brown sugar\r\n\r\n\r\n\r\n1 Preheat oven to 180 degrees C. Grease and flour square pan and line with butter paper, leaving a 2 inch overhang on the two sides so that you can lift the cake from the pan easily once done. Grease the paper and keep aside.\r\n2 In a bowl, add flour, cocoa powder, salt and baking powder. Mix and keep aside.\r\n3 Place a medium heatproof bowl over a pan of simmering water. Place butter in the bowl and let it melt. Remove the bowl from the simmering water and stir in the expresso and chopped chocoate and stir till chocolate melts completely. \r\n4 Whisk in eggs and add the vanilla essence before adding the sugar. Mix well.\r\n5 Mix in the flour-cocoa powder mixture until no trace of flour is left, using a wooden spoon. Do not over mix. Pour batter into prepared pan.\r\n6 Bake in preheated oven for 35-40 minutes until a toothpick inserted in center comes out with a few moist crumbs attached. When you find that the edges have gone slightly dry and the top is cracked, you know its cooked. \r\n7 Cool on a wire rack for 30 mts. Use a dampened serrated knife to cut into squares. Store in an airtight container.\r\n\r\nBrownie","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2011\/11\/mocha-brownie.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mocha-brownie-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mocha-brownie-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["egg","dairy","nut free","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"50","prep-time":"15","main-ingredient":["chocolate","coffee powder"],"serves":"6","goes-well-with":["milk"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Sweet Dessert Recipes"],"tags":["brownies","chocolate","mocha","mocha-brownies"]}