{"id":1313,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/20\/andhra-pindivanta-chegodilu-savory-snack\/","title":"Andhra Pindivanta - Chegodilu - Savory Snack","content":"Chegodi\r\nA gem among Andhra traditional snacks is Chegodi. Golden in shade, speckled with spots of white sesame, moong dal and cumin, crunchy with an irresistable addictive taste - that's chegodi, my all time favorite munchies along with janthikalu, especially during travels. If there is a contest for the best traditional Andhra snack, the odds favor 'Chegodi'.:) Even the most experienced home cooks sometimes have a hard time getting the perfect crisp chegodi. The recipe I am posting today is a tried and tested one and one of the many variations of chegodis Amma prepares. A favorite of our family and a regular evening snack with tea. \r\nChekodilu ready for deep frying\r\nRice flour is the main ingredient and moong dal adds crunch while chilli pwd and cumin seeds add flavor.\r\nChegodilu (Chekodi) Recipe\r\nRecipe Source: Amma\r\nPrep & Cooking: 1 hr 30 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup rice flour\r\n\r\n1 cup water\r\n\r\n1 1\/2 tbsps yellow moong dal\/pesara pappu (soak in water for an hour)\r\n\r\n1\/2 tbsp cumin seeds\r\n\r\n1 tsp sesame seeds\r\n\r\n1 tsp red chilli pwd\r\n\r\n1 tbsp ghee or oil\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Boil water, add salt, ghee and moong dal. Add the rice flour, combine with water by stirring it in and turn off heat immediately. Cover with lid and keep aside.\r\n2 Once cool, add chilli pwd, sesame seeds and cumin seeds and combine with the rice dough. Knead the dough till smooth. Test the dough for salt before preparing chegodis.\r\n3 Apply oil to your fingers and pinch a small lemon size ball of the dough and roll into a thick rope which is approx 3-4 inches in length and form a ring by pressing the ends of the rope firmly. Prepare chegodis in this manner (as shown in the image above) and place lid over them so that they don't dry.\r\n4 Heat a wide heavy bottomed vessel with enough oil for deep frying and once the oil is hot, place the chegodis one by one into the hot oil, you will find the oil froth up in bubbles. Let the chegodis fry on high flame till they rise to the surface. \r\n5 Once the chegodis rise to the surface, turn heat to medium flame and cook the chegodis till they turn a golden shade. Remember the frying has to be done on medium flame to achieve that golden color and crispness. It does take a while to fry the chegodi, hence patience is required. If you reduce flame to low, the chegodis will absorb a lot of oil so remember to keep flame on medium to high.\r\n6 When they slowly turn to a golden color, turn them over gently to the other side and cook to a golden shade. Use a slotted ladle to remove onto an absorbent paper and cool. Cool completely before storing in an air tight metallic container.\r\nNote: There are many variations to prepare chegodi. You can replace the chilli  pwd with green chilli paste or green chilli-coriander leaves paste. You can add vaamu or ajwain (avoid cumin and moong dal if adding ajwain and use red chilli pwd).\r\n\r\nChegodilu ~ stored in stainless steel dabba","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/chegodilu_andhra_savory1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chegodilu_andhra_savory1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chegodilu_andhra_savory1-300x300.jpg","main-ingredient":["rice flour"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes"],"tags":["savories","snacks"]}