{"id":1317,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/08\/cuisines-celebrations-and-communalism\/","title":"Cuisines, Celebrations and Communalism ","content":"In the past few months, bomb blasts in Delhi, Gujarat, Maharashtra, Bangalore have caused an unprecedented unease in India. This has cast a shadow on the Eid, Navratri and Durga puja celebrations. Guest author, Gauri, asks why mindsets cannot gel as easily as cuisine can.\r\n~ Sailaja\r\n\r\nCuisines, Celebrations and Communalism \r\n~ Gauri Gharpure\r\n\r\nRavan dahan ~ Sketch by Gauri\r\n\r\nOf late, fundamentalism- from all possible sides of the faith divide- has marred things- all over India and perhaps more specifically in the city and state I so much love. \r\n\r\nI shall use this wonderful platform Sailaja has provided to talk about Cuisine, Celebrations and Communalism- the things that occupy my mind more prominently at this point of time. However diverse be the faith we follow and the beliefs we believe, all of us converge at one single melting point without exception- food.\r\n\r\nAll our ambitions boil up to roti, kapda and makaan. For most readers here, the quest may not be so simplified and the march to luxury must have set quite high standards on all the three fronts. For example, I pay my house-help some INR 775\/- per month and the cook another 700\/-.We don't bat our eyelids to spend the same amount- their entire month's salary- on a single evening of eating out. It is precisely for this unfortunate divide, that each one of us needs to be truly grateful for the sumptuous food we can afford to eat. \r\n\r\nI grew up to shouts of 'don't waste food' from my Aaji. Her kitchen was, and still remains, an epitome of hygiene, economy and taste. 'Eat what is made or go hungry' was a common diktat. Her fanatic exactions have made us respect food even if we cannot measure up one-tenth to her standards or style.  It is for her that my taste-buds are not fussy today. Saying no seems awkward and wasting means guilt. \r\n\r\nMy Aaji is an open-minded person. So while no one at home was allowed to cook non-veg, she didn't stop us from trying out. 'I feel it wrong to kill to eat when you have such abundant options. But the decision is yours,' she says. Her disapproval is subtle and democratic. It is with such a background that I not only grew up to be a first rate foodie, also tolerant and receptive to different cooking styles. \r\n\r\nLike I learnt to appreciate the classic Malayalee cuisine at my friend's place. I first tasted fish here under the watchful eye of my Baba. 'What if the bone gets stuck in her throat. She eats way too fast,\" he said and seriously believed. But aunty just laughed this out. She took the piece bits by bits and literally fed me my first mouthful of fish. Since then, be it Onam or Christmas, I would go there and hog away all the mallu preparations with glee. \r\n\r\nPost Eid, I got to sample the most amazing bowl of sevaiyyas at the house of our Urdu teacher. I still remember the breath-taking taste of the spoonfuls of chicken biryani another Muslim classmate's mother had made.\r\n\r\nAnd how can I miss the kesar-dhoodh aaji boils to perfection for Kojagiri poornima? Or the diyas she makes out of chana-dal for the 'Jeevti' puja on the Friday of the Saavan month? Or the Pooran poli for Sankranti?\r\n\r\nCooking is a major part of all festivals and cooking is what has the potential to bring people from different walks of life in one happy union. When we can sample delicacies of different castes and communities with fervour, why can't we be tolerant to the different modes of thought? Why are we bent on seeing things in black and white? Why is it that a viewpoint has the scope only to fall in two extreme categories today?\r\n\r\nI am scared that the way things are going in India, a migrant in Mumbai would soon be forced to eat nothing but pithla bhaat and a north-Indian techie in Bangalore would have to learn and write in Kannada before he ventures out for a job. Only the masala dosa has become ubiquitous.  It's high time that familiarity leaves the boundaries of kitchen and paves way in the minds of people. \r\n\r\nOne can think right only with a full stomach. All of us here have the good fortune to eat without a worry for tomorrow's ration. Let us all be a little more broadminded in wake of the recent spate of tension all over the country. \r\n\r\nWhen the Parsi community first landed on a shore in Gujarat, they dissolved sugar in milk and said they would mix with the native population just as easily. The community has remained true to their symbolic word of promise. I suppose it can't be that difficult for each one of us to follow suit. \r\n\r\n- Gauri Gharpure\r\n\r\nEarlier articles\/poems\/sketches by Gauri Gharpure -\r\nWhy summer is sour","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/ravan-dahan1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ravan-dahan1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ravan-dahan1-300x300.jpg","author":null,"type":"post","categories":["All Recipes"],"tags":["festivals"]}