{"id":1345,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/09\/semiya-payasam-rava-laddu\/","title":"Semiya Payasam & Rava Laddu","content":"Festivals reflect the cultural diversity of India, a land of many religions. Festivity denotes - new clothes, rangoli\/muggulu, mango leaves thoranam, smell of camphor and incense sticks, family get togethers, fun, laughter and most importantly home cooks diligently prepare traditional sweets, savories and elaborate festive meals.\r\n \r\nSemiya Payasam ~ Rava Laddu\r\n\r\nToday being Dasara, it has to be a sweet related post. :) Its all about mithais (sweets) which are uncompromisingly rich and it doesn't matter how many calories they contain. Rava Laddu (Sweet Semolina Balls) and Semiya Payasam (Vermicelli Kheer) are South Indian traditional festival sweets that are absolutely mouth-watering and addictive.\r\n\r\nSemiya Payasam ~ Vermicelli Kheer\r\nSemiya Payasam is prepared with Indian vermicelli that is roasted in ghee to a golden color, slowly simmered in milk and sugar, flavored with aromatic cardamom and garnished with toasted cashewnuts and raisins. Simple to prepare, quick, comforting and delicious with a heavenly aroma!\r\n \r\nVermicelli, Sugar, Sago, Cashewnuts &amp; Raisins ~ Roasted Vermicelli, Cashewnuts &amp; Raisins\r\n\r\n\r\nSemiya Payasam Recipe\r\nCooking Time: 30 mts\r\nCuisine: South Indian\r\nServes 6-7 persons\r\n.\r\n\r\n\r\n\r\nIngredients:\r\n\r\n1\/2 lt whole milk (I used skimmed)\r\n\r\n1 cup roasted semiya\/vermicelli\r\n\r\n2-3 tbsps sago\/sabhudana\/saggu biyyam (optional)\r\n\r\n1\/2 - 3\/4 cup sugar (adjust)\r\n\r\n1 tsp cardamom pwd\r\n\r\n10-12 cashewnuts\r\n\r\n1 tbsp raisin\r\n\r\n1 tbsp ghee\r\n\r\n\r\n\r\n1 Heat a pan, add a tbsp of ghee and toast the cashewnuts and raisins till golden brown. Remove from pan, keep aside.\r\n2 In the same pan, add the vermicelli (if its not roasted vermicelli) and roast it for approx 4 mts till a nice aroma emanates the kitchen and it turns a light brown shade. Remove from pan and keep aside.\r\n3 Take a cooking vessel, add the sago and three cups of water and cook for 5 mts, then add the roasted vermicelli and let it cook completely. Add sugar and milk and let it slowly simmer for another 7-8 mts, stirring it once in a while.\r\n5 Add the cardamom pwd and toasted cashews and raisins. Serve warm or refrigerate until chilled. It tastes good both warm and chilled.\r\n\r\nKitchen Notes - You will find that once you turn off the flame and the payasam sits, the semiya will absorb the milk and the payasam will thicken. The payasam thickens even when refrigerated. So at the time of serving, add some warm milk (a few tbsps) and combine well and serve. For a rich taste, use whole milk.\r\n\r\nRava Ladoos ~ Semolina Balls\r\nRava Laddu is a melt-in-the-mouth delicacy prepared with sooji aka semolina, sugar, cardamom and garnished with cashewnuts and raisins. There are a number of versions of rava laddu recipe and each version has its own unique flavor. One variation is the use of grated coconut which I avoided. Very simple to prepare - roast semolina in ghee to a light brown color, combine sugar, cardamom powder, sprinkle milk and form laddus\/balls out of the crumbly sooji-milk mixture and top with toasted cashewnuts and raisins.\r\n \r\nSooji, Sugar, Cashewnuts &amp; Raisins ~ Roasted Sooji, Cashewnuts &amp; Raisins\r\n\r\n\r\nRava Laddu Recipe\r\nCooking Time: 20-25 mts\r\nMakes 10-12 laddus\r\nCuisine: South Indian\r\n.\r\n\r\n\r\n\r\nIngredients:\r\n\r\n1 cup sooji\/upma rava\/semolina\r\n\r\n3\/4 cup sugar (increase according to your choice)\r\n\r\n1 tsp cardamom pwd\r\n\r\nfew cashewnuts\r\n\r\nfew raisins\r\n\r\n3 tbsps ghee\r\n\r\nfew tbsps milk\r\n\r\n\r\n\r\n1 Heat a pan, add a tbsp of ghee and toast the cashewnuts and raisins till golden brown. Remove from pan, keep aside.\r\n2 In the same pan, add the sooji and roast it for approx 7-8 mts till a nice aroma emanates the kitchen and it turns a light brown shade. Remove from pan and keep aside.\r\n3 Take a vessel, add sugar, cardamom pwd, roasted sooji and remaining ghee and combine well. Sprinkle few tbsps of milk and mix till it forms a crumbly mixture.\r\n4 Using both your hands, form small ladoos and top with a roasted cashewnut and raisin. While shaping the laddos be careful such that the mixture stays together. Initially the laddu might tend to break hence be gentle and place the laddu carefully on a plate and it will harden in a few minutes.\r\n\r\nKitchen Notes - For variation, add a few tbsps of grated coconut (roasted in ghee). If you add coconut the shelf life is shorter. For a longer shelf life, its better to make thin sugar syrup and combine the roasted sooji in it and then prepare balls.\r\n\r\nRavva Ladoo ~ Semiya Payasam\r\nBoth Rava Laddu and Semiya Payasam are my entries for Sugar High Friday food event hosted by Anita of Dessert First. She chose 'Spices' as the theme and with aromatic cardamom being the flavor enhancer in both the recipes, they make apt entries. Srivalli is hosting JFI - Festival Treats this month and both these treats are my entries for this event too.\r\nToday is the culmination of Devi Navaratri celebrations. Wishing all my readers, visitors and friends a happy Dasara!","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/rava-laddu1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava-laddu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava-laddu1-300x300.jpg","main-ingredient":["vermicelli"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","South Indian Recipes"],"tags":["festival_sweets","laddu","payasam","rava","semiya"]}