{"id":1376,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/22\/eggless-sesame-oats-crisps\/","title":"Eggless Sesame Oats Crisps","content":"Eggless sesame oats crisps with tea\r\nToday, I prepared eggless sesame oats crisps that were blissfully delicious. I love anything that has sesame seeds in them. You wouldn't believe how quick they were to put together, right from combining the crisps mix to baking them. Less than 30 minutes. I made a small batch while preparing lunch, just before Nehal got back from school and prepared the rest at tea time. I tweaked the original recipe and added coarsely powdered toasted almonds for the extra nutty flavor. What I love about the recipe is, its eggless and calls for nutritious oats and calcium-rich sesame seeds. \r\n\r\nGolden brown treats flecked with sesame seeds and toasted almond pieces, subtle in flavor, slightly nutty and crunchy. This recipe is definitely a keeper and a snack that is sure to be popular among kids!\r\n\r\nEggless Sesame Oats Crisp Recipe\r\nPreparation: 10 mts, Baking: 16-18 mts\r\nMakes approx 28-30 crisps\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup all purpose flour (maida)\r\n\r\n2 1\/4 tbsps unsalted butter\r\n\r\n5 tbsps demerara sugar\r\n\r\n1 1\/2 tbsps golden syrup\r\n\r\n3\/4 cup oats\r\n\r\n4 tbsps sesame seeds \r\n\r\n1 tsp soda bicarbonate (add a tsp hot water and keep aside)\r\n\r\n1 tbsp powdered almonds (roast almonds and coarsely pwd) (optional)\r\n \r\n\r\n\r\n1 Over low heat, melt butter, demerara sugar and golden syrup until the sugar dissolves. Stir in oats, sesame seeds, pwd almonds and flour. Mix in the soda bicarbonate. The resultant dough will be sticky.\r\n2 Pinch some dough (about a small lemon sized ball) and flatten with you finger onto greased cookie sheet. Using your fingers, spread or flatten out to form a thin round. Place crisps at a distance of 2 - 2 1\/2 inches apart as they spread out a lot.\r\n3 Bake in a pre-heated oven at 175 C for about 17-18 mts till the edges are slightly toasted or turn golden. Once baked, the crisp will be soft. After removing from oven, let it cool for 2-3 mts and then use a thin spatula to remove the crisps carefully onto a wire rack to cool. They will harden on cooling.\r\n4 Repeat with remaining dough. Store in airtight container once completely cool.\r\nEggless Sesame Oats Crisps\r\n\r\n\r\nUpdate on 'Taste Of India' - If you have been noticing the disappearance of some of your post titles at TOI since yesterday, its because of a server move of the main domain - http:\/\/sailusfood.com. Yes, I am upgrading to a faster server. Your patience is highly appreciated till the issue is completely resolved. Any queries or bugs, please leave your comments at TOI - Bugs\/Feedback page. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/eggless-sesame-oats-crisps2.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/eggless-sesame-oats-crisps2-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/eggless-sesame-oats-crisps2-300x300.jpg","main-ingredient":["flour","sesame seeds"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Eggless Cake &amp; Cookie Recipes","Flour Recipes"],"tags":["crisps","eggless","oats","sesame"]}