{"id":13902,"permalink":"http:\/\/www.sailusfood.com\/2012\/05\/22\/dal-tadka-recipe\/","title":"Dal Tadka","content":"Dal Tadka, a North Indian dal recipe, is a Dhaba style favorite food of mine.  I have a lot of warm childhood memories associated with Dhaba style food with all its smoky flavors. On many a road trip, our standard mid day vegetarian meal consisted of hot pulka, dal tadka, aloo gobi sabzi, paneer curry, dahi, lassi and salad. We always try to find  an authentic Punjabi dhaba (typically run by a Punjabi) present along the highway route where the food is usually cooked over wood fire. \r\n\r\nDal Tadka\r\n\r\nI have numerous dal recipes on my blog and wonder why it took me so long to post the recipe of Dal Tadka which happens to be a favorite of mine. Dal Tadka aka Tadka Dal or Dal Tarka is a healthy, hearty, beautifully textured, smoky flavored Indian dal dish that is revered by many a Dhaba food connoisseur. The aroma that emanates the home while preparing the tadka for the dal dish is something one needs to experience as I cannot explain in words the sizzle and mingle of Indian spices in hot oil or desi ghee. Truly intoxicating.\r\n\r\nDal Tadka with Palak Lachcha Paratha\r\n\r\nI have prepared Dal Tadka using three types of Indian lentils - tur dal (red gram), chana dal (Bengal gram) and moong dal (yellow dal). You can use just tur dal or any two lentils like masoor dal or yellow moong dal, if you do not have all the three types of lentils on hand. I have used desi ghee (clarified butter) for tempering which gives a rustic flavor to the dal. You can use oil for a vegan version which will taste just as good. Authentic Dal Tadka recipe does not call for the use of curry leaves but I like the flavor of curry leaves and hence I threw in a few leaves in the tempering. \r\n\r\nDal Tadka goes best with hot pulkas, chapati, naan and jeera pulao. I served Dal Tadka with Palak Lachcha Paratha which made for a fantastic combination. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/05\/dal-tadka.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dal-tadka-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dal-tadka-300x300.jpg","style":["easy","quick","modern"],"course":["main-course"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"15","prep-time":"10","main-ingredient":["tur dal"],"serves":"4","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Indian Dal Recipes","Indian Lentil Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["dal","dal tadka"]}