{"id":1391,"permalink":"http:\/\/www.sailusfood.com\/2008\/10\/28\/diwali-sweets-badam-halwa-bobbatlu-annam-payasam\/","title":"Diwali Sweets - Badam Halwa, Bobbatlu & Annam Payasam","content":"Wishing all my readers, visitors and friends a happy and safe Deepavali! \r\n\r\n\r\nPhew! Its been a marathon of sweets dishes at our home. Three sweet recipes for my dear readers this Diwali - Badam Halwa, Annam Payasam and Bobbatlu. With a home full of near and dear loved ones and the background sound of crackers bursting, I'm trying to get this Diwali post up. :)\r\nBadam Halwa ~ Almond Sweet\r\n\r\nBadam Halwa is a melt-in-the-mouth creamy delight prepared with almonds, sugar, milk and ghee. Preparation is simple - prepare sugar syrup, combine ghee and almond paste to the syrup, stirring it constantly till it forms a smooth creamy texture. \r\n\r\nBadam Halwa Recipe\r\nCooking Time: 40 mts\r\nMakes 10-12 laddus\r\n. \r\n\r\nIngredients:\r\n\r\n1 cup almond paste\r\n\r\n3\/4 cup sugar \r\n\r\nlarge pinch cardamom pwd\r\n\r\n2-3 tbsps milk\r\n\r\n1 1\/2 tbsps ghee\r\n\r\n1 Place 3\/4 cup of almonds in hot water and leave aside for an hour. The almonds easily peel off after an hour. Grind the peeled almonds to a smooth paste by adding milk.\r\n2 Take a heavy bottomed vessel, add the sugar and water and let it melt and once it begins to boil, add the almond paste and combine. Now get ready for some good arm work-out. Go on stirring till the mixture begins to thicken (it should look like a thick dosa batter) on low flame). During the stirring process, add the ghee which gets absorbed into halwa. Turn off heat.\r\n3 Leave aside to cool and it thickens further. \r\n\r\nBobbatlu\r\n\r\nI blogged Bobbatlu recipe earlier. I thought I'd post it again. Time consuming affair but worth the effort. A tempting traditional lentil based sweet that also goes by the name Obattu, Bhakshalu and Puran Poli.\r\n\r\nBobbatlu Recipe\r\nCooking Time: 1 hr\r\nMakes approx 15 bobbatlu\r\n. \r\n\r\nIngredients:\r\n\r\n1 cup chana dal\/bengal gram soaked in water for an hour and drained\r\n\r\n1 cup sugar (adjust to your choice)\r\n\r\n1 1\/4 cups maida\/all purpose flour\r\n\r\n3-4 tbsps oil\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n1 tbsp ghee\r\n\r\npinch of salt\r\n\r\n1 Pressure cook channa dal adding a cup of water till the dal turns very soft. Grind to a fine paste.\r\n2 Heat a cooking vessel, add the ground dal paste and sugar and cook till they blend and form a thick lump like paste with no moisture left. Keep stirring on slow flame. Add cardamom pwd and salt and combine. Cool and prepare small lemon sized balls for stuffing. Keep aside.\r\n3 Combine maida, pinch of salt, oil and enough water to make a very soft and sticky dough(softer than puri dough). Knead well and keep aside for one or two hours.\r\n4 Grease your hand with oil and pinch a small portion of dough and flatten it into a 2\" disc. Place a ball of channa dal stuffing in the centre and draw the edges of the dough from all sides to cover the stuffing completely.\r\n5 Take a plastic sheet or a plantain leaf and gently flatten each ball carefully with your fingers to form a 6\" diamater flat circular roti\/bobattu\/poli.\r\n6 Heat a tawa and fry it on low flame such that its roasted on both sides till brown spots appear. Smear oil over the bobbatu while frying.\r\n7 Serve warm with ghee. Store them in an air tight container or in the refrigerator. Stays fresh for a few days.\r\n\r\nKitchen Notes - For variation, you can add a few tbsps of grated coconut to the channa dal stuffing. \r\n\r\nAnnam Payasam ~ Rice Kheer\r\n\r\nAnnam Payasam aka Paramannam (Food of the Gods) is prepared with raw rice, milk and jaggery or sugar. Rice is slowly simmered in milk and combined with jaggery, flavored with aromatic cardamom and garnished with toasted cashewnuts and raisins. I had earlier blogged Paramannam recipe which was prepared using sugar. The version I'm blogging today calls for jaggery. Simple to prepare, comforting and delicious!\r\n\r\nAnnam Payasam Recipe\r\nCooking Time: 40 mts\r\nCuisine: Andhra\r\nServes 6-7 persons\r\n. \r\n\r\nIngredients:\r\n\r\n1\/2 cup raw rice washed and drained\r\n\r\n1\/2 cup grated jaggery\r\n\r\n1 cup water\r\n\r\n1\/2 lt low fat milk\r\n\r\npinch of salt\r\n\r\n1\/4 tsp cardamom pwd\r\n\r\n1 tbsp ghee\r\n\r\n10-12 cashewnuts \r\n\r\n1 tbsp raisins\r\n\r\n1 Heat a pan, add a tbsp of ghee and toast the cashewnuts and raisins till golden brown. Remove from pan, keep aside.\r\n2 Heat a vessel, add grated jaggery. Let the jaggery melt over slow flame till its sticky on touch. Don't over cook it, it should basically completely melt. Strain the jaggery and cool.\r\n3 In a separate vessel, bring milk and water to a boil. Lower heat and add the rice to the milk. Cook until the rice is soft and the mixture turns thick. Remove from heat and cool.\r\n5 Once cool, add the jaggery syrup to the cooled cooked milk and combine well. Add the cardamom pwd, salt and toasted cashews and raisins. Serve warm or refrigerate until chilled. It tastes good both warm and chilled. \r\n\r\nKitchen Notes - Do not add the jaggery syrup while the rice is being cooked. Ensure the flame is off and the cooked rice is slightly cool when adding the jaggery syrup. For a rich taste, use whole milk.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/annam-payasam1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/annam-payasam1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/annam-payasam1-300x300.jpg","main-ingredient":["almonds","rice","sugar"],"author":null,"type":"post","categories":["All Recipes","Festival Foods","Flour Recipes","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["diwali-sweets"]}