{"id":13957,"permalink":"http:\/\/www.sailusfood.com\/2012\/07\/28\/tabbouleh-recipe\/","title":"Tabbouleh","content":"Tabbouleh\r\n\r\nI have been making a lot of salads in the recent past. The other day, I made a couscous based Lebanese recipe, Tabbouleh. Light on the stomach, filling and healthy vegetarian\/vegan salad. I enjoy Middle Eastern cuisine especially the pita bread, shawarma wraps, baba gonuash (made with eggplant), falafel, hummus, fattoush, tahini and baklava to name a few. In fact, I am hoping to blog my favorite Middle Eastern recipes as a series similar to the Chaat recipes I blogged two years ago. \r\n\r\nThe authentic version of Tabbouleh recipe calls for the use of Bulgur, which is basically partially steamed wheat kernels\/wheat berries that are dried, coarsely ground and sifted to various sizes ranging from very fine to very coarse. Bulgur is high in fiber with a light, sweet and nutty flavor and chewy texture. Since its precooked, Bulgur is done by pouring boiling water over it and letting it to sit for a few minutes with a lid. It is often confused with cracked wheat which is not precooked like Bulgur. Bulgur is a staple in Middle Eastern cuisine and is an essential ingredient in the Lebanese classic salad, Tabbouleh recipe, along with olive oil and lots of parsely. \r\n\r\nIngredients to make Tabbouleh\r\n\r\nFine Bulgur is used in the authentic Tabbouleh recipe. Since I did not have Bulgur on hand, I have substituted it with Couscous which is a grain type of pasta made from wheat or sometimes from other grains such as barley, millet, sorghum or maize, and is a staple in North African cuisine. Its hard to find Bulgur or Couscous in India but they can be easily substituted with Dalia aka cracked Wheat aka Bansi Rava. Parsley can be substituted with fresh coriander leaves.\r\n\r\nLebanese Vegetarian Salad ~ Tabbouleh","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/07\/tabbouleh.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tabbouleh-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tabbouleh-300x300.jpg","style":["easy","quick","traditional"],"course":["salad"],"special-diet":["eggless","dairy free","nut free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["Lebanese"],"cook-time":"20","prep-time":"5","main-ingredient":["bulgur","parsley"],"serves":"3","goes-well-with":["falafel"],"author":null,"type":"post","categories":["All Recipes","Lebanese Recipes","Middle Eastern Recipes","Recipes Vegetable Dishes","Salad Recipes"],"tags":["couscous","lebanese-recipes","tabbouleh"]}