{"id":13983,"permalink":"http:\/\/www.sailusfood.com\/2012\/08\/24\/oats-dosa-recipe\/","title":"Oats Dosa","content":"Crispy Oats Dosa with Ginger Chutney and Coconut Chutney ~ Healthy Breakfast\r\n\r\nOats Dosa Recipe\r\n\r\nOats Idli recipe was well received with positive feedback from readers who have tried it. Appreciate it very much when readers try the recipes posted here and come back to try out more recipes. You, dear readers, keep this blog going. Thank you very much. :)\r\n\r\nToday's post is for all you Rava Dosa lovers. A favorite Indian breakfast of mine is Oats Dosa. You don't need to soak, grind and ferment rice and dal like you would for Masala Dosa. This is an instant Oats dosa recipe, crisp and tasty like Rava dosa. Its hard to tell that there is oats in this recipe. \r\n\r\nI had earlier blogged Rava Dosa, a popular blog post at Sailu's Kitchen. Just a slight variation to this rava dosa recipe, is the addition of dry roasted oats powder and sour buttermilk. You will achieve crisp oats dosa if you follow the recipe and the instructions to the T. You will have to eat the oats dosa hot off the stove because as the dosa cools down, it turns limp and the crispness lost. Oats dosa goes well with sambar, coconut chutney or ginger chutney.\r\n\r\nRava dosa recipe pictorial with step by step instructions.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/08\/oats-rava-dosa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oats-rava-dosa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oats-rava-dosa-300x300.jpg","style":["easy","quick","modern"],"course":["breakfast"],"special-diet":["eggless","dairy free","nut free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"30","prep-time":"10","main-ingredient":["oats","semolina"],"serves":"5","goes-well-with":["chutney","pickle"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["indian-recipes-with-oats","oats","oats-dosa"]}