{"id":13980,"permalink":"http:\/\/www.sailusfood.com\/2012\/08\/22\/instant-oats-idli-recipe\/","title":"Instant Oats Idli","content":"Instant Oats Idli with Ginger Chutney and Coconut Chutney ~ Our Breakfast\r\n\r\nInstant Oats Idli Recipe \r\n\r\nOats is a healthy way to kick start one's day and I try to include it in our diet at least 3-4 times a week. I have noticed that hardly any Indian recipes with oats have made it to the blog even though oats are an integral part of our morning breakfast routine. \r\n\r\nA couple of blog readers have been requesting for recipes using oats and I thought it would be a good idea to do a series of Indian oats recipes on similar lines to Chaat recipes that I did two years ago.\r\n\r\nThe highly nutritious, wholesome, high fiber, nutty and filling oatmeal is a regular breakfast fare for Nehal, either in the form of a savory vegetable broth or a fruit\/yogurt porridge, which usually takes less than 10 minutes to prepare. Satish and I prefer our Indian-ized oatmeal avatars - upma, rava dosa, instant rava idli, ponganalu, pongal, uttappam, roti, bisi bele bath and the likes. \r\n\r\nInstant Oats Idli\r\n\r\nUsing oats in Indian style recipes can be quite tricky as it tends to have a sticky texture, so its a good idea to dry roast the oats for a few minutes before using it. I usually dry roast a packet of oats and store it especially for Indian style recipes with oats. I'm kick starting the series with a favorite breakfast of mine, Instant Oats Idli recipe.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/08\/oats-rava-idli.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oats-rava-idli-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oats-rava-idli-300x300.jpg","style":["easy","quick","modern"],"course":["breakfast"],"special-diet":["eggless","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"15","prep-time":"10","main-ingredient":["oats","semolina"],"serves":"4","goes-well-with":["chutney","pickle"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","South Indian Recipes"],"tags":["indian-recipes-with-oats","oats","oats-idli"]}