{"id":13996,"permalink":"http:\/\/www.sailusfood.com\/2012\/08\/30\/oats-uthappam-healthy-breakfast-recipe\/","title":"Oats Uthappam Recipe","content":"Oats Uthappam with Coriander Chutney ~ Healthy Indian Breakfast\r\n\r\nOats Uthappam\r\n\r\nI am happy that the Indian style oats recipes blogged so far have been a success with those of you who tried and have been kind enough to let me know. If any of you have tried the oats recipes blogged here, do leave your feedback. Oats Uthappam topped with vegetables is another successful oats recipe from my kitchen. Its super quick to put together and those of you who find it boring to eat plain oats day in and day out, should give this winner of a recipe a try. Your kids will be asking you for seconds. Its that good. Seriously.\r\n\r\nSo how to maximize the flavor of the uthappam and make it special? Include whole wheat bread powder and yogurt in the oats uthappam batter and top it with vegetables while its cooking. Oats Uthappam stands up well to different toppings. Top it with your choicest fresh vegetables like carrot, capsicum, onions or cabbage and the likes to suit your taste. Grated paneer (tofu for vegans) with lots of fresh coriander, finely minced green chilies and ginger also works great. \r\n\r\nAnother option, which also happens to be my favorite, is a generous sprinkle of home made spiced lentil powder like Andhra gun powder (Kandi Podi) or Milagai Podi. Just sprinkle the podi as soon as the uthappam is cooked and serve warm. Be sure to eat Oats Uthappam hot off the stove when its flavor is at its best. :) \r\n\r\nIndian Style Savory Oats Pancakes","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/08\/oats-uthappam-indian-style.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oats-uthappam-indian-style-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oats-uthappam-indian-style-300x300.jpg","style":["easy","quick","modern"],"course":["breakfast"],"special-diet":["eggless","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["Andhra"],"cook-time":"20","prep-time":"15","main-ingredient":["oats","whole wheat bread"],"serves":"4","goes-well-with":["chutney","pickle","podi"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Lunch Box Recipes"],"tags":["indian-recipes-with-oats","oats","oats-uthappam"]}