{"id":13990,"permalink":"http:\/\/www.sailusfood.com\/2012\/08\/26\/oats-upma-recipe\/","title":"Oats Upma","content":"Healthy Indian Breakfast ~ Upma with Oats\r\n\r\nOats Upma\r\n\r\nHave you ever tried making upma with oats? Upma, a very common and quick South Indian breakfast dish, is not very popular unlike its counterpart, the famous Masala Dosa. People either love or hate Upma. I know of many kids and adults alike who hate to hear the phrase 'upma for breakfast'. I don't belong to that category, though. I like to eat upma occasionally. \r\n\r\nI have prepared numerous recipes with oats in it, especially upma varieties - plain sooji upma, rice ravva upma or wheat rava upma. You just need to give it some thought and see how you can infuse oats into the original recipe. Plain Oats Upma has always turned out to my satisfaction. My family is not too fond of upma, eat it occasionally, but when I try to serve upma with oats in it, they are more than willing to try. I'm a happy lady. :)\r\n\r\nI have for you an Andhra style oat upma recipe that is healthy, super quick and easy to make. I have added mixed vegetables to increase the nutrition quotient and a bit of whole garam masala spices to increase the flavor profile. Enjoyed every spoonful of the oats upma.\r\n\r\nOats Upma","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/08\/oat-upma.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oat-upma-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/oat-upma-300x300.jpg","style":["easy","quick","modern"],"course":["breakfast"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"25","prep-time":"10","main-ingredient":["oats","mixed vegetables"],"serves":"3","goes-well-with":["pickle","chutney"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Recipes Vegetable Dishes"],"tags":["indian-recipes-with-oats","oats","oats-upma"]}