{"id":14011,"permalink":"http:\/\/www.sailusfood.com\/2012\/09\/01\/indian-food-mangalorean-recipes\/","title":"Indian Food Trail ~ Mangalorean Cuisine (Part 2)","content":"Shireen of Ruchik Randhap continues her journey on the Indian Food Trail with the second part of Mangalorean Cuisine and shares more Mangalorean recipes like Holige and how they make the most of nature's bounty in their regional cuisine.\r\n\r\n~Sailaja\r\n\r\nHoligeMangalorean Recipes\r\n\r\nHow we count our blessings:\r\nMangaloreans make the most of nature's bounty - most of which is free, organic and readily available in our own backyards. Since Mangalore's coastline is dotted with beautiful houses with tiled roofs most homes have front or backyards that give them the luxury of growing their own vegetables like Ivy Gourd (tendli), Field Marrow\/Madras Cucumber (mogem\/southe kai) or Malabar Spinach (valche baji\/basale). Every garden has at least one or more of these seasonal fruit bearing trees such as Pineapple, Jackfruit, Cashew, Mango, Love Apple etc or those that provide goodies all year round - Coconut, Banana, Papaya & Guava.\r\n\r\nGariyo - Jackfruit Fritters\r\n\r\nThe advantage of being on the coastline is being blessed with the abundance of the ocean. The Arabian Sea provides seafood and thus livelihood to our people. The Mogaveera community is the one that manages the local fishing and marine business. The day's catch is best bought off the docks where at dawn the fish is auctioned. Sadly, many local people complain that the best of the ocean's bounty is exported making it a very expensive and unaffordable source of food for people belonging to the lower strata of the society in Mangalore.\r\n\r\nThe Coconut tree - Kalpvriksh:\r\n\r\nThe coconut tree that is revered across India as the 'Kalpvriksh' (divine tree that fulfils wishes) and is found in abundance along India's coast also finds a place of significance in Mangalore. So much so that every part of this tree is made use of. The fruit of this tree - the coconut in its tender or ripe form provides nourishment to the body and hence a major chunk of Mangalorean recipes are coconut based - whether sweet or savoury. The coconut finds its way into a dish - ground or grated, with its milk extracted or even in the form of oil - the coconut is ubiquitous to Mangalorean cuisine.\r\n\r\nKottige\r\n\r\nRice is a Religion:\r\n\r\nThe love of rice walks in tandem with the love of coconut in Mangalore. When we think of breads, sweets & savouries we think of 'rice'. Yes, besides eating rice in its virgin form (piping hot steamed rice), we transform it into several breads made of rice batter that is most often steamed in a steamer or thondor as we call it in Konkani or fried on cast iron griddles. We use different varieties of rice for meals and in the preparation of rice breads. Mangalorean recipes like Rice cakes (Idlis & Sanna), Pancakes (Neer Dosa, Dosa, Appams, Rotti\/Bhakri), Stringhoppers (Sevai\/Sheviyo\/Shavige) are all popular breads that are part of all sub-cuisines and are eaten for breakfast, along with curries (vegetarian or non vegetarian) during mealtimes and are often sweetened with jagggery & coconut and served as an evening tea time snack. Neer Dosa with a sweet filling (called as Portha Polay in Konkani) is one of my all time favourites.\r\n\r\nKidiyo\r\n\r\nTypical snacks & munchies:\r\n\r\nTea time snacks also bring to mind a host of typical Mangalorean sweets & savouries that are made in homes as well as road side eateries & hotels (restaurants). While the Masala Dosa (Crepe served with a semi-mashed potato filling) & Goli Baje (Deep Fried Savoury Maida Fritters) have gone global thanks to the chain of 'Udupi restaurants' mushrooming in every city, the Neerulli Bajje (Onion Pakodas\/Fritters), Mangalore Buns (Deep fried Banana Pooris), Chattambade (Gram fritters), Uddina Vade (Medhu Vada\/Savoury Donuts), Sheera (Sweet Semolina Pudding), Sajjige-Bajil (Savoury Semolina & Beaten Rice Combo), Podi (Breadfruit or Banana fritters) still remain to be favourites of every Mangalorean living in or outside of Mangalore. If you visit any of these small restaurants in Mangalore it is a delight to listen to the waiter rattle off the menu in one breath - making it impossible to make a decision!\r\n\r\nWhile most of Mangalorean snacks are deep fried, there are a lot of healthier ones too. Today, I'm sharing a recipe of one of the less sinful delights which remains to be my childhood favourite. Typically made by the Brahmin community on weddings and festive occasions, it is prepared by hired cooks 'Adige Bhatta' on the previous evening of the function. Mithai Laddoo\/Boondi Laddoo is a famous preparation along with the Holige and both are a popularly available at almost all bakeries in Mangalore. Holige keeps well for 2-3 days and hence an ideal snack for kids or need to carry travel snacks that don't go bad soon.\r\n\r\n\r\n\r\nSo if you are keen to try out some typical Mangalorean recipes with a touch of each of its sub-cuisines then why don't you start your day with a hefty breakfast of Neer Dosa & Curry Leaves Chutney. A hearty lunch consisting of Kori Ghassi & Kottige will leave you licking your fingers. A delicious, nutritious Vorn will end the meal on a sweet note. A light tea time snack of Holige and a simple dinner of steamed rice, Dali Tove and Clam Sukka and will complete your day. \r\n\r\nHope you have enjoyed reading the articles on Mangalorean cuisine. I will be back in a few days with the final part of the series focusing on Catholic food traditions.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/08\/holige-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/holige-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/holige-recipe-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["Mangalorean"],"cook-time":"15","prep-time":"25","main-ingredient":["maida","bengal gram"],"serves":"8","goes-well-with":["ghee","butter"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Mangalorean Recipes"],"tags":["holige","mangalore-recipe"]}