{"id":14026,"permalink":"http:\/\/www.sailusfood.com\/2012\/09\/05\/indian-food-mangalorean-catholic-cuisine\/","title":"Indian Food Trail ~ Mangalorean Catholic Cuisine ","content":"Mangalorean Catholic Cuisine\r\n\r\nHello dear readers! I am back with the third and final part of the article on Mangalorean cuisine for the Indian Food trail series. Today I will take you on a culinary journey into Mangalorean Catholic cuisine in particular. As I had mentioned in the first part of the Mangalorean Food series, Mangalorean cuisine is a blend of local flavours from each community. Mangalorean Catholics have their roots in Goa and are descendants of Goan Catholics who migrated from Goa between 1560-1763 due to the Goa Inquisition,  the Portuguese - Adil Shahi wars and the Portuguese - Maratha wars (read more) and hence our culture is a blend of Goan & Mangalorean cultures. Mangalorean Catholic Cuisine is adapted from the local cuisine of South Canara but retained the Goan\/Portuguese influence in a large variety of their food. \r\n\r\nSpecial Surmai Curry\r\n\r\nMangalorean Catholic cuisine is often synonymous with Dukra Maas (Pork) and Sanna (Fluffy idlis with yeasted batter). Pork is cooked in a variety of ways ranging from Bafat, Indad (Vindaloo), Sorpotel or Kaleez Ankiti (pork offal cooked in spices). Mangalorean Catholic cuisine also includes many dishes using mutton (goat meat), beef and a whole range of seafood  (fresh catch or dried fish). We particularly love our coconut based fish curries.\r\n\r\nA traditional Mangalorean Catholic household begins their day with prayers and a hearty breakfast mostly made of rice - usually rice batter that is steamed (Sanna, Idli, Mutlim) or fried (bhakri, appam, pan polay, polay). Pou (beaten rice) is also part of the breakfast menu in the form of Godaso Pou (beaten rice with fresh coconut & jaggery) and Theek Pou (beaten rice seasoned with spices). Lunch consists mostly of seafood.Fish curry & boiled rice (white\/brown\/red rice) accompanied by a vegetarian side dish cooked Thel Piao (oil & onion) style or fugad style (vegetables cooked in spices, garnished with grated coconut and seasoned with mustard, garlic & curry leaves). Shredded\/chunky mango (or lime) pickle or a papad completes the meal. Sometimes the fish curry is replaced by a simple Daliso Saar which is spiced lentils of a watery consistency. Fish marinated in Meet Mirsang (salt & chilli paste) is fried on a slow flame usually in coconut oil till crisp (if desired) and served.\r\n\r\nA typical Mangalorean Meal\r\n\r\nKube Sukhe (Clams\/cockles cooked in a fugad style) or Prawn Masala Fry (fried prawns) are also much loved meal options along with fish curry and rice in Mangalorean Catholic cuisine. Sometimes clams or prawns are cooked in combo curries along with vegetables or rice dumplings, for example Kube Mutlin (clams with mini rice dumplings). Since fish and meat are dominant in our daily meals, there are few vegetarian dishes that we prepare apart from the thel piao and fugad style dishes. Usually its the vegetarian combo curries that feature a vegetable and a legume. For ex: Valchebaji Ani Guley (Malabar Spinach & Black Eyed Peas Curry). Since pepper grows in abundance along the coast, Mangalorean Catholic Cuisine has curries using pepper such as jeere-miri (cumin & pepper) or losun-miri (garlic-pepper) or stew curries (with home made stew powder that is a combination of pepper, cumin and turmeric).\r\n\r\nMangaloreans prepare a whole lot of breads that are usually steamed and often replace rice during meal times. The best part about these breads is that they double up as a breakfast cum lunch accompaniment. Here's the recipe of regular lemon sized rice dumplings that are very simple to prepare yet are slowly vanishing from most modern kitchens today.\r\n\r\nMutlim\r\n\r\nMultim Recipe\r\nPrep (soaking) time: 4 hours | Cooking (grinding+steaming) time 30-40mins | Yield 15-17 dumplings\r\n\r\nIngredients:\r\n1\/2 kg white or red boiled rice (ukda chawal) * see notes\r\n1-1\/2 cups grated coconut\r\nsalt to taste\r\nMethod:\r\n1. Wash and soak the rice for at least 3-4 hours (for best results). Drain and keep aside. If you are using a traditional grinding stone, grind the rice and salt to a slightly coarse, thick & dryish paste. Add the coconut towards the very end (the coconut should not be fully ground). If you are using a mixer grinder you may need to add some water (sparingly) to grind the rice & coconut - the batter may be slightly thinner in this case. \r\n2. If you have a bit of a thin batter, transfer it into a non stick pan and cook on a medium low flame stirring until all the excess moisture evaporates and you have a lump. You know it's ready when the base begins to brown slightly. Turn off the flame and transfer onto a large bowl. When it is cool enough to handle, quickly knead to achieve a smooth surface.\r\n3. Grease your palm with oil if required and pinch out lemon sized balls of the dough. Roll to form a smooth surface and form a dimple with your thumb. Continue until all the dough is used to make mutlims. \r\n4. Transfer all mutlims into a bowl, cover with a cloth and steam for 20-25 minutes. The mutlims are done when their surface is no longer sticky.\r\n5. Serve hot with chicken or mutton curry of your choice. \r\n\r\nNotes:\r\n1. Boiled rice is different from cooked rice. Boiled rice is a variety of rice that is involves partial boiling of paddy before it is de-husked and sold. Boiled rice with bran is called as brown\/red boiled rice and that without the bran is called as white boiled rice available at most grocers by the name Ukda Chawal (in Hindi) or Katsambar (in Kannada) or Ukdo Tandul (in Konkani)\r\n2. You can make the sweeter version of these dumplings by stuffing a jaggery & coconut mixture into the dough just before steaming. These are known as god mutlim.\r\n\r\nIn the olden days when families were large and affordability was low, fresh fish was replaced by dried fish\/shrimp. A typical meal in a Mangalorean Catholic family of moderate means would be Pez ani Galmbyachi Chetni or Karyachi Chetni (rice congee served with a chutney made of shrimp or dried fish). Dried fish was often cooked along with vegetables that have longer shelf life than others such as Mogem (Field Marrow\/Madras Cucumber) or Kualo (Ash Gourd\/White Pumpkin\/Winter Melon). \r\n\r\nDry Shrimp Chutney\r\n\r\nTea time snacks range from seasonal ones to those made all year around. Most often, the breakfast menu undergoes miraculous transformation and gets served for tea. Portha Polay (neer dosa with a jaggery & coconut filling) is a perfect example of this. Sanna or appams are also dipped in tea\/coffee or served with honey or ghee and sugar and eaten cheerfully. Traditional tea time snacks include rice Maani (rice flour pudding sweetened with jaggery & coconut milk) or Mandas (thick rice and cucumber cake) among others. Sweet mutlim (dimpled rice dumplings stuffed with jaggery & coconut) also make their appearance once in a while. The more modern forms of tea time snacks in Mangalorean Catholic cuisine include the bread pudding which is made up of leftover bread, eggs, milk, nutmeg & sugar.\r\n\r\nMaani\r\n\r\nDinner is almost always the same as lunch or in many homes its the rice congee to keep it real simple. Rice congee eaten with pickle or leftover fish\/vegetable curry\/fried fish from lunch is commonplace.\r\n\r\nSince Mangalorean Catholics do not celebrate a lot of festivals, a few special ones including occasions such as weddings or birthdays call for special menus. Besides Christmas & Easter, the feast of the Nativity of the Blessed Virgin Mary (BVM) or the birthday of Mother Mary is celebrated with great gusto on September 8th every year. Each of these occasions have special menus consisting of meat and vegetables, however the feast of the BVM is celebrated coinciding with the local harvest feast and hence we have a festive meal known as the 'novein jowaan' (new\/first meal) which is made up of a pure vegetarian fare consisting of odd numbered dishes. The star of this spread is the Alun Dento (stems of the colocasia\/arbi plant and tender stalks of the green amarath leafy vegetable cooked in a coconut gravy) which is eaten with Sanna. The novein jowaan is again a time of togetherness when the whole family gathers from near & far to pray and eat together. The meal is followed by a leisurely afternoon spent well in chewing sugar canes that are distributed to kids after the Mass in church.\r\n\r\nA month before Christmas, Christians in Mangalore get busy in the preparation of sweet meats and goodies called as the 'Kuswar'. It is a traditional platter of sweets and savouries, usually deep fried, that have a long shelf life. From kidiyo (kulkuls\/dough curls), gulio (sweet rice marbles), neurio (\/karanji\/sweet puffs), kokkisan (rose cookies) pathekan (banana chips), tukdi (diamond cuts), thandhlache laadu (roasted rice laddus) and plum cake - everything is home made. However, modern lifestyle and lack of free time to make these goodies at home has resulted in a lot of people purchasing the eatables from bakeries. In the olden days Kuswar was prepared at home in bulk by the ladies and stored in large aluminium dabbas and distributed amongst close family & neighbours. This tradition was lovingly followed by my paternal grandmother and my mother and the Kuswar was distributed among the neighbouring families. In return we would get a similar platter of goodies during Diwali and Krishna Janmashtami.\r\n\r\nKuswar - Mangalorean Christmas Sweets\r\n\r\nTrue to the adage 'the great Indian wedding', Mangalorean Catholic weddings are a grand affair with a lot of attention paid to every fine detail. From the bridal finery, venue, decorations, guest list to the food, everything is meticulously planned and executed. Wedding ceremonies are elaborate with a Roce ceremony (pre-wedding function on the previous day (or one\/two days)) preceding the wedding day and the Porthapon (grand dinner for close family members of the bride & groom) a day or two after the wedding. There are separate menus for each occasion and below is a traditional curry made of ash pumpkin that is served on the day of the Roce ceremony. Called as the 'Pollu' or 'Polov', decades ago it used to be served without mutton\/goat meat added to it. Today it is served as a non vegetarian curry along with a large plain bun and red nutritious boiled rice. Traditionally the meal that was lovingly prepared by close family and neighbours was served on a 'shirothi' (banana leaf). Today caterers handle bigger crowds and maintain a buffet system of serving the food which includes the polov, pork bafat or sorpotel and plantain (raw banana) sukka among others.\r\n \r\nMangalorean Wedding Style Polov\r\n\r\nThe lavish spread served at the Wedding banquet is undertaken by caterers today and usually consists of a fine spread of non vegetarian items, especially pork, chicken, mutton and a whole range of salads, pulaos or biryanis and desserts. The one item that I used to always look forward to as a child (and still do!) is the typical Sweet Pulao served with Plum Chutney (Date & Raisin Chutney). Today I make it at home whenever I crave for it, for I feel that the best way to recreate the tastes of your childhood is to form a strong bond with your culinary heritage and learn to make them before the recipes are lost forever.\r\n\r\nMutton Polov Curry\r\n\r\nBirthdays, anniversaries and such simple yet important occasions are celebrated with the whole family and  hence range from simple starters to elaborate dishes - depending on the size of the crowd and the helping hands available. Typical family gatherings involve men and women who enjoy hard drinks or wines (especially home made wines) with starters such as the pork salad or chicken lollipops and the rest of the bunch who prefers to simply dig into the lovely spread of biryanis or pulaos, chicken or meat curries, salads and cutlets followed by desserts ranging from kheer\/payasams or ice cream. Since cutlets are almost always present on a party menu, here's a recipe of fish cutlets just for you.\r\n\r\nFish Cutlets\r\n\r\nI do hope you have enjoyed taking this journey through time with me and hope that the recipes will help you recreate the magic of Mangalorean cuisine in your own homes. Traditions remain traditions when they are held close to the heart and followed as much as possible so that our next generation can learn and benefit from the beauty of our Indian culture. A culture that spans the length & breadth of India and blends beautifully with local traditions barring any religious or social differences.\r\n\r\nLast but definitely not the least, I thank you Sailaja for giving me this wonderful opportunity to showcase Mangalorean cuisine and highlight our food culture. I hope your readers enjoyed the 3 part series as much as I enjoyed putting it together and are inspired to try some time tested and much loved Mangalorean recipes.\r\n\r\nIndian Food Trail - Mangalorean Cuisine (Part 1)\r\nIndian Food Trail - Mangalorean Cuisine (Part 2)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/09\/fish-cutlets.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fish-cutlets-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fish-cutlets-300x300.jpg","style":["easy","quick","modern"],"course":["starter"],"special-diet":["nut free","gluten free","non-vegetarian","kid friendly"],"cuisine":["Mangalorean"],"cook-time":"10","prep-time":"30","main-ingredient":["fish"],"serves":"14","goes-well-with":["ketchup"],"author":null,"type":"post","categories":["All Recipes","Indian Non-Vegetarian Recipes","Indian Seafood Recipes","Mangalorean Recipes"],"tags":["catholic","mangalorean-foods"]}