{"id":14047,"permalink":"http:\/\/www.sailusfood.com\/2012\/10\/02\/kongu-cuisine-recipes-indian-food\/","title":"Indian Food Trail ~ Kongu Cuisine","content":"Kongu Cuisine - Indian Food Trail\r\n\r\nToday we have Indhu (aka Indosungod) of Daily Musings share her insight into everyday Kongu food culture. Daily Musings is run by Indhu, an Indian food blogger based in the US. I like her simplicity, honest writing, well researched and thought provoking articles on our food choices. I am very happy that she is doing a guest post for us. Do visit Indhu's lovely food blog which focuses on the age old customs and food traditions of the Kongu people along with some informative and soul searching articles on food and environment. Dear readers, please give a warm welcome to Indhu.\r\n\r\n~ Sailaja\r\n\r\nKongu cuisine one of the regional cuisines of Tamilnadu can be best explained by talking about areas in Tamilnadu that is called Kongunadu. Today it is the districts of Coimbatore, Erode, Salem, Tirupur, Karur, Namakkal, Krishnagiri and Dharmapuri and bounded by Kerala to the West and Karnataka to the North. Predominantly an agrarian society well served by river Cauvery and its tributaries, every day foods of the people in this region reflect those surroundings - fresh vegetables, greens, poultry, diary and grains.\r\n\r\nI have to remind everyone that the present day food of the Kongu people is probably vastly different than just two generations ago. It is true of my family. While both sets of my grandparents made their living off agriculture, none in my generation call agriculture their profession. So with that in perspective what I am talking about might be considered exotic (or not) in today's younger generation Kongu home.\r\n\r\nI experienced this agrarian village lifestyle firsthand during visits to my grandparents' villages. People of this region eat both vegetarian and non-vegetarian foods. Having my mother's side of the family who were pure vegetarians even eschewing eggs while my dad's side were non-vegetarian giving me exposure to the two sets of food cultures. What I will talk about today is the mix of those lifestyles and food habits. Though both families lived about 30Kms of each other and cooked mostly Kongunadu foods, particular recipes and methods varied.\r\n\r\nEveryday Meals\r\n\r\nFoods grown in the area include coconut, sugarcane, turmeric, mangoes, tomatoesH, rice, tamarind, sesame, peanuts, maize (corn), pearl millet, sorghum, various greens and hence foods incorporated them in the everyday meals. \r\n\r\nAs coconut grows everywhere in this area it is not surprising it plays a predominant role in all meals. Coconut chutney as side for staples like idli and dosai is almost an everyday affair. Tomato based side dishes like chutney and kuzhambu are also common side dishes. Not an everyday breakfast but one of our most favorite breakfast items is this coconut milk based kuzhambu which we call paal curry kuzhambu usually had with dosai. Paniyaram with coconut chutney, sandhavai(string hoppers) with sweetened coconut milk are other popular breakfast items.\r\n\r\nNot as numerous as the coconut, it's cousin the Toddy Palm tree also holds a special place. When we were kids the palm fruits were a delicacy we enjoyed during the summer months. Lack of rainfall and a long time of 50 years to mature and bear fruit has killed them off. They are rare now that they might as well be considered exotic. The sap from the cut flower of this tree is a sweet refreshing drink which we called theluvu (or padaneer) and once fermented becomes toddy. The sugar that is made from the this sap is called (karuppati) and is used as a sweetener in cooking and also as a substitute for sugar. It is also much better than white sugar that it is used by people who suffer from diabetes.\r\n\r\nRice is the staple of the Kongunadu people in this area. Before rice became commonly available and everyone switched to eating it, cumbu (pearl millet), (vella cholam) sorghum, ragi (finger millet) were some of the grains that were regularly used. Seeing these grains in meals today is not as common. Most of these grains are very good alternative to rice and can be cooked like rice or made into dosai. \r\n\r\nEveryday Kongu Thali ~ (anti clockwise) - cabbage poriyal, puli kuzhambu, rasam, uppu paruppu, curd and rice\r\n\r\nA regular Kongu lunch meal is a wonder in its simplicity. Rice with lentils(uppu paruppu) with an accompanying sour curry made with tamarind (puli kuzhambu) or both replaced by a sambhar with a vegetable in season, followed by rasam (pepper water) and finishing off with curd\/yogurt and accompanied by a stir fried vegetable. The dal is cooked with plenty of water which is extracted for making the rasam.\r\n\r\nThe lentils most commonly used are toor, moong (whole or split),split hyacinth beans (mocha paruppu) and horse gram. Cow Peas (thatta payar) kuzhambu cooked with a vegetable like brinjal, bottle gourd or white pumpkin is another common recipe. Horsegram A lentil that is very common in this area but not as much in other parts of Tamilnadu.\r\n\r\nKara Kuzhambu which literally means spicy curry and one that pairs well with the mostly bland lentils is made with roasted and ground spices and finished off with coconut paste. Tamarind pulp is sometimes added to give it a slightly sour taste.\r\n\r\nArisiyum Paruppu Saatham\r\n\r\nI would be committing a grave omission if I miss talking about Arisiyum Paruppu Saatham translates to rice-lentil rice dish. Though it is an everyday quick one pot meal and in this area it is more popular than the other ubiquitous rice dish of India - the biryani. Made with the minimum of spices and has nothing more than onion, garlic and red chilies is one that spells comfort meal for a Kongu in whichever part of the world they are in. Whole green gram, cow peas, fresh hyacinth beans or other vegetables are sometimes added along with the rice and lentil. This rice lentil dish is served with yogurt, vadagam and pickles(made of rice or tapioca and deep fried and are very similar to pappad). It is customary to drizzle ghee over this rice to make it extra tasty.\r\n\r\nCurd or Yogurt is another very important item in any meal. Whatever the combination rice, lentils or lack thereof the meal is always finished off with some thick curd.\r\n\r\nSweets\r\n\r\nMilk being abundantly available from the cows and buffaloes that were grown in the farms lot of milk based sweet dishes were common to the area. My grandmother always made gulab jamuns the old fashioned way reducing the milk till it became thick. Payasams with vermicelli or tapioca pearls were other common festival or special occasion sweet dishes and or sometimes when you just felt like it. \r\n\r\nOpputtu\r\n\r\nThe most common payasam by far was the paruppu payasam made with moong dal, jaggery or palm sugar and coconut milk. Mysore Pak, coconut burfis are other common sweets of the area. The well loved godhumai halwa that is made by extracting the milk of wheat was one of grandma's specialty. The sweet that can be stamped as Kongu is what is called oputtu with the covering made of maida or wheat flour over coconut jaggery mixture. \r\n\r\nNon Vegetarian\r\n\r\nChicken and goat meat based curries, gravies and fries are the common meat dishes of the area. Both chicken and goats were grown in the farm and so was fish which grew in abundance in the wells, ponds and the river. \r\n\r\nThe Kongu way of preparing meat dishes does not include a large amount of spices. It is rustic and is sometimes finished off with coconut paste. Here's a recipe for Kongu style chicken gravy\/fry.\r\n\r\nKongu Chicken Curry\r\n\r\nMore information about Kongu Foods can be found in these articles\r\n1. Kongu Food - Cumbu Dosai\r\n2. Kongu Food - Pulses\r\n3. Kongu Food - Coconut\r\n\r\nListed below are guest posts on different Indian regional cuisines by fellow bloggers.\r\n\r\nMaharastra \r\nA Simple Summer Meal by Nupur of One Hot Stove\r\nTraditional Maharashtrian Thalis - Veg & Non-Veg by Meera of Enjoy Indian Food\r\nTraditional Maharastrian Sweet & Snacks by Meera of Enjoy Indian Food\r\nKonkan Region - North Canara\r\nAn Essay on Konkani Cuisine  by Shilpa of Aayis Recipes\r\nKerala \r\nMunchies from a Kerala home - Shn of Mishmash\r\nA traditional Malabar meal ~ Shaheen of Malabar Spice\r\nUdupi-Mangalore\r\nExploring Udupi Mangalorean Street Foods  by Sia of Monsoon Spice\r\nMangalore\r\nMangalore Cuisine, Mangalore Recipes and Mangalorean Catholic Cuisine by Shireen of Ruchik Randhap\r\nTamil Nadu\r\nTraditional Tamil Tiffins - Lakshmi of Veggie Cuisine\r\nBengal\r\nBengali Cuisine ~ Sandeepa of Bong Mom's Cook Book\r\nHyderabad \r\nHyderabadi Cuisine ~ Mona of Zaiqa","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/10\/kongu-chicken-curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kongu-chicken-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kongu-chicken-curry-300x300.jpg","style":["easy","quick","traditional"],"course":["main-course"],"special-diet":["non-vegetarian","kid friendly","pregnancy"],"cuisine":["kongu"],"cook-time":"40","prep-time":"10","main-ingredient":["chicken"],"serves":"5","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Guest Blogger","Indian Chicken Recipes","Indian Non-Vegetarian Recipes","South Indian Recipes"],"tags":["indian-food","kongu","kongunadu"]}