{"id":14052,"permalink":"http:\/\/www.sailusfood.com\/2012\/09\/18\/appalu-andhra-sweet-recipe\/","title":"Appalu - Ganesh Chaturthi Recipe","content":"Appalu ~ Andhra Style Sweet\r\n\r\nAppalu - Naivedhyam for Lord Ganapati (Vinayaka Chavithi\/Ganesh Chaturthi)\r\n\r\nTomorrow we celebrate Ganesh Chaturthi and I have many of you writing in asking for some traditional festival recipes. I have already blogged a few Ganesh Chaturthi festival recipes like Undrallu, Kudumulu, Paala Undrallu and Biyyam Rava Kudumulu. \r\n\r\nVenna Appalu\r\n\r\nUsually festive meals mean long hours in the kitchen but for Ganesh Chaturthi festival, the cooking seems effortless as most of the traditional recipes hardly take much time to prepare especially today's festival recipe, Venna Appalu. A favorite rice flour based sweet with a crisp exterior and a melt in the mouth soft interior. Each home have their own version of preparing Appalu. The version I am blogging today has only 3 ingredients going into its making and can be prepared in less than 20 minutes. Sweeten your celebrations by offering this traditional Andhra sweet to Lord Ganapati tomorrow. :)\r\n\r\nGanesh Chaturthi Recipe ~ Appalu\r\n\r\nUpdate: This is definitely not a beginner recipe. You will have to make sure that you use only home made rice flour. The instructions on how to prepare rice flour at home is given in the 'Tips' section below. The preparation or mixing of dough needs to be done carefully. It should hold shape and not be too soft or too hard on touch. Adding less ghee will yield a rock like texture to the appalu. Add more ghee will make the dough dissolve in the hot oil. Store bought rice flour will not work for this recipe.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/09\/venna-appalu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/venna-appalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/venna-appalu-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["Andhra"],"cook-time":"15","prep-time":"5","main-ingredient":["rice flour","sugar","ghee"],"serves":"14","author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Flour Recipes","Indian Festivals","Indian Sweets Recipes"],"tags":["appalu","festival_sweets","ganesh-chaturthi"]}