{"id":1406,"permalink":"http:\/\/www.sailusfood.com\/2008\/11\/01\/andhra-snack-pappu-chekkalu-rice-crackers\/","title":"Andhra Snack - Pappu Chekkalu (Rice Crackers)","content":"Pappu Chekkalu, Thattai, Nippattu\r\nWe made Pappu Chekkalu (Thattai, Nippattu, Rice Crackers) and Ribbon Murukku for Diwali. During my early days of messing around in the kitchen I was intimidated to prepare Chekkalu like most first-time nervous cooks trying to prepare traditional foods. Its not easy and certain food preparation does require some experience before they are perfected. I now prepare reasonably good chekkalu. :)\r\n\r\nThere are many variations to prepare chekkalu. Today, I'm sharing the recipe which requires rice flour. For those who are intimidated to prepare them, I'd encourage you to try a small batch following this fool proof recipe which works for me. These lovely savory munchables make a great tea time, travel or entertaining snack. \r\n\r\n\r\nPappu Chekkalu Recipe\r\nPrep & Cooking: 1 hr\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup rice flour\r\n\r\n1 cup water\r\n\r\n3\/4 tsp red chilli pwd or green chilli paste\r\n\r\n1\/4 tsp asafoetida\/inguva\/hing\r\n\r\nsalt to taste\r\n\r\n1 tsp cumin seeds\r\n\r\n1 1\/2 tbsps channa dal (soak in water for an hour and drain)\r\n\r\n1 tsp ghee or butter (optional)\r\n\r\nroughly torn few curry leaves (optional)\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Bring a cup of water to boil. Add salt, red chilli pwd, asafoetida and rice flour and combine. Placee lid and turn of heat. Leave aside to cool.\r\n2 Once cool, add cumin seeds, channa dal and butter to the rice flour mixture and combine well. Test the dough for salt before deep-frying.\r\n3 Heat a wide heavy bottomed vessel with enough oil for deep frying. Take a small lemon sized ball of the dough, place on an oiled plastic sheet or banana leaf and using your fingers shape into a 2\" circle. Use a fork or knife to make small dents all over the chekkalu so that they don't puff up when deep frying. \r\n4 Once the oil is hot, slowly peel the shaped chekkalu off the plastic sheet and slide into the hot oil. Based on the size of vessel and amount of oil, you can deep fry a batch of 5-8 chekkalu. Don't crowd the vessel with too many chekkalu. Reduce flame to medium and deep fry the chekkalu to a golden colour. Remember the frying has to be done on medium flame to achieve that golden color and crispness.\r\n5 When the chekkalu turn a golden color use a slotted ladle to remove onto an absorbent paper and cool. Repeat the same process till the rest of the dough is done. Cool completely before storing in an air tight metallic container.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/11\/pappu-chekkalu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pappu-chekkalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pappu-chekkalu-300x300.jpg","main-ingredient":["rice flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Festival Foods","Flour Recipes"],"tags":["chekkalu"]}