{"id":14091,"permalink":"http:\/\/www.sailusfood.com\/2012\/11\/08\/shahi-tukda-diwali-sweets\/","title":"Shahi Tukda - 7th Blog Birthday","content":"Shahi Tukda ~ Diwali Sweets \r\n\r\nShahi Tukda\r\n\r\nToday, Sailu's Kitchen has completed 7 years. I find it hard to believe that I have been blogging since 7 years. Time sure flies fast. :) Dear readers, thank you from the bottom of my heart for your good wishes and encouragement. Without your support, there is no way I could have come along these 7 years. I am humbled by your love and ever grateful for your kind comments and positive feedback on the recipes posted here. I hope to blog on a more regular basis and bring to you many more recipes in the coming years. \r\n\r\nFor the blog's 6th birthday, there was an Apron giveaway where 4 lucky readers had each won a Kalamkari Apron. For the 7th blog anniversary, I have a gift for each one of you, dear readers. You all deserve it. I am offering a FREE Ebook, 'The Best of Sailu's Kitchen' that has 27 all time popular recipes with photos. \r\n\r\nTo download the free recipes Ebook, you need to enter your name and email address in the form below. You will be taken to the download link of the Ebook 'The Best of Sailu's Kitchen'.\r\n\r\nLoading...\r\n\r\nMy blog birthday calls for celebration and with Diwali around the corner, I am posting Shahi Tukda so that you can make it as part of your Diwali sweets platter. Whenever I have any left over bread, I tend to make garlic croutons, bread crumbs or bread upma. If my family is in a mood for a dessert, I make Bread Halwa which can be prepared in less than 30 minutes.  \r\n\r\nShahi Tukra ~ Diwali Special\r\n\r\nShahi Tukda, is a rich Hyderabadi dessert recipe that is prepared using bread. The authentic version of Shahi Tukda, calls for use of full fat milk and deep frying the bread in ghee (clarified butter) till a deep golden brown shade is achieved. I did not deep fry the bread slices (hence lighter colored bread) and chose to toast it on a pan drizzled with a generous amount of ghee. I have used low fat milk and hence you will not find a rabri (thickened milk) like consistency. It tastes as good as the deep fried version, due to the cardamom and saffron infused thickened milk that is poured over the toasted bread and garnished with toasted dried fruit and nuts. So are you going to make Shahi Tukda this Diwali? :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/11\/shahi-tukra-simple-sweet-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/shahi-tukra-simple-sweet-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/shahi-tukra-simple-sweet-recipe-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","vegetarian","kid friendly","pregnancy"],"cuisine":["hyderabadi"],"cook-time":"30","prep-time":"10","main-ingredient":["bread","sugar","milk"],"serves":"3","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Hyderabadi Recipes","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["diwali","festival","festival_sweets","shahi-tukda"]}