{"id":14121,"permalink":"http:\/\/www.sailusfood.com\/2012\/11\/16\/idiyappam-recipe-healthy-breakfast\/","title":"Idiyappam with Egg Curry","content":"Idiyappam with Kerala Egg curry\r\n\r\nIdiyappam\r\n\r\nI cannot say enough about the cuisine of Kerala, God's own country. I absolutely relish the traditional food recipes of Kerala especially their breakfast fare like Idiyappam, Puttu and Appam. I was fortunate to taste authentic cuisine of Kerala on many a occasion. A more recent one was during our home stay with a very warm and hospitable family in Wayanad and Kochi. I learnt how to make a few Kerala style recipes that I have since been preparing for my family. I am planning on doing a series on the traditional cuisine of Kerala for my dear readers. I hope readers of Sailu's Kitchen, who belong to Kerala, provide me with inputs and feedback on the traditional food recipes that I post here and support me in my culinary journey through Kerala. :)\r\n\r\nKerala food is healthy, quick to make with minimal ingredients, at least a majority of traditional food that I have learnt to make. One such Kerala style dish for breakfast is Idiyappam aka String Hoppers. It is also served during dinner time and is made with roasted rice flour, ghee or oil and grated coconut. Idiyappam is usually served with a variety of side dishes like peas curry, vegetable kurma, chicken stew, egg or chicken curry. Another popular way to serve Idiyappam is with a dollop of ghee, grated coconut and sugar or with sweetened coconut milk. This combination is popular among children.  \r\n\r\nIdiyappam maker (before steaming idiyappam)\r\n\r\nThe preparation process appears daunting but is pretty simple when you get down to making it. The key is to get the right consistency of the rice flour dough. A traditional Idiyappam maker is an essential tool to prepare it. I picked up an Idiyappam maker\/press and plates in Wayanad. The plates are not essential if you have Idli plates. The Idiyappam maker is similar to a murukku press or janthikalu gottam. The rice flour dough is hand pressed through the maker into noodle thin swirls onto a greased plate and steamed like idlis. In Kerala, Idiyappam rice flour is easily available unlike in other states where its difficult to find. You can buy rice flour and dry roast it for 7-8 minutes on low flame and use it. I used home made rice flour and served Idiyappam with Kerala Egg Curry, the recipe of which I will post tomorrow.\r\n\r\nIdiyappam ~ Cuisine of Kerala\r\n\r\nSo how about making this healthy and tasty Kerala dish for breakfast tomorrow? :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/11\/idiyappam.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idiyappam-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idiyappam-300x300.jpg","style":["easy","traditional"],"course":["breakfast"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["Kerala"],"cook-time":"15","prep-time":"30","main-ingredient":["rice flour"],"serves":"5","goes-well-with":["curry","stew"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Indian Breakfast Recipes","Kerala Recipes","South Indian Recipes"]}