{"id":14177,"permalink":"http:\/\/www.sailusfood.com\/2012\/12\/11\/anglo-indian-meatball-curry-recipe\/","title":"Anglo Indian Meatball Curry","content":"Meatball Curry ~ Anglo Indian Food\r\n\r\nCoconut rice with Meatball curry\r\n\r\nToday's Meatball curry is an classic Anglo Indian food recipe that I learnt from my friend's mother many years ago. \r\n\r\nVizag has a large Anglo Indian community and their contribution to our educational institutions is significant. Many Anglo Indians teachers taught me during my initial school going years and also have few close friends. One of my Anglo Indian friend's mother was a seamstress par excellence who sewed the most elegant evening gowns and dresses. I was fortunate to have got a few dresses stitched by her during my college days. She could give most of the famous fashion designers a run for their money. :)\r\n\r\nAnglo Indians are a lively lot, full of fun and cheer with a love for good food. I cannot forget their Christmas eve festive spreads with mouth watering delicacies which included steamed pudding, plum cake, home made wine, kalkals, cookies, marzipan and baked casseroles and many many more.\r\n\r\nMutton Kheema Balls ready to be cooked\r\n\r\nAges ago, I relished Meatball curry with saffron flavored coconut rice as part of a festive meal at a very dear friend's home. A simple Mutton Kheema recipe with minimal spices yet so flavorful. With the Christmas season upon us, I thought its the best time to post Meatballs curry recipe. Meatballs aka koftas, are minced meat balls flavored with green chilies and coriander, that are slow cooked in a spiced gravy. The meatballs are tender, moist, and flavorful in a perfectly spiced tomato based curry. The meatball curry is usually served with aromatic coconut rice. A perfect meal on a cold winter day!\r\n\r\nAnglo Indian Meatball Curry\r\n\r\nPreparing coconut rice is simple. Heat 1 1\/2 tbsps of butter or ghee in a cooking vessel, add 2 cloves, 2 cardamoms, an inch of cinnamon stick and allow to crackle. Add 2 cups of rice and saute on low flame for 2 mts. Add 3 cups of thick coconut milk, 1 cup of water, salt and 1\/4 tsp of turmeric powder or 4 to 5 strands of saffron and mix. Bring to a boil. Reduce flame and place lid. Cook till the rice is done.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/12\/meatball-curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/meatball-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/meatball-curry-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy free","nut free","gluten free","non vegetarian","kid friendly","pregnancy"],"cuisine":["anglo indian"],"cook-time":"45","prep-time":"30","main-ingredient":["mutton kheema"],"serves":"5","goes-well-with":["coconut rice"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes"],"tags":["kheema","meatball-curry","meatballs","mutton"]}