{"id":14207,"permalink":"http:\/\/www.sailusfood.com\/2012\/12\/25\/cake-pops-recipe\/","title":"Cake Pops","content":"Cake Pops\r\n\r\nChocolate Cake Pops\r\n\r\nMerry Christmas to all of my wonderful readers, family and friends. Wishing you all a very happy holiday season! Last week, I baked a batch of Vanilla cupcakes with Nutella frosting and decorated them with Christmas fondant\/sugar paste toppers for Nehal and his friends.\r\n\r\nChristmas Fondant Toppers\r\n\r\nLast week, I also prepared a simple dessert for kids with the left over chocolate mud cake chocolate buttercream frosting that was sitting in the fridge. A piece of cake on a stick, 'Cake Pops'. I drew inspiration from the queen of cake pops - Bakerella. Do visit her website, if you haven't yet, for lots of cake pop inspiration, gorgeous photos and techniques on decorating.  \r\n\r\nCake Pops dipped in Chocolate\r\n\r\nIf you have some left over cake on hand, this kid friendly simple dessert is a breeze to make. Crumble the cake, mix in frosting of your choice to bind the cake crumbs. Make small balls of the cake dough, pierce a lollipop stick at one end of the cake ball and dip it in melted chocolate. You can further top it with sprinkles or decorate as you fancy.  I tried to give a touch of Christmas to the cake balls and make them attractive for my son. So how about a perfect bite on a stick? :)\r\n\r\nCake Pops ~ Simple Dessert for Kids","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/12\/chocolate-cake-pops.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-cake-pops-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-cake-pops-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["egg","dairy","nut free","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"5","prep-time":"90","main-ingredient":["cake","chocolate"],"serves":"20","author":null,"type":"post","categories":["All Recipes","Cake Recipes","Sweet Dessert Recipes"],"tags":["cake","cake-pops","chocolate"]}