{"id":14223,"permalink":"http:\/\/www.sailusfood.com\/2012\/12\/30\/puttu-recipe-kerala-food\/","title":"Puttu ","content":"Puttu\r\n\r\nPuttu Kadala Curry\r\n\r\nKerala food at its best! Puttu aka rice steamed cake is Kerala's traditional breakfast that is usually served with Kadala (black chickpeas\/kala chana) curry or moong dal curry. It is also relished with ripe banana, jackfruit or fish curry. Puttu recipe calls for the use of coarsely ground rice flour and grated coconut. It is steamed in a metal puttu maker (a steamer in cylindrical or dome shape) though it can also be prepared with Idli plates or a coconut shell and steamed in a pressure cooker. Though traditionally prepared with rice flour, it can also be prepared with wheat flour, ragi (horsegram), oats or couscous.\r\n\r\nPuttu Maker ~ Puttu Powder\r\n\r\nThe key to soft puttu lies in the moisture content of the rice flour. You should not add too much or too less water. I found that adding almost 2\/3 rd cup of water to two cups of rice flour works good for me. Many suggest using 1\/2 cup of water though. When you take a fistful of rice flour and close your fist, it should take the shape of your fist as shown in the picture above. This is the right consistency of the rice flour and its ready to be steamed.\r\n\r\nRice flour can be prepared at home. Soak rice for 1-2 hours, drain the water and dry the rice on a cloth. Once dry, grind to a coarse powder. Roast this coarse rice flour on low flame for 4-5 minutes (mixing continuously) or till it is moisture free and slips off the ladle. Spread this powder on a plate and leave aside for a few minutes before storing it in an airtight container for 2 to 3 weeks. \r\n\r\nEgg Masala Puttu ~ Kerala Food\r\n\r\nAlong with the traditional style Puttu I also prepared an egg masala based one. In addition to grated coconut, a layer of scrambled egg masala is added to the mould before adding the puttu mix into the mould before being steamed. You can add kheema or minced chicken as well. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2012\/12\/puttu-kadala-curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puttu-kadala-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puttu-kadala-curry-300x300.jpg","style":["easy","traditional"],"course":["breakfast"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["kerala"],"cook-time":"15","prep-time":"20","main-ingredient":["rice flour"],"serves":"5","goes-well-with":["kadala curry"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Kerala Recipes"],"tags":["kerala","kerala-food","puttu"]}