{"id":14234,"permalink":"http:\/\/www.sailusfood.com\/2013\/01\/01\/red-velvet-cake-recipe\/","title":"Red Velvet Cake","content":"Red Velvet Cake Recipe\r\n\r\nRed Velvet Cake for New Year's Eve\r\n\r\nI hope you are enjoying your holidays and had a fabulous start to the New Year. I wish each and every reader of Sailu's Kitchen a very happy, healthy, safe and fruitful 2013. Happy New Year, dear readers! Let's usher in the New year with a colorful, indulgent dessert. Dear readers, I have for you Red Velvet Cake recipe with cream cheese frosting.\r\n\r\nRed Velvet Cupcakes\r\n\r\nThe only downside of the red velvet cake recipe is the copious amount of red food coloring that is used to achieve the red color of the cake. Moist,  incredible flavor combination with cream cheese frosting, red velvet cake is melt in the mouth delicious. The cake pairs beautifully with cream cheese frosting where the tartness balances out the sweet flavor of the cake. The recipe below yields four 7\" round cakes. I made three 7\" round cakes and used the remaining batter to make cupcakes. \r\n\r\nRed Velvet Cake with Cream cheese frosting\r\n\r\nIf you have never made a red velvet cake before, I'd suggest you start with this recipe. Serve your family and friends this impressive dessert and you are sure to floor them. :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/01\/red-velvet-cake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/red-velvet-cake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/red-velvet-cake-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["egg","dairy","nut free","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"45","prep-time":"15","main-ingredient":["flour","cream cheese"],"serves":"10","goes-well-with":["cream cheese frosting"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes","Sweet Dessert Recipes"],"tags":["dessert","red velvet cake"]}