{"id":14252,"permalink":"http:\/\/www.sailusfood.com\/2013\/01\/14\/sankranti-traditional-festive-meal\/","title":"Sankranti ~ Traditional Festive Meal","content":"Sankranti Festive Meal\r\n\r\nSankranti Subhakankshalu! Wishing all my dear readers and friends who are celebrating, a very happy and prosperous Makar Sankrathi.\r\n\r\nMost native Andhra homes celebrate the most auspicious Thanksgiving festival, Sankranti with traditional festive foods like Kalagaya kura, Kalagaya Pulusu, Ariselu, Bobbatlu and Teepi Punugulu. Each region and each home have their own versions of festive preparations. Whatever the custom, you can be assured that each home will prepare a special dish to usher in the harvest season and offer thanks to nature, the sacred cow and beloved ancestors. \r\n\r\nThe newly harvested rice is cooked and offered as neivedhyam to the Gods. By and large, Kalagaya kura aka mixed vegetable curry is a common traditional Sankranti preparation including Kalagaya Pulusu aka Teepi Pulusu, mixed vegetables cooked in jaggery and tamarind. The sweet dishes might differ based on the customs followed by each home like Boorelu, Ariselu, Kajjikayalu, Bobbatulu, Sunnundalu etc. \r\n\r\nTwo loyal readers of Sailu's Kitchen, who are based abroad, have requested me to post recipes of Kalagaya Kura and Teepi Pulusu. For the benefit of all those readers who are very far away from home and do not know how to prepare the traditional 'Pedda Panduga' (the other name given to Sankranti in our parts) delicacies, I am posting traditional special recipes of Sankranti.\r\n\r\nMixed Vegetables (Red Pumpkin, Brinjal, Drumsticks, Raw Plantains, Sweet Potato, Colocasia, Indian Broad beans and Yam)\r\n\r\nKalagaya Kura ~ Mixed Vegetable Curry\r\n\r\nMukkala Pulusu ~ Mixed Vegetable Stew\r\n\r\nTeepi Punugulu ~ Sweet Fritters\r\n\r\nTraditional Andhra Pedda Panduga Bhojanam ~ White rice with roasted and cooked yellow moong dal, Kalagaya kura, Kalagaya Pulusu, Paramannam, Teepi Punugulu and Perugu (curd)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/01\/sankranti-vantalu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sankranti-vantalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sankranti-vantalu-300x300.jpg","style":["easy","quick","traditional"],"course":["main-course"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"40","prep-time":"15","main-ingredient":["mixed vegetables"],"serves":"6","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Festivals","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["panduga","sankranti","vantalu"]}