{"id":1426,"permalink":"http:\/\/www.sailusfood.com\/2008\/11\/12\/aloo-methi-tamatar-subzi\/","title":"Aloo Methi Tamatar Subzi","content":"\r\n\r\nMethi is a favorite green that I use way too much in my daily cooking. :) I drop these leaves by the fistful into a pot of simmering soup, khichidi, dalia (porridge) or even a vermicilli upma. It gives great flavor and brings with it a whole lot of nutrition. \r\n\r\nMost North Indian recipes that I prepare were learnt from a friend's mother who hails from Delhi and cooks the best aloo gobi and aloo paranthas and its no exaggeration. :) Today's recipe is also from her which is one of the numerous versions of alu methi she prepares. This recipe calls for the addition of tomatoes and goes great with rotis but I like it with rice also. \r\n\r\n\r\nAloo Methi Tamatar Subzi Recipe\r\nPreparation: 30 mts\r\nServes 3-4 persons\r\nCuisine: North Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n3 potatoes, peeled, boiled and cubed\r\n\r\n1 tomato, finely chopped\r\n\r\n1 cup packed fresh methi leaves, add little salt and sugar and leave aside for few mts\r\n\r\n1 small onion, finely chopped (optional)\r\n\r\n1 tsp grated ginger\r\n\r\nbig pinch of asafoetida\/hing\/inguvva (optional)\r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\ngaram masala pwd (2 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil \r\n\r\n\r\n\r\n1 Add big pinch salt + big pinch sugar to the methi leaves and let it rest for a few mts. Squeeze excess water from methi and keep aside.\r\n2 Heat ghee or oil in a vessel, add the grated ginger, asafoetida, coriander pwd, turmeric pwd, red chilli pwd and a tbsp of water and saute for a few seconds. Add the chopped tomatoes and cook till soft. Add salt and combine.\r\n3 Add the boiled potatoes and combine. Place lid and cook for 6-7 mts. Add the methi leaves and combine. Cook till the leaves wilt. (This is a dry saute dish)\r\n4 Add garam masala pwd and combine well. Turn off heat and serve hot with rotis\/paranthas or hot rice. \r\n\r\nNote:If using onion for this recipe, add grated ginger, asafoetida and saute for a few seconds. Add the onions and saute for a few mts. Add the spice pwds and then add the tomatoes and follow the rest of the procedure.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/11\/methi_aloo_subzi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi_aloo_subzi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi_aloo_subzi-300x300.jpg","main-ingredient":["potatoes","tomatoes"],"author":null,"type":"post","categories":["All Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["aloo","methi","subzi"]}