{"id":14309,"permalink":"http:\/\/www.sailusfood.com\/2013\/03\/20\/keema-matar-non-veg-recipes\/","title":"Keema Matar","content":"Keema Matar\r\n\r\nKeema Matar\r\n\r\nA classic North Indian non veg recipe using mincemeat (lamb) and fresh green peas, Keema Matar, is a popular dish in our home and among friends. It is a much requested dish for pot lucks. Mincemeat (lamb) works best though you could use chicken or beef in its place. I always make the curry with lamb aka keema. I froze a kilo of green peas that I bought last month towards the end of the winter season since I like to add them to most korma style dishes or to prepare peas paratha or Keema Matar, both of which are favorites in our home.\r\n\r\nMincemeat and green peas make for a good combination and when simmered with aromatic spices like cinnamon, cloves and cardamom, the curry is bound to be delicious. A straight forward simple recipe and a quick dish to prepare provided you use a pressure cooker. It can be slow cooked over stove top too which is much more flavorful compared to the pressure cooker method. Potatoes can also be added along with fresh green peas. I usually serve Keema Matar with a flavored rice dish, naan or phulka. Use the left over curry to make sandwiches for breakfast the next day. :)\r\n\r\nMincemeat green peas curry\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/03\/keema-matar.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/keema-matar-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/keema-matar-300x300.jpg","style":["easy","modern"],"course":["main-course"],"special-diet":["eggless","gluten free","nut free","non vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"45","prep-time":"10","main-ingredient":["mincemeat","green peas"],"serves":"4","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes","North Indian Recipes"],"tags":["kheema-matar","mincemeat","non-veg"]}