{"id":1432,"permalink":"http:\/\/www.sailusfood.com\/2008\/11\/16\/sukhi-sabzis-aloo-gobhi\/","title":"Sukhi Sabzis ~ Aloo Gobhi","content":"Aloo Gobi Sabzi\r\n\r\nAloo Gobhi, a classic North Indian dry saute is a subzi to die for! Being a cauliflower and potato fan, Aloo Gobhi has to be a favorite. Rotis with spiced Aloo Gobhi is a regular dinner fare during winters.  Learnt it from my friend's mother who makes delicious Aloo Gobhi. There is something about the aroma of spices that go into the tadka (tempering) of North Indian cooking that makes me hungry. Typical North Indian tadka is cumin seeds, asafoetida and spice powders like turmeric, red chilli and coriander , followed by vegetables. The aroma is simply enticing. :)\r\n\r\nPhulka with Aloo Gobhi and Salad \r\n\r\nMarket is flooded with cauliflowers these days and is very reasonably priced. Usually buy two big cauliflowers, clean and cut into florets and store in a ziplock bag. I blanch the florets in salted boiling water for atleast 6-8 mts before preparing any curry or dry saute. There are a few variations of Aloo Gobhi and the recipe I'm posting today is sans onions and the spices bring out the natural flavors of the vegetables beautifully.\r\n\r\n\r\nSukhi Aloo Gobhi Sabzi Recipe\r\nPrep & Cooking: 40-45 mts\r\nServes 4-5 persons\r\nCuisine: North Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 large potatoes, peeled and cubed\r\n\r\n2 cups cauliflower, cut into florets, blanched in hot salt water, drained \r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1 tsp grated ginger\r\n\r\nbig pinch of asafoetida\/hing\/inguvva \r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n3\/4 tbsp coriander pwd\r\n\r\ngaram masala pwd (1 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\npinch of amchur pwd (dry mango pwd) (optional)\r\n\r\nsalt to taste\r\n\r\ncoriander leaves for garnish\r\n\r\n1 1\/2 tbsps oil \r\n\r\n\r\n\r\n1 Bring water to a boil in a vessel, add salt, cauliflower florets and let it cook for 7-8 mts on low to medium flame. Turn of heat and drain. Keep aside.\r\n2 Heat oil in a vessel, add the grated ginger, asafoetida, coriander pwd, turmeric pwd, red chilli pwd and 2 tbsps of water and saute for 20-30 seconds. Add the blanched gobhi and salt. Cover with lid and cook on medium flame for 4-5 mts.\r\n3 Add the cubed aloo and combine. Place lid and cook for 25 mts. Combine in between every 7-8 mts by tossing. (This is a dry saute dish)\r\n4 Add garam masala pwd and amchur pwd mix well. Cook with out lid for another 2 mts and turn off heat. Garnish with coriander leaves and place lid and let it rest for a few mts before serving. Serve hot aloo gobhi with phulkas, paranthas or puris. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/11\/aloo-gobi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aloo-gobi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aloo-gobi-300x300.jpg","main-ingredient":["potato","cauliflower"],"author":null,"type":"post","categories":["All Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["aloo","gobhi"]}