{"id":14331,"permalink":"http:\/\/www.sailusfood.com\/2013\/04\/16\/recipe-for-lasagna-italian-pasta\/","title":"Lasagna","content":"Recipe for Lasagna\r\n\r\nRecipe for Lasagna\r\n\r\nOur family relishes Italian food especially Lasagna. Today, I am posting the recipe for lasagna using oven ready lasagna sheets (noodles), ricotta cheese, spiced minced meat, mozzarella and parmesan cheese. I prepare lasagna using oven ready lasagna sheets that my sister very lovingly brings me from the US along with a horde of hard-to-find ingredients (in India). :) \r\n\r\nLasagna with Ricotta cheese\r\n\r\nIt does take some time to prepare lasagna but its worth the effort. While preparing lasagna or any type of pasta recipe, I try to stay close to authentic Italian pasta recipes. Sometimes the lack of an ingredient calls for substitution which does not alter the original flavor drastically. Sourcing ricotta cheese is difficult in my part of the world hence I resort to preparing it at home. Of course, it does not come close to the flavor of authentic Italian ricotta cheese but its a substitute. The preparation for lasagna begins the previous day with the making of ricotta cheese. I usually make this a day ahead so that the flavors meld in the fridge. You can find the recipe for homemade ricotta cheese in the 'Tips' below. I used Amul mozzarella cheese which is easily available in most grocery stores. You will find parmesan cheese in speciality gourmet stores. If you cannot find parmesan cheese, you can substitute with grated Amul cheese. I hope you enjoy making this recipe for lasagna which always gets 5 stars from family and friends. \r\n\r\n{Follow me on Sailu}","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/04\/recipe-for-lasagna.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/recipe-for-lasagna-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/recipe-for-lasagna-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","nut free","non vegetarian","kid friendly","pregnancy"],"cuisine":["ialian"],"cook-time":"45","prep-time":"60","main-ingredient":["lasagna noodles","ricotta cheese"],"serves":"6","goes-well-with":["garlic bread"],"author":null,"type":"post","categories":["All Recipes","Easy Pasta Recipes","Lunch Box Recipes"],"tags":["italian-pasta","lasagna","ricotta-cheese"]}