{"id":14342,"permalink":"http:\/\/www.sailusfood.com\/2013\/04\/12\/homemade-chocolate-recipe\/","title":"Homemade Chocolate","content":"Homemade Chocolate\r\n\r\nHomemade Chocolates\r\n\r\nHave you tried making chocolate at home? Yes, I'm talking about homemade chocolate! Making chocolate at home is not a tedious process as many assume. There are many methods to make this chocolate recipe but the one which works great for me is the sugar syrup method. Preparing the sugar syrup to one string consistency is crucial to a successful batch of homemade chocolate. \r\n\r\nMilk powder and cocoa powder are the other important ingredients that go into the making of homemade chocolate. One can add different flavors like chocolate essence, vanilla essence, cinnamon or espresso. I have not added any nuts or flavors. Crushed pistachios, pecans or almonds make for a good choice. Alternately, you can roll the finished chocolate in desiccated coconut or colored sprinkles. During festivals like Diwali and Christmas, homemade chocolates make for excellent edible gifts. Wrap the chocolates in pretty colored papers and gift them to family, friends or your Valentine. :)\r\n\r\nHome made Chocolate\r\n\r\nNext time you crave chocolate, stop rushing to your nearby store to pick up your favorite bar and instead make your own homemade chocolate.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/04\/homemade-chocolate.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/homemade-chocolate-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/homemade-chocolate-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"5","prep-time":"5","main-ingredient":["milk powder","condensed milk"],"serves":"8","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Sweet Dessert Recipes"],"tags":["chocolate","homemade-chocolate"]}