{"id":14346,"permalink":"http:\/\/www.sailusfood.com\/2013\/04\/15\/roasted-red-pepper-hummus-recipe\/","title":"Roasted Red Pepper Hummus","content":"Roasted Red Pepper Hummus\r\n\r\nRoasted Red Bell Pepper Hummus\r\n\r\nThere is no dearth of healthy vegetarian recipes that are nutritious, easy to prepare and delicious. I use farm fresh vegetables in my daily cooking and try to incorporate low fat cooking techniques as much as possible. Roasted red pepper hummus falls under the category of healthy vegetarian recipes, one that is low fat, easy to make and not to mention, delicious.\r\n\r\nRoasted red pepper hummus is a twist to the traditional Middle Eastern classic recipe, 'Hummus'. The roasted red peppers give a beautiful orange color to the hummus and lend a sweet and smoky flavor to the hummus. Tahini aka sesame seeds paste, chickpeas, garlic, lemon juice and olive oil are the key components of the basic hummus recipe. Try to avoid using store bought canned beans or tahini paste as nothing beats home made hummus made from scratch. Freshly ground roasted cumin powder adds depth to the hummus. You can tweak the spices to suit your palate. \r\n\r\nServe the creamy textured and vibrant colored roasted red pepper hummus with pita bread\/naan or as a dip with tortilla chips or fresh raw vegetables like cucumber, bell peppers, celery stick and carrots. A healthy appetizer or snack that you will be making again and again. :)\r\n\r\nRoasted Red Pepper Hummus\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/04\/roasted-red-pepper-hummus.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/roasted-red-pepper-hummus-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/roasted-red-pepper-hummus-300x300.jpg","style":["easy","quick","modern"],"course":["side"],"special-diet":["eggless","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["middle eastern"],"cook-time":"15","prep-time":"20","main-ingredient":["red bell pepper","chickpeas"],"serves":"4","goes-well-with":["vegetables"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Middle Eastern Recipes","Recipes Vegetable Dishes"],"tags":["healthy-recipe","hummus","red bell pepper"]}