{"id":14369,"permalink":"http:\/\/www.sailusfood.com\/2013\/04\/26\/jackfruit-biryani-recipe-kathal-panasa\/","title":"Jackfruit Biryani","content":"Jackfruit Biryani\r\n\r\nJackfruit Biryani (Kathal Biryani)\r\n\r\nThere are quite a few Indian regional cuisines that boast of vegetarian delicacies featuring raw jackfruit and one such culinary gem is Jackfruit Biryani or Kathal Biryani. \r\n\r\nTender raw jackfruit, called Panasakaya in Telugu and Kathal in Hindi, is an exotic vegetable in India and is considered as vegetarian meat because of its meat like texture and flavor. The tender jackfruit is used to prepare curries and biryani while the semi-ripe fruit is used to prepare chips. The fully ripe jackfruit is devoured as a fruit and is also used to prepare desserts. The seeds of the jackfruit are edible and usually boiled or roasted over hot coal and eaten.\r\n\r\nFresh tender jackfruit is available in our farmer's market. Bought some recently and prepared Jackfruit Biryani over the weekend. This unusual yet exotic rice dish is a vegetarian's delight. The chunks of marinated jackfruit are well cooked under dum until fork tender and literally melt in the mouth. Follow the recipe for Hyderabadi Chicken Dum Biryani and replace the chicken with boiled tender jackfruit pieces. Do not make this recipe without mint as it provides the freshness and aroma to the biryani. Serve the Jackfruit biryani with Korma and raita. Utterly delicious meal for that special occasion and one that is irresistible to both kids and adults alike!","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/04\/kathal-biryani.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kathal-biryani-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kathal-biryani-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"45","prep-time":"30","main-ingredient":["raw jackfruit","basmati rice"],"serves":"8","goes-well-with":["raita"],"author":null,"type":"post","categories":["All Recipes","Indian Rice recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["biryani","jackfruit","kathal","panasa"]}