{"id":1437,"permalink":"http:\/\/www.sailusfood.com\/2009\/02\/24\/how-to-make-ginger-garlic-paste\/","title":"How To ~ Make Ginger Garlic Paste","content":"I spent the weekend sifting through readers comments seeking kitchen tips and recipe requests. Quite a few requests are 'how to' type questions like how to make soft pulkas or how to cook rice. This got me to start a 'How To' series on basics of Indian cooking. I am not an expert but would like to share my kitchen experiences and what works for me. \r\n\r\nI am starting the 'How To' series with 'ginger garlic paste' that is indispensable to the Indian kitchen. Usually we prepare ginger garlic paste enough to last a month. \r\n\r\nGinger garlic paste ~ Allam Velluli Mudda\r\nHow to make ginger garlic paste (allam velluli mudda)?\r\n\r\nTake 1 cup of peeled and sliced ginger root and 3\/4 cup of peeled and sliced garlic. Add 1\/4 tsp turmeric pwd, 3\/4 tsp salt and blend to make a smooth paste. I don't add any water but you can add a tbsp of water. Store in a moisture free bottle, place a spoon, close the lid tight and refrigerate. You can freeze ginger garlic paste for months (to store beyond a month, add a tbsp of vinegar and a tbsp of olive oil (that has been warmed and cooled) or any oil to the above proportions).\r\n\r\nPeeled and sliced ginger garlic\r\n\r\nNote: You can add equal quantity of ginger and garlic. I personally prefer to use less garlic.\r\n\r\nHow do you make your ginger garlic paste? \r\n\r\nHow to articles:\r\nHow to make butter and ghee - photo tutorial\r\nHow to make rava dosa - photo tutorial\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/11\/ginger-garlic-paste.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ginger-garlic-paste-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ginger-garlic-paste-300x300.jpg","main-ingredient":["ginger","garlic"],"author":null,"type":"post","categories":["All Recipes","How To Cook"],"tags":["garlic","ginger"]}