{"id":14370,"permalink":"http:\/\/www.sailusfood.com\/2013\/04\/25\/aam-panna-recipe-summer-drink\/","title":"Aam Panna ~ Raw Mango Drink","content":"Aam Panna - Raw Mango Drink\r\n\r\nAam Panna\r\n\r\nAam Panna is a rejuvenating and refreshing cooler prepared using raw green mangoes during the hot summer months when mangoes are in season. This sweet and sour summer drink, also known as Kairi Panha works as a digestive and is hard to resist due to its unbeatable flavor and health benefits.\r\n\r\nWith two mango trees in our backyard garden we are armed with a huge haul of raw mangoes each season. A large batch of mangoes are allowed to ripen while the rest are used to make large jars of sweet and hot pickles, juice, squash, desserts and quite a few are gifted to family and friends. While mango picking some of the mangoes get slightly bruised and cannot be used to make pickles. We use these slightly bruised mangoes to make mango pulp that is frozen while some are peeled, sliced and sun dried to make Amchur powder (raw mango powder).\r\n\r\nUsually we pressure cook raw mangoes, remove the pulp, grind to a paste, store in a clean container and freeze it. Aam Panna is easy to make provided you have the pulp on hand. I personally like the flavor of mint leaves, black salt and roasted cumin powder in Aam Panna but you could try another variation by replacing them with fennel seed powder or nutmeg and cardamom powder.\r\n\r\nAam ka Panna","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/04\/aam-panna.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aam-panna-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aam-panna-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"15","prep-time":"30","main-ingredient":["raw mango","cumin"],"serves":"5","author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Maharashtrian Recipes"],"tags":["aam","aam-panna","mango"]}