{"id":14392,"permalink":"http:\/\/www.sailusfood.com\/2013\/05\/26\/no-bake-chocolate-cheesecake-recipe\/","title":"No Bake Chocolate Cheesecake","content":"No Bake Chocolate Cheesecake\r\n\r\nNo Bake Chocolate Cheesecake\r\n\r\nNo Bake Chocolate Cheesecake is an absolutely delightful dessert that is simply out of world, irresistible and addictive. Chocolate and cheesecake are a match made in heaven. It is a 3 layer decadent cheesecake: biscuit crust, luscious cheesecake and chocolate ganache. The cheesecake and chocolate ganache gives a smooth and creamy mouth feel while the biscuit base provides a contrasting crunchy texture. All you need is to prepare the biscuit base, whip up the cheese cheese with sugar and whipping cream, prepare the chocolate ganache and chill to set. The sweetness is perfectly balanced with the sourness of the cream cheese. A gem among easy dessert recipes, this crowd pleasing, summer treat will have your family and friends swoon in delight. :)\r\n\r\nI'd suggest you make this recipe using Philadelphia cream cheese or Britannia cream cheese but you could use home made hung yogurt as a substitute if you cannot source cream cheese. To prepare hung yogurt, take two cups of yogurt\/curd and place it in a sieve for a couple of hours to let the water drain. Use the water to knead chapati dough and use the hung curd in place of cream cheese. The original recipe called for digestive biscuits which I substituted with Britannia Marie biscuits.\r\n\r\nChocolate Cheesecake","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/05\/chocolate-cheesecake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-cheesecake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-cheesecake-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"5","prep-time":"30","main-ingredient":["chocolate","cream cheese"],"serves":"8","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Sweet Dessert Recipes"],"tags":["cheesecake","chocolate"]}