{"id":14402,"permalink":"http:\/\/www.sailusfood.com\/2013\/06\/06\/rajma-masala-recipe\/","title":"Rajma Masala","content":"Rajma Masala\r\n\r\nRajma Masala with steamed rice\r\n\r\nRajma Masala is a typical Punjabi style recipe that I have been trying to improvize on since years. Having tasted it at quite a few Punjabi friends homes (read school\/college friends), langar at gurudwara as well as the roadside Punjabi dhabas, I try my best to replicate the same flavor at home. It never tasted the same in any of the places I tried. Each home (or dhaba or restaurant) has its own style of preparation. While the basic onion-ginger-garlic-tomato base is the same, it is the garam masala powder that makes all the difference. \r\n\r\nI have had some success with today's recipe which is almost close to the authentic Punjabi Rajma Masala recipe. I have already blogged the recipe for Rajma Masala with Jeera Pulao and today's version is slightly different in terms of the garam masala used. This delicious protein rich red kidney beans curry is prepared with good quality beans and care should be taken to saute the onion tomato base till rawness disappers. It is a crucial step in the making of the curry. \r\n\r\nPopular as Rajma Chawal in North India, Rajma Masala is served with Basmati rice. Among the best Indian recipes, Rajma Masala is my most favorite comfort food that I relish to the core. :)\r\n\r\nRajmah Masala","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/06\/rajma-masala-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rajma-masala-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rajma-masala-recipe-300x300.jpg","special-diet":["eggless","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"45","prep-time":"10","main-ingredient":["rajma"],"serves":"6","author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Lentil Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","North Indian Recipes"],"tags":["kidney-beans","rajma","rajma-masala"]}