{"id":14420,"permalink":"http:\/\/www.sailusfood.com\/2013\/06\/14\/egg-roast-nadan-kerala-style\/","title":"Kerala Egg Roast","content":"Egg Roast ~ Nadan Kerala Style \r\n\r\nEgg Roast with Appam ~ Kerala style breakfast\r\n\r\nThose of you who have been following my blog for sometime will know how much our family loves eggs. :) I prepared Egg roast in typical Kerala style along with Vegetable stew to go with Appam. \r\n\r\nThis egg roast recipe comes straight from the kitchen of a Keralite home cook par excellence. I happened to relish it at a friend's home during a visit to Kerala last year. His mother served Nadan (traditional home style) egg roast over a bed of pure white lacy appams which was polished off the plate in minutes. She was amused with my enthusiasm to learn more about the egg roast which according to her is really not much of a recipe. I love this Kerala style egg dish for the immense flavor and simplicity of the recipe and it goes to my list of favorite Indian egg recipes. The onions need to be sliced and not chopped and the egg roast does use a lot of onions. The onions need to be caramalized to a light brown shade before adding the spices. You could add few tablespoons of coconut milk towards the end of the cooking process to mellow down the kick of the fiery spices like black pepper and red chili powder.\r\n\r\nNadan Egg Roast","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/06\/egg-roast-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-roast-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-roast-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["side"],"special-diet":["egg","dairy free","gluten free","nut free","kid friendly","pregnancy"],"cuisine":["kerala"],"cook-time":"30","prep-time":"10","main-ingredient":["eggs"],"serves":"4","goes-well-with":["appam"],"author":null,"type":"post","categories":["All Recipes","Indian Egg Recipes","Indian Fry Recipes","Kerala Recipes","South Indian Recipes"],"tags":["egg","kerala-food","roast"]}