{"id":14443,"permalink":"http:\/\/www.sailusfood.com\/2013\/06\/30\/mysore-masala-dosa-recipe\/","title":"Mysore Masala Dosa","content":"Mysore Masala Dosa Recipe\r\n\r\nMysore Masala Dosa\r\n\r\nMysore Masala Dosa ~ an absolutely addictive, comforting fare and a classic among South Indian breakfast recipes. I always look forward to my visits down South to savor the flavor of this Karnataka special dosa that has its origins in Mysore. One thing I noticed during my visit to Mysore and Bangalore is that each restaurant has its own version of Masala Dosa, be it Benne Masale, Mysore Masale or Plain Dosa. Either the accompaniments served with dosa were different or the stuffings and texture of dosa differed. Dosas are thin and crisp or have a crisp exterior with a spongy uttapam like interior. Dosas are liberally sprinkled with podi, drizzled with ghee\/butter and served with potato masala, sambar and a colorful array of chutneys or plain sponge dosas similar to set dosas are served with vegetable saagu and green chutney. \r\n\r\nWhatever fillings the dosas were enveloped in, I have enjoyed the numerous flavors and textures with delight. Any visit to a restaurant in Karnataka or Tamil Nadu, the enticing aromas emanating from the kitchen, reiterate that Masala Dosa is THE breakfast dish to be ordered. :)\r\n\r\nPotato Masala ~ Red Chutney ~ Coconut Chutney\r\n\r\nMysore Masala Dosa recipe is easy to make though it is a labour intensive breakfast dish. This addictive rich dosa has a crisp exterior and the spongy interior is liberally smeared with butter or ghee, over which a layer of red chutney is smothered and finished off with potato masala, folded in half and served with accompaniments like sambar and coconut chutney. Its rich and filling, enough to see your through the day. And the best way to finish off this ultimate South Indian breakfast indulgence is a cup of strong filter coffee.\r\n\r\nKarnataka Special Breakfast ~ Mysore Masala Dosa\r\n\r\nSoft or crisp, shaped like a roll or cone, with or without stuffing, slathered with or without butter, the divine dosa is my perennial favorite. If you are a dosa lover and yet to try this comforting Karnataka special, I suggest you give Mysore Masala Dosa recipe a try. You will not regret. :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/06\/mysore-masala-dosa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mysore-masala-dosa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mysore-masala-dosa-300x300.jpg","style":["easy","traditional"],"course":["breakfast"],"special-diet":["eggless","gluten free","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"60","prep-time":"60","main-ingredient":["rice","urad dal","potato"],"serves":"12","goes-well-with":["chutney","sambar"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Mysore Recipes","South Indian Recipes"],"tags":["dosa","dosa-batter","dosa-filling","masala dosa","mysore-food"]}