{"id":14458,"permalink":"http:\/\/www.sailusfood.com\/2013\/07\/05\/rava-dhokla-recipe-snacks-gujarati\/","title":"Rava Dhokla ~ Steamed Gujarati Snack","content":"Rava Dhokla\r\n\r\nRava Dhokla\r\n\r\nA visit to the local mithai store, Ladoo Gopal, is usually when I crave chaat. Along with a hot plate of chaat, I end up eating Dhokla and hot jalebi. :) My favorite variety of Dhokla aka savory cake is the one made with semolina, Rava Dhokla. The authentic version of Dhokla uses rice and bengal gram or urad dal which are soaked overnight, ground to a batter, spiced up with ginger and green chilis, fermented, steamed and tempered with spices. A labor intensive, long drawn process that requires patience. Home cooks have their own versions or variations of the revered Gujarati snack recipe based on the region its prepared.\r\n\r\nDhokla Chutney\r\n\r\nI have blogged Khatta Dhokla at Kids Zone which calls for the use of rice and urad dal. Today's Rava Dhokla recipe uses only semolina aka sooji along with sour yogurt. It has a soft, fluffy texture with slightly spicy, sour and salty flavors and a hint of sweetness. Spice of choice can be crushed black pepper corns or green chilies. I usually soak semolina in yogurt the earlier night and refrigerate, though the minimum soaking period is an hour. I made these soft and fluffy savory cakes for breakfast which made for a substantial and filling meal. If you are looking for recipes of snacks that are traditional, easy to make and delicious then Rava Dhokla should be your choice. It can be served as a snack or starter with coconut chutney, garlic chutney or coriander chutney.\r\n\r\nSooji Dhokla\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/07\/rava-dhokla-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava-dhokla-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava-dhokla-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["snack"],"special-diet":["eggless","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["gujarati"],"cook-time":"15","prep-time":"10","main-ingredient":["semolina","curd"],"serves":"5","goes-well-with":["chutney"],"author":null,"type":"post","categories":["All Recipes","Gujarati Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes"],"tags":["dhokla","gujarati-food","snack","sooji"]}