{"id":14479,"permalink":"http:\/\/www.sailusfood.com\/2013\/07\/26\/arisi-paruppu-sadam-recipes-with-rice\/","title":"Arisi Paruppu Sadam ~ South Indian Style Dal Rice","content":"Arisi Paruppu Sadam\r\n\r\nArisi Paruppu Sadam\r\n\r\nThere are endless variety of rice dishes in Indian cuisine as rice is a staple across the sub continent. The varitions, flavors, textures of each rice dish is unique, be it the rich Biryani or the simple lemon rice. One such simple, protein dish is a South Indian style tur dal rice variety, Arisi Paruppu Sadam. When I am rushed for time with less than 30 minutes to cook a complete meal, my go to one pot meal is dal rice. Comfort food!\r\n\r\nA straight forward recipe with its origins in Tamil Nadu, Arisi Paruppu Sadam has short grained rice and tur dal as its star players. Tempering of spices in ghee aka clarified butter and the use of asafoetida elevate the flavor of the rice dish tremendously. I have tried this recipe with asafoetida and sambar powder and it was relished by my family. Today, am posting a variation which has crushed garlic along with aromatic spices like cinnamon and cloves in the tempering. I loved the flavors and it made for a hearty and filling meal. To go with Arisi Paruppu Sadam, I also prepared a simple potato fry which makes for a perfect accompaniment along with papad, pickle and curd.\r\n\r\nTamil Style Dal Rice - Paruppu Sadam","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/07\/variety-rice-recipes.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/variety-rice-recipes-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/variety-rice-recipes-300x300.jpg","style":["easy","quick","modern"],"course":["main-course"],"special-diet":["eggless","nut free","vegetarian","vegan","gluten free","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"30","prep-time":"10","main-ingredient":["rice","tur dal"],"serves":"4","goes-well-with":["potato fry"],"author":null,"type":"post","categories":["All Recipes","Indian Rice recipes","Indian Vegetarian Recipes","Lunch Box Recipes","South Indian Recipes"],"tags":["rice","sadam","tur-dal"]}