{"id":14480,"permalink":"http:\/\/www.sailusfood.com\/2013\/07\/22\/chocolate-cake-recipe-birthday-party\/","title":"Chocolate Cake","content":"Chocolate Cake\r\n\r\nChocolate Cake\r\n\r\nA chocolate cake that is rich, moist and incredibly delicious. One of the best chocolate cakes I have ever made that has a tender crumb, with the right amount of sweetness, perfectly moist with an intense chocolate flavor. I am talking about Beatty's Chocolate Cake that is a rave all over the internet and the kind of cake one can bake for special occasions and birthdays. \r\n\r\nChocolate cake for birthday party\r\n\r\nOther than the inclusion of freshly brewed coffee, I also like that the choice of fat is vegetable oil which gives the cake its super moistness. The espresso or freshly brewed coffee intensifies the chocolate flavor and does not overpower it. The cake batter will be on the runny side and that is perfectly fine. Remember to use room temperature ingredients while baking and do not over bake as you might end up with a dry cake. Follow the instructions to the T and you will find yourself with a winner of a recipe.\r\n\r\nI filled two layers of cake with ganache that complemented the cake well and poured ganache all over the cake allowing it to drip along the sides giving a perfect finish for a birthday cake. If you find yourself drooling over your keyboard and unable to control your chocolate cravings, why dont you do yourself a favor? Just get into your kitchen and bake this outstanding cake. :) \r\n\r\nMoist Chocolate Cake","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/07\/dark-chocolate-cake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dark-chocolate-cake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dark-chocolate-cake-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["egg","nut free","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"35","prep-time":"15","main-ingredient":["flour","cocoa powder"],"serves":"10","goes-well-with":["frosting"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Sweet Dessert Recipes"],"tags":["chocolate","chocolate-cake"]}