{"id":1448,"permalink":"http:\/\/www.sailusfood.com\/2008\/11\/27\/gobhi-parantha-palak-methi-paneer\/","title":"Gobhi Parantha & Palak Methi Paneer ","content":"Sunday lunch was Gobhi Parantha and Palak Methi Paneer, a filling and comforting lunch. With abundant greens available at rythu bazaar (farmer's market) I'm trying to make optimum use of them in my everyday cooking.\r\n\r\n\r\n\r\nThis paneer dish combines the goodness of fresh methi and spinach leaves in a onion-tomato spiced base to form a creamy consistency dish.\r\n\r\n\r\nPalak Methi Paneer Recipe\r\nPreparation: 45 mts\r\nServes 3-4 persons\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 bunches spinach leaves\r\n\r\n1 cup fresh methi leaves, add little salt, sugar and leave aside for few mts, squeeze all water\r\n\r\n1 cup paneer cubes\r\n\r\n1 onion, finely chopped\r\n\r\n2 green chillis, slit midway\r\n\r\n1 onion, blanched\r\n\r\n1 tomato, blanched\r\n\r\n1 tsp grated ginger\r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\ngaram masala pwd (2 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\n1 tbsp malai or fresh cream\r\n\r\nsalt to taste\r\n\r\n1 tbsp oil\r\n\r\n\r\n\r\n1 Add big pinch salt + big pinch sugar to the methi leaves and let it rest for a few mts. Squeeze excess water from methi and blanch for a mt. Blanch palak leaves for 2 mts and make a puree of both palak and methi leaves.\r\n2 Blanch onion and tomato and make a paste of both.\r\n3 Heat oil in a vessel, add the grated ginger, green chillis and chopped onion and fry well for 7-8 mts. Add the onion-tomato paste and fry for another 6-7 mts.\r\n4 Add coriander pwd, turmeric pwd, red chilli pwd and saute for a mt. Add the pureed green paste (palak-methi) and half a cup of water and cook for 5-7 mts. Add salt and combine.\r\n5 Add garam masala pwd and paneer cubes and combine well. Cook for another 6-7 mts and turn off heat and serve hot with rotis\/parathas.\r\n\r\nOne of the variations of Gobhi Parantha recipe that works well for my family.\r\n\r\n\r\nGobhi Parantha Recipe\r\nPrep &amp; Cooking: 30 mts\r\nMakes 4-5 parathas\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\nFor parantha:\r\n\r\n2 cups whole wheat flour\/atta\r\n\r\n1\/4 tsp salt\r\n\r\nwater to knead the dough\r\n\r\nFor stuffing:\r\n\r\n1 cup grated cauliflower\r\n\r\n1 tsp grated ginger\r\n\r\n1-2 chopped green chilli\r\n\r\n1 1\/2 tbsp chopped coriander leaves\r\n\r\n1\/2 tsp ajwain (optional)\r\n\r\nbig pinch turmeric pwd\r\n\r\n1\/4 tsp cumin pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Add salt to the atta, combine, slowly add water to form a soft yet slightly firm dough. Cover with damp cloth and let it rest for 15-20 mts. Get the stuffing ready in the mean time.\r\n2 Prepare stuffing by combining grated cauliflower, grated ginger, chopped green chillis, coriander leaves, coriander pwd, turmeric pwd, cumin pwd, pinch of salt and combine. Leave aside for a few mts.\r\n3 Pinch a large lemon sized ball of dough and using your finger spread out to form a 3\" diameter circle. Place some stuffing and take the edges of the dough and cover the stuffing. Prepare with rest of dough and leave aside for 2-3 mts.\r\n4 Dust the working surface with some atta and roll out the stuffed dough to form 6\"-7\" diameter circles.\r\n5 Heat a iron tawa and once its hot, place a parantha and let it cook for a little less than a mt. Flip the parantha and let it cook for a little less than a mt. Once lighly browned spots appear, drizzle some oil or ghee and roast to a golden shade on both sides. Use a spatula to press the puffed areas as the parantha gets roasted.\r\n6 Serve hot with any curry of your choice or yogurt or raita.\r\n\r\nNote: I have blanched the cauliflower and dried out the florets prior to grating it for the paranthas. Ensure the blanched cauliflower is completely dry before grating it. You can blanch 3-4 hours prior to preparation. You can alternately, grate raw cauliflower, sprinkle salt and leave for a few mts. Squeeze out the water completely, place on an absorbent paper to remove any trace of moisture and use it to prepare parathas.\r\n\r\n\r\n\r\nUpdate on TOI: Taste of India will be unavailable for a few more days. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/11\/methi-palak-paneer-gobi-paratha.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi-palak-paneer-gobi-paratha-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi-palak-paneer-gobi-paratha-300x300.jpg","main-ingredient":["cauliflower"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Paneer Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["methi","palak","paneer"]}