{"id":14494,"permalink":"http:\/\/www.sailusfood.com\/2013\/07\/31\/eggless-pancakes-best-pancake-recipe\/","title":"Eggless Pancakes ~ Best Pancake Recipe","content":"Best Pancake Recipe Ever - Eggless Pancakes\r\n\r\nEggless Pancakes\r\n\r\nEggless pancakes happen to be a favorite evening snack or mid morning snack for Nehal. Today is a school holiday due to the bandh called for by the Seemandhra leaders on the Telangana decision. Surprisingly, he gets very hungry during holidays and I dont know where this hunger comes from inspite of having a filling breakfast. He did not want to eat any of the munchies like Murukku or Chegodi which were very much within his reach. He wanted something warm and freshly made! With no bread at home to make him a sandwich, I decided on making the best pancake recipe that I ever tried. Eggless pancakes!\r\n\r\nBest Pancake Ever\r\n\r\nIt is one of the quickest, simplest and tasty snack for kids which take less than 15 mts to make. Yes, fluffy eggless pancakes made from scratch hardly take any time to prepare. So drop those store bought box mixes and make your own. You can use whole wheat flour for a healthy option. I adapted this recipe with minor changes and its a keeper. They make for the softest, fluffiest, spongy and crisp on the outside pancakes. Even the pickest of eaters will relish this best pancake recipe served warm with honey or maple syrup. I drizzled some honey on the cinnamon flavored eggless pancakes which made for a great combination.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/07\/pancake-from-scratch.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pancake-from-scratch-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pancake-from-scratch-300x300.jpg","style":["easy","quick","modern"],"course":["breakfast"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"15","prep-time":"5","main-ingredient":["flour","milk"],"serves":"5","goes-well-with":["honey","maple syrup"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Lunch Box Recipes"],"tags":["eggless","pancake"]}