{"id":14495,"permalink":"http:\/\/www.sailusfood.com\/2013\/08\/23\/crispy-onion-samosa-recipe-indian-snacks\/","title":"Crispy Onion Samosa Recipe","content":"Crispy Onion Samosa Recipe\r\n\r\nOnion Samosas\r\n\r\nOnion Samosa recipe is one of the most sought after snack recipe by many of my blog readers. I am talking about the addictive, small, crispy onion samosas that are served in the college canteens, railway stations, movie theatres, Irani tea cafes and the like. Seriously, I am no expert in making this classic Indian addictive snack that also goes by the name, Irani samosas. Trying to achieve perfectly crisp onion samosa is not an easy task. Having said that, I will also say that one can make it at home with near perfection. :)\r\n\r\nMaking of Onion samosa\r\n\r\nOnion samosa is different from the regular Punjabi style samosa in terms of the filling as well as the texture of the outer dough layer. Onion samosa has a super crispy, smooth exterior with a lightly spiced onion filling. The onion filling is mixed with powdered poha aka beaten flat rice flakes which absorbs any moisture that the filling might have. The key to a crisp samosa is in the samosa pastry dough that has to be kneaded to the right consistency, rolled to the perfect thickness which is neither too thick nor too thin and the samosas have to be fried in oil that is not too hot, on a low medium flame to achieve a golden brown, crisp exterior.\r\n\r\nWrapped samosas ready for deep frying\r\n\r\nI must thank Mina Joshi for her tips on how to make crispy onion samosa. You will find lovely blog for a step by step tutorial on how to roll the samosa pastry and wrap the pastry sheet with the filling on her blog. Do try this onion samosa recipe and leave your feedback. \r\n\r\nCrispy Onion Samosa","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/08\/crispy-onion-samosa-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/crispy-onion-samosa-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/crispy-onion-samosa-recipe-300x300.jpg","style":["easy","modern"],"course":["starter"],"special-diet":["eggless","dairy free","nut free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"30","prep-time":"60","main-ingredient":["flour","onions"],"serves":"14","goes-well-with":["tea"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["onion samosa","samosa","snack"]}