{"id":14521,"permalink":"http:\/\/www.sailusfood.com\/2013\/08\/26\/nalla-karam-podi-recipe-andhra-style\/","title":"Nalla Karam Podi","content":"Nalla Karam Podi ~ Andhra Style\r\n\r\nNalla Karam Podi\r\n\r\nNalla Karam literally translates to 'Black chili powder' in Telugu. Andhra cuisine boasts of a variety of spiced powders like gun powder aka kandi podi, karam podi, sesame seeds powder, dry coconut powder and curry leaves powder. It is similar to Karam podi yet different in terms of looks, texture and flavor. Each home has its own version of podis and over the years we have been trying out various permutations and combinations trying to achieve that 'perfect podi'.\r\n\r\nDry roasted spices ready to be ground\r\n\r\nRed chilis that are slow roasted to a dark shade, roasted curry leaves and black gram dal with husk are the main ingredients which give the podi its dark shade. Coriander seeds, tamarind and raw garlic give the podi a wonderful texture and flavor. I love the flavor of raw garlic that is blended well into the roasted ingredients. It enhances the flavor of Nalla Karam by leaps and bounds. This podi is best served with hot steamed rice and a dollop of ghee or gingelly oil. It also makes for a delectable side with idli. Liberally sprinkle the podi on the warm idlis, drizzle some gingelly oil or ghee and relish. :)\r\n\r\nIdli sprinkled with Andhra Nalla Karam and Gingelly oil","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/08\/nalla-karam-podi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nalla-karam-podi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nalla-karam-podi-300x300.jpg","style":["easy","quick","traditional"],"course":["side"],"special-diet":["eggless","nut free","gluten free","dairy free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"20","prep-time":"15","main-ingredient":["black gram dal","red chilis"],"serves":"10","goes-well-with":["rice","idli"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Podi Recipes"],"tags":["nalla karam","podi"]}