{"id":14573,"permalink":"http:\/\/www.sailusfood.com\/2013\/10\/14\/puliyodharai-recipe-tamil-food\/","title":"Puliyodharai ~ Tamarind Rice","content":"Puliyodharai ~ Tamil style tamarind rice \r\n\r\nPuliyodharai\r\n\r\nA popular neivedhyam aka Prasadam offered in South Indian temples is Puliyodharai\/Pulihora. Each temple has its own signature prasadam be it the Tirupathi laddu, the puliyodharai offered at the Meenakshi temple in Madhurai or the chakkra pongal offered at Sampat Vinayagar temple in Vizag. The flavor and textures of prasadam that we eat in holy places is difficult to replicate in home kitchens. Temple offerings have a superior addictive taste and its hard to describe in words how one feels relishing the holy prasad in the soothing presence of the Almighty. God bless the temple cooks as they churn out fresh and tasty food day in and day out. :) \r\n\r\nTraditional dishes like Puliyodhara are simple Indian recipes that are straightforward and relished by one and all. Each home cook has his\/her own variation of the popular Tamil style Puliyodharai mix which is a combination of spices that include coriander seeds, chana dal, fenugreek seeds and red chilies that are roasted and ground to a fine powder. It is this magic concoction along with a blend of tempered spices, tamarind paste, jaggery and roasted peanuts that gives this Tamil style tamarind rice its distinct taste. This traditional temple style tamarind rice is also popular in parts of Andhra especially in the Tirupathi, Chitoor and Cuddapah regions. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/10\/puliyodharai-tamil-food.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puliyodharai-tamil-food-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puliyodharai-tamil-food-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","nuts","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["tamil"],"cook-time":"45","prep-time":"10","main-ingredient":["rice","tamarind"],"serves":"6","goes-well-with":["curd","papad"],"author":null,"type":"post","categories":["All Recipes","Festival Foods","Indian Festivals","Indian Rice recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Navratri Recipes","South Indian Recipes"],"tags":["puliyogare","rice","tamarind-rice","tamil-recipes"]}