{"id":14578,"permalink":"http:\/\/www.sailusfood.com\/2013\/10\/19\/chocolate-mousse-easy-dessert-recipes\/","title":"Chocolate Mousse","content":"Chocolate Mousse ~ Easy dessert recipes for kids\r\n\r\nChocolate Mousse with whipped cream and grated chocolate\r\n\r\nDoesn't it feel good to indulge in rich desserts once in a while? :) Chocolate is my weakness and when it is transformed into a silky smooth, melt in the mouth goodness, it is nirvana. Its not very often that I make rich desserts unless its a festival or a special occasion. During the Dusherra break, Nehal invited a few of his friends for a get together and the ideal choice of a chilled dessert to end the meal was the decandent Chocolate Mousse. \r\n\r\nEasy dessert for kids ~ Mousse\r\n\r\nThe Chocolate mousse recipe might seem daunting at first but when you get down to making it, you will realize how easy it is. It yields a fluffy, smooth yet rich tasting chocolate mousse. It is among the easy dessert recipes for kids and adults alike and a popular one at that. And do use good quality dark chocolate.\r\n\r\nChocolate Mousse\r\n\r\nWhen topped with a dollop of whipped cream and garnished with grated chocolate, this chocolate mousse is a mesmerizing dessert that all you chocolate and dessert lovers will want to add to your sweet arsenal. :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/10\/how-to-make-chocolate-mousse.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-chocolate-mousse-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-chocolate-mousse-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["egg","nut free","gluten free","dairy","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"30","prep-time":"30","main-ingredient":["chocolate","cream"],"serves":"6","goes-well-with":["whipped cream"],"author":null,"type":"post","categories":["All Recipes","Sweet Dessert Recipes"],"tags":["chocolate","dessert","mousse"]}