{"id":14584,"permalink":"http:\/\/www.sailusfood.com\/2013\/10\/23\/coriander-poha-kids-tiffin-recipes\/","title":"Kothimeera Atukulu ~ Coriander Poha","content":"Kids Tiffin Recipes - Kothimeera Atukulu\/Fresh Coriander Poha\r\n\r\nTiffin Recipe ~ Coriander Poha - Kothimeera Atukulu\r\n\r\nPoha aka beaten rice\/flattened rice is a humble ingredient that graces many an Indian home cook's pantry across the sub-continent. Basically it is dehusked rice that is flattened into flat light dry flakes that vary in thickness. The common Indian names given to beaten rice are poha, aval, avalakki and atukulu. It is versatile in terms of the numerous varieties one can prepare, be it savory or sweet dishes. It is much loved by mothers who look for quick kid tiffin recipes using poha. Few quick and easy poha dishes that I have blogged earlier include atukula upma and kanda pohe that make for a quick breakfast or evening snack and festival recipes like atukula payasam, atukula laddu and teepi (sweet) atukulu.\r\n\r\nCoriander Poha or Kothimeera Atukulu (Telugu) is a simple yet flavorful dish where poha is flavored with fresh coconut and fresh coriander leaves. The flavor of coconut and fresh coriander shines through and the scent of the spices makes it special. It is an amazingly flavorful dish that you can prepare when unexpected guests drop by or can be served as fasting food during festivals. It is a winner of a recipe and do add it to your repertoire as its a change from the everyday boring upma and the likes. It is light on the stomach yet filling enough to see you through the morning hours before lunch.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/10\/kothimeera-atukulu-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kothimeera-atukulu-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kothimeera-atukulu-recipe-300x300.jpg","style":["easy","quick","modern"],"course":["snack"],"special-diet":["eggless","nut free","dairy free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"5","prep-time":"20","main-ingredient":["beaten rice","coriander leaves"],"serves":"5","goes-well-with":["pickle"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Breakfast Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Navratri Recipes","South Indian Recipes"]}