{"id":14583,"permalink":"http:\/\/www.sailusfood.com\/2013\/11\/20\/gojju-avalakki-quick-breakfast-recipes\/","title":"Gojju Avalakki ~ Tangy Spiced Poha","content":"I received an email from a newly married home maker who is learning the nuances of Indian food cooking. She had a query for me - \"How to make easy breakfast recipes that are not only tasty but quick to make as I need to fix my husband's breakfast by 7.30 am?\". Over the years, I have received many such emails requesting for easy, quick to make and tasty recipes. I have shared a few tiffin recipes that include breakfast dishes that can be fixed in less than 30 minutes. I am sharing yet another South Indian breakfast recipe, Gojju Avalakki, that fits the bill and a much relished dish in our home. \r\n\r\nGojju Avalakki ~ Tangy Spiced Poha\r\n\r\nGojju Avalakki also popularly known as Huli Avalakki is a Karnataka vegetarian breakfast dish this is prepared with beaten rice aka Poha or Atukulu. (Gojju = gravy and avalakki = beaten rice). Beaten rice is ground to a coarse powder, dunked in a tamarind water that is sweetened with jaggery and spiced with rasam powder before sauteed in a tempering of spices and roasted peanuts and finally garnished with fresh coconut and coriander leaves. The roasted peanuts provide a nutty crunch that complements the tangy, sweet and spice flavors of this vegan dish. A variation is the addition of a ground mix of dry roasted black pepper corns and sesame seeds which flavors Gojju Avalakki with a surprising depth.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/11\/huli-avalakki-breakfast-recipes.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/huli-avalakki-breakfast-recipes-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/huli-avalakki-breakfast-recipes-300x300.jpg","style":["easy","quick","modern"],"course":["breakfast"],"special-diet":["eggless","nuts","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"5","prep-time":"25","main-ingredient":["beaten rice","tamarind"],"serves":"5","goes-well-with":["curd"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["beaten rice","breakfast","indian_vegan_recipe","poha","tiffin"]}