{"id":14595,"permalink":"http:\/\/www.sailusfood.com\/2013\/10\/30\/chiroti-best-indian-sweets-recipes\/","title":"Chiroti ","content":"Chiroti (Chirote) ~ Indian sweets recipes for Diwali\r\n\r\nChiroti\r\n\r\nChiroti is a traditional Karnataka sweet that is prepared on special occasions and religious festivals. It is also a very popular dessert in traditional Maharastra cuisine and is called Chirote.  Prepared with plain flour, Chiroti is a fried flaky pastry with concentric circles of delicate layers that is either sprinked with a generous amount of cardamom flavored powdered sugar or dipped in cardamom flavored sugar syrup. Another version of Chiroti, more popularly known as Pathir Pheni, is prepared with \"chiroti rava\" (a mixture of plain flour and fine semolina\/sooji) where the fried flaky pastry is sprinkled with powdered sugar and dunked in badami haalu (almond milk) which is nothing but sweetened milk that is flavored with ground almonds, saffron and cardamom. A mouth watering delicacy that is an integral part every Kannadiga wedding meal and one that I have been fortunate to taste at friend's wedding in Mysore.  \r\n\r\nHow to make Chiroti - Steps of follow\r\n\r\nMaking chiroti is not a complicated process as it might appear to the beginner cook. Basically a stack of three to four thinly rolled out rotis that have been smeared with a paste of rice flour are rolled up into a cylindrical log and sliced into 1\/2\" thick pieces. These cut out pieces are again rolled out thin and deep fried to a golden shade. This crunchy delight is highly addictive and I must warn you that you will not be able to resist yourself from grabbing more than your fair share. Chiroti is one the best Indian sweets recipes that you can make for family and friends this Diwali. :)\r\n\r\nChirote","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/10\/chiroti-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chiroti-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chiroti-recipe-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"30","prep-time":"60","main-ingredient":["flour","sugar"],"serves":"20","goes-well-with":["almond milk"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Flour Recipes","Indian Festivals","Indian Sweets Recipes","Konkani Recipes","Maharashtrian Recipes","Mangalorean Recipes","Navratri Recipes","South Indian Recipes","Sweet Dessert Recipes"],"tags":["chiroti","festival_sweets"]}