{"id":14601,"permalink":"http:\/\/www.sailusfood.com\/2013\/10\/31\/cornflakes-mixture-bakery-style\/","title":"Cornflakes Mixture ","content":"Cornflakes Mixture ~ South Indian Bakery Style\r\n\r\nCornflakes Mixture\r\n\r\nMixture is the much loved savory snack of Indians that is sold in almost all the bakeries across the sub-continent. Mixture is a hotchpotch of assorted savory snacks prepared with chickpea flour like murukku, omapudi aka karapoosa\/sev and boondi. This assorted mix is flavored with red chili powder and mixed with other crunchy bites like roasted peanuts, cashewnuts, fried beaten rice and cornflakes. What goes into a typical mixture is individual choice. There are assorted styles of mixtures prepared all over the country with numerous flavors to choose from be it sweet, spicy or tangy. During festivals like Diwali, most homes prepare huge quantities of mixture a week ahead and store in large stainless steel dabbas, a portion of which is distributed among family and friends along with other Diwali sweets. \r\n\r\nOmapudi\/Karapoosa ~ Fried cornflakes, beaten rice, peanuts and curry leaves\r\n\r\nThis Diwali we made cornflakes mixture. Usually for cornflakes mixture the quantity of cornflakes is more than the rest of the assorted snacks be it sev, murukku or boondi. I have added murukku and sev along with beaten rice (poha). I have already blogged the recipe of sev and murukku, so follow those recipes if you want to add them to the cornflakes mixture. For a very basic version of cornflakes mixture, you can go with raw cornflakes and beaten rice while omitting the chickpea based snacks like sev. An addictive crunchy, spicy snack and when served with a cup of masala chai, it is a ticket to heaven. :)\r\n\r\nSpicy Cornflakes Mixture\r\n\r\nI love to make chaat with cornflakes mixture. Just add some chopped onions, tomatoes, fresh coriander, drizzle some green chutney, sweet chutney and finish off with a dash of lemon juice. You can also add some beaten sweetened curd to it. It makes for quick snack for unexpected guests who drop by for tea.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/10\/spicy-cornflakes-mixture.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/spicy-cornflakes-mixture-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/spicy-cornflakes-mixture-300x300.jpg","style":["easy","traditional"],"course":["snack"],"special-diet":["eggless","nuts","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"45","prep-time":"30","main-ingredient":["cornflakes","chickpea flour","peanuts"],"serves":"30","goes-well-with":["tea","coffee"],"author":null,"type":"post","categories":["All Recipes","Festival Foods","Flour Recipes","Indian Festivals","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["mixture","snack"]}