{"id":14619,"permalink":"http:\/\/www.sailusfood.com\/2013\/11\/07\/aloo-rasedar-recipe-north-indian-food\/","title":"Aloo Rasedar (no onion no garlic recipe)","content":"Aloo Rasedar ~ North Indian Food (Uttar Pradesh style)\r\n\r\nPuri served with Rasedar Aloo ki Sabzi\r\n\r\nWho doesn't love Puri Bhaji? It is India's most loved indulgent vegetarian North Indian breakfast fare. The mere sight of Puri Bhaji is enough to set my spirits high and comfort my soul especially on a rainy or gloomy day. I do indulge myself and my family to a plate of puri bhaji every now and then and I also like to try out different versions of the potato curry to go with puri especially those that do not require too much work. One particular potato curry that has caught my fancy in the recent past that requires no onion and no garlic is Aloo Rasedar. It was during a weekend visit to a family friend's home that I learnt about Aloo Rasedar. My friend tells me that she learnt this North Indian style potato curry from her mother in law who belongs to Uttar Pradesh and it is served with puri in their home. She also mentioned that back at her in-laws home town, each home cook gives her own twist to the versatile Aloo Rasedar and the mix of spices might differ. There is also another version which calls for tomato puree which I'm told is delectable and the addition of matar aka green peas makes it irresistable. My friend was kind enough to share with me the recipe of aloo sabzi that is served with Kachori. I am looking forward to make it during the winter days.\r\n\r\nAloo Rasedar is a simple recipe with an eclectic mix of fragrant spices that perk up the wet sabzi. The only preparation work involved is boiling the potatoes and in less than 15 minutes, you have a simple yet flavorful rasedar aloo ki sabzi ready to be served with warm puffed up puris. Do try Rasedar Aloo the next time you venture to make Puri Bhaji for your family. Let me tell you that it is an addictively comforting meal! :)\r\n\r\nAloo Rasedar\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/11\/aloo-rasedar-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aloo-rasedar-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aloo-rasedar-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["breakfast"],"special-diet":["eggless","nut free","dairy free","vegetarian","vegan","gluten free","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"15","prep-time":"20","main-ingredient":["potato"],"serves":"5","goes-well-with":["puri"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["aloo","easy-vegetarian-recipes","potato","potato curry","vegan","vegetable"]}