{"id":1462,"permalink":"http:\/\/www.sailusfood.com\/2009\/01\/12\/gobi-manchurian\/","title":"Gobi Manchurian - Indian Chinese Appetizer","content":"Indo-Chinese Appetizer ~ Gobhi Manchurian\r\n\r\nThe market is flooded with Cauliflower and very reasonably priced. Bought two large heads for Rs.20\/-, cut them into florets and used a portion to prepare Gobi Manchurian. I've received requests to blog Indo-Chinese recipes especially appetizers. So, I decided on this colorful and vibrant cold-weather appetizer or snack, much loved by Indo Chinese fusion food connoisseurs.\r\n\r\nThis recipe comes after a couple of trials to achieve that restaurant style 'Gobi Manchurian'. In fusion cooking there are no rules to follow. You will find assertive notes of spice and tang, a generous dose of garlic, green chilli, ginger and garnished with lots of spring onions and coriander leaves - in other words, simply flavorful! It does take some time to prepare but its worth the effort.\r\n\r\nGobi Manchurian Recipe\r\nPrep & Cooking Time: 40 mts\r\nServes 4-5 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1 medium sized cauliflower, cut into florets, placed in salted hot water for 10-12 mts, drained\r\n\r\n2 tbsps maida\/all-purpose flour\r\n\r\n2 tbsps cornflour\r\n\r\n1\/2 tbsp rice flour (optional)\r\n\r\n1 tbsp ginger-garlic-green chilli paste\r\n\r\napprox a little less than 1\/2 cup warm water \r\n\r\nsalt to taste\r\n\r\nFor sauce:\r\n \r\n1\/4 cup spring onions, finely chopped, \r\n\r\n1\/2 capsicum, finely sliced\r\n\r\n1 1\/2 tbsps finely minced garlic\r\n\r\n1\/2 tbsp finely sliced ginger\r\n\r\n2 finely chopped green chillis\r\n\r\n1 tsp red chilli pwd (preferably Kashmiri)\r\n\r\n2 tsps soya sauce\r\n\r\n1 tbsp chilli sauce\r\n\r\n2 tsps vinegar\r\n\r\n3 tbsps tomato sauce\r\n\r\n1\/2 tsp brown sugar (optional)\r\n\r\nsalt as required\r\n\r\n1 1\/2 tbsps sesame oil\r\n\r\n1 tbsp finely chopped coriander leaves\r\n\r\n\r\n\r\n1 Heat oil for deep frying in a heavy bottomed vessel. \r\n2 In a bowl, combine maida, cornflour, rice flour, salt, ginger-garlic-green chilli paste and water to make a thick paste. Dip the washed and drained florets into the batter such that its well coated. Place each floret that is well coated with the batter into the hot oil. Do not crowd the vessel. Reduce flame and deep fry till the gobi is almost cooked. Increase the flame towards the end of the cooking process and fry the gobi till it turns golden brown. Remove onto absorbent paper and keep aside.\r\n3 Heat oil in a large wok and once the oil is piping hot, add the chopped garlic and stir fry for a few seconds. Add the green chillis and ginger and stir fry on high for a few seconds.\r\n4 Add the whites of spring onions and stir fry on high for 3-4 mts, constantly tossing them. Add the sliced capsicum and stir fry for another 3 mts. They should retain their crunch.\r\n4 Reduce to medium heat and add the brown sugar, soya sauce, tomato ketchup, chilli sauce and vinegar. Combine well and cook for 2 mts. Add 3-4 tbsps of water and cook for 2 mts.\r\n5 Add the deep fried gobhi and combine. Toss on high flame for 1-2 mts. Turn off heat. Garnish with the chopped spring onion greens and coriander leaves.\r\n\r\n\r\nGobi Manchurian\r\n\r\nPearls of Wisdom ~ 'The secret to building sound relationships is not found in getting people to treat you a certain way, but in looking objectively at the way they tend to treat you and learning from your findings.'","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/01\/gobi-manchurian2.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/gobi-manchurian2-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/gobi-manchurian2-300x300.jpg","main-ingredient":["cauliflower"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Curry Recipes","Indian Dal Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes"],"tags":["gobi","indo-chinese","manchurian"]}