{"id":14637,"permalink":"http:\/\/www.sailusfood.com\/2013\/11\/15\/marble-bundt-cake-recipe-easy\/","title":"Marble Bundt Cake","content":"Marble Bundt Cake\r\n\r\nThis year Children's Day marked the 125th birth anniversary of Pandit Jawaharlal Nehru (Chacha Nehru). Though belated here's wishing all our children a very Happy Children's Day! :) I treated my son, Nehal and his friends to his favorite, Marble Bundt Cake, on this occasion . A simple, no frills, easy recipe for kids with vanilla and chocolate as the primary flavors.\r\n\r\nHot off the oven marble cake in a bundt pan\r\n\r\nThose of you who are absolutely new to the nuances of baking might ask what is a marble bundt cake? Its nothing but vanilla cake batter that is swirled with dark chocolate cake batter in a bundt pan and baked to perfection. Learn more about bundt pans. I followed award winning chef Sarabeth's marble bundt cake recipe which is a keeper. An unbeatable flavor with a tender texture, nice crust and tastes better as it ages. An addictive cake that will have your friends swoon and ask you to bring it for every get-together you attend for the rest of your life. And its no exaggeration! \r\n\r\nMarble Chocolate Bundt Cake\r\n\r\nMarbling the batter is easy peasy. Just spoon the vanilla batter and chocolate batter in a random manner and swirl a chopsick through the batter to create a marble effect. If you do not like to serve a plain cake, sprinkle some powdered sugar or pour a thin chocolate glaze or ganache all over and you are good to go.  Honestly, this marble bundt cake needs no adornment. Just slice through and serve a piece of the marbled beauty with a cup of coffee for the adults and a glass of milk for the kids. You can halve the recipe and make a loaf cake. And cake baking enthusiasts, if you haven't yet invested in a bundt pan then I strongly recommend you buy one. \r\n\r\nMarble Bundt Cake","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/11\/marble-cake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/marble-cake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/marble-cake-300x300.jpg","special-diet":["egg","dairy","gluten",""],"cuisine":["western"],"cook-time":"55","prep-time":"20","main-ingredient":["flour","cocoa powder"],"serves":"12","author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes","Sweet Dessert Recipes"],"tags":["cake","marble-cake"]}