{"id":14667,"permalink":"http:\/\/www.sailusfood.com\/2013\/12\/06\/chura-matar-recipe-no-onion-no-garlic\/","title":"Chura Matar (no onion no garlic recipe)","content":"Chura Matar Recipe ~ Easy to make snacks\r\n\r\nChura Matar ~ Banarasi style Poha with green peas\r\n\r\nUttar Pradesh is famous for a variety of street food snacks like samosa, kachori and chaats. One street food snack that requires special mention is the Banarasi Chura Matar aka Poha Matar (beaten rice flakes with green peas) that is very popular during the winter season when green peas are bountiful. \r\n\r\nA versatile alternative to rice is beaten rice flakes aka chura as it is popularly known parts of Northern Indian especially in Bihar and Uttar Pradesh. In the Chura Matar recipe that I have adapted from Sangeetha's food blog, poha (chura\/aval) and green peas are the major players with minimal spices going into it. There is something magical about the flavor and texture of this 'no onion no garlic recipe' and it is a pleasure to relish it on a cold winter morning with adrak wali chai. Poha that is soaked in milk and green peas are tossed in aromatic spices along with lots of fresh coriander. The flavor combination is addictive while the beautiful round gems add a wonderful color and texture to this easy to make snack.\r\n\r\nPut to good use the seasonal fresh green peas and make this no fail dish and serve it for breakfast, or as an evening tiffin or dinner.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/12\/chuda-matar-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chuda-matar-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chuda-matar-recipe-300x300.jpg","style":["easy","quick","modern"],"course":["snack"],"special-diet":["eggless","nut free","gluten","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"20","prep-time":"10","main-ingredient":["poha","matar"],"serves":"4","author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["beaten rice","green-peas","matar","poha"]}