{"id":14675,"permalink":"http:\/\/www.sailusfood.com\/2013\/12\/09\/eggless-fruit-cake-recipe-christmas\/","title":"Eggless Fruit Cake","content":"Eggless Fruit Cake ~ Christmas fruit cake without eggs\r\n\r\nEggless Fruit Cake\r\n\r\nThere are numerous requests for an eggless fruit cake recipe to bake this Christmas. So, here I have for you a hassle free, egg free and flavorsome fruit cake recipe that you are going to love. I call it hassle free because you do not have to make caramel syrup like the authentic Indian fruit cake recipe and since there are no eggs, there is no whipping work. The only preparation work to be done is grinding your own spices and soaking the dry fruits and nuts in rum and wine. And I must mention that this preparation work makes all the difference to the overall cake flavor. :)\r\n\r\nBasically, I worked around the eggless cake recipe with curd that is a popular recipe from my blog and came upon today's eggless fruit cake recipe. Instead of powdered sugar, I used dark brown sugar which gave the fruit cake a dark golden shade. A moist and rum soaked fruit laden eggless cake that everyone is sure enjoy over the holiday season. \r\n\r\nThe below image is a fruit cake that uses eggs. I have already blogged the authentic christmas fruit cake recipe that uses eggs and caramel syrup. \r\n\r\nRum soaked dry fruits ~ Fruit cake using eggs\r\n\r\nPreparing dried fruits: I prepared the dried fruits a month ahead before baking. Finally chop all the dried fruits and nuts, add the spice powders and soak in enough dark rum and red wine in a large jar such that half of the jar is filled. There should be enough room in the jar once the fruits and rum are added, as they will almost double in size. Secure the cap tight and keep away for at least a minimum of 24 hours. You can make this a year ahead, 2-3 months ahead or even a week before baking the cake. Do shake the jar once in a while. Longer the fruits steep, better the flavor. \r\n\r\nFruit cake without eggs","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/12\/egg-free-fruit-cake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-free-fruit-cake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-free-fruit-cake-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","nuts","vegetarian","gluten","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"40","prep-time":"15","main-ingredient":["dry fruits","flour"],"serves":"12","author":null,"type":"post","categories":["All Recipes","Cake Recipes","Eggless Cake &amp; Cookie Recipes","Eggless Dessert Recipes","Festival Foods","Flour Recipes","Sweet Dessert Recipes"],"tags":["christmas","eggless","eggless-baking","fruit-cake"]}