{"id":14672,"permalink":"http:\/\/www.sailusfood.com\/2013\/12\/16\/parotta-recipe-south-indian-breakfast\/","title":"Parotta Recipe","content":"Parotta Recipe ~ South Indian style layered Parota\r\n\r\nParotta with Vegetable Salna\r\n\r\nA loyal reader of my blog has requested Parotta recipe many weeks ago and I never got down to making it until this week. The soft and flaky Parotta, also known as Barotta or Porotta, is popular in the Southern states of Kerala, Tamil Nadu and Karnataka. It is a common sight to find crowds thronging the road side stalls where heaps of layered parottas hot off the stove are served with a curry both for breakfast and evening tiffin or dinner. This popular street food fare is usually served with salna or kurma. The side dish with parottas include both vegetarian and non vegetarian style gravy dishes. \r\n\r\nThere are numerous avatars of Parotta where the shape and accompaniments vary from region to region. Kerala or Malabar Parotta is usually served with vegetable, chicken, egg, beef and mutton curries while in Tamil Nadu, it is served with either vegetable salna or chicken salna.\r\n\r\nParotta dough stretched into a thin sheet and pleated into a long strip\r\n\r\nUsually I do not make Parotta at home and it is only during our travels that I get to relish Parotta, Kothu Parotta and the likes. I used to watch how the 'parotta master' would churn out hundreds of parottas with such ease. The parotta making process involves the mixing of the dough, slathering the dough with a generous amount of oil, resting it, pinching off tennis sized balls from the dough where each of these balls is flattened and deftly tossed in the air to create a super thin translucent layer that is pleated into a long thick strip which is then coiled into a circle like a rosette. \r\n\r\nRosettes & rolled out parottas ready to be fried ~ Hot off the stove Parotta with Salna\r\n\r\nThe rosettes are drizzled with more oil and rolled out into slightly thick concentric rotis and  fried on a hot tawa till golden brown. Once the parotta is fried, the parotta master would place a couple of parottas on a flat surface and use both his hands to crush them together (clapping action) to open up the layers of the parotta. These layered parottas are served with hot salna or kuruma.\r\n\r\nI am posting an eggless Parotta recipe where maida, salt, oil and water are the only ingredients that go into the making of the parotta dough. Those of you who want to learn how to make Parotta at home but are intimidated by the process of making them, let me tell you that it takes one or two attempts to make a fairly good parotta. It takes some patience and practise to achieve a perfect parotta. Keep in mind, the key is to shape the oily dough as thin as possible and its alright to have a couple of tears hear and there. Always keep the dough\/balls well greased and covered with a damp cloth so that they do not dry out. I adapted this Parotta recipe which also has a great photo tutorial on how to make Parotta.\r\n\r\nParotta tastes best hot off the stove with piping hot fragrant salna. I throw all caution to winds and enjoy it once in a while. :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/12\/parota-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/parota-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/parota-recipe-300x300.jpg","style":["modern"],"course":["breakfast"],"special-diet":["eggless","nut free","gluten","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"30","prep-time":"60","main-ingredient":["flour","oil"],"serves":"13","goes-well-with":["salna"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Kerala Recipes","Malabar Recipes","South Indian Recipes"],"tags":["breakfast","parotta","street-foods"]}