{"id":14688,"permalink":"http:\/\/www.sailusfood.com\/2013\/12\/12\/chocolate-salami-recipe-easy-dessert\/","title":"Chocolate Salami","content":"Chocolate Salami Recipe ~ Quick no bake recipes for kids this Christmas\r\n\r\nChocolate Salami ~ No bake dessert for kids\r\n\r\nAre you looking for some quick no bake recipes for kids this holiday season? A perfect holiday dessert that fits the bill is an Italian chocolate log that resesmbles a salami (a hard cured Italian sausage). Chocolate Salami recipe is one of the easiest desserts to put together with the least effort. This no bake dessert recipe is popular in Russia, the Balkans and across Europe especially Italy and Portugal. The authentic version uses eggs, butter, biscuits, sugar and cocoa powder and is prepared during festive times like Easter and Christmas.\r\n\r\nChocolate salami mixture rolled into a log ~ Set chocolate salami being sliced\r\n\r\nI have prepared an eggless version and adapted Giada's chocolate salami recipe which is a winner.  There are numerous variations of this popular dessert and the add ons can include assorted nuts like pistachio, almonds and walnuts and dried fruits of your choice. I used homemade rum soaked dried fruits and nuts. It can be served with tea or coffee or as an after dinner dessert which makes for a sweet ending to any festive celebration. I would rate chocolate salami as one of the best Christmas dessert recipes!","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/12\/chocolate-salami-recipe-italian.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-salami-recipe-italian-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-salami-recipe-italian-300x300.jpg","style":["easy","modern"],"course":["dessert"],"special-diet":["eggless","nuts","dairy","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["italian"],"cook-time":"10","prep-time":"15","main-ingredient":["biscuits","chocolate"],"serves":"15","author":null,"type":"post","categories":["All Recipes","Cookie Recipes","Eggless Cake &amp; Cookie Recipes","Eggless Dessert Recipes","Sweet Dessert Recipes"],"tags":["chocolate","chocolate-biscuit-cake","christmas","italian","no-bake-cake"]}