{"id":147,"permalink":"http:\/\/www.sailusfood.com\/2006\/05\/09\/dosa-avakai-dosavakaya-andhra-yellow-cucumber-pickle\/","title":"Dosa Avakai (Dosavakaya) - Andhra Yellow Cucumber Pickle","content":"Dosakaya or Nakka Dosakai (Yellow cucumber), a small, round-shaped light green to bright yellow colored vegetable, with a crisp crunchy skin and a mild sweet-tarty taste, is used to prepare traditional Andhra delicacies like dosakaya pappu , dosakaya pachadi and dosa avakai. Dosa Avakai is an old Andhra culinary tradition which is made on the same lines as the famous Andhra Avakai or Mango Pickle. The only difference being dosa avakai takes lesser time in terms of preparation, less laborious and is ready to be consumed within 24 hours of preparing the pickle unlike avakai which takes 6-7 days.\r\n\r\n\r\n\r\n    \r\n\r\nThe pickled cucumber pieces which are blended with a spice mixture of red chilli pwd,mustard seeds pwd and seasame oil and made to marinate overnight in the spice mixture and salt, absorb the flavors of the spices well, retaining the crunchy texture due to the skin of the cucumber and have a mild tarty, slightly spicy-pungent flavor due to the red chillis and mustard powder. Dosa Avakai is an acquired taste and is best had with hot steamed white rice and ghee or with pappu annam (cooked tur dal mixed with hot rice and ghee ).\r\n\r\nPreparation:Wash a medium sized dosakaya and dry it completely.Cut the cucumber into two halves and de-seed the cucumber and cut it into small pieces or slightly big ..approx 1\" size...which should yield 2 cups of chopped pieces.\r\n \r\n\r\nSpices required to prepare the pickle:\r\n3 tbsps mustard powder\r\n4 tbsps red chilli powder (use red kashmiri chillis)-you can reduce to 3 tbsps for less spice\r\n1 1\/2 tbsp salt-if required more salt can be added at a later stage\r\n4-5 tbsp of nuvvulu nune (til or sesame seed oil)\r\n\r\nMix chilli pwd,mustard pwd and salt.Take a wide vessel, add the above spice-mixture and the chopped dosakaya pieces.Mix the cucumber pieces well with the spice-mixture and slowly add the oil and combine with the pieces till well coated. The cucumber pieces should be well coated and wet with the spice mixture and oil but not dripping with oil, using approx 4-5 tbsps of oil. Once the cucumber pieces are well coated and wet, check the taste of the raw cucumber pickle and if salt is insufficient, add a little more salt. If you find that the salt content is more then add a few more cucumber pieces to compensate for the saltiness of the dish.\r\nGenerally the salt content in pickles is a wee bit more than normal.You can adjust according to your liking. Now put the cucumber pieces in an absolutely clean and dry wide-mouthed ceramic jar, cover with a tight lid and keep at a moisture-free dark area of your kitchen or pantry, overnight. Next day, take a dry clean laddle and mix the cucumber pickle well.\r\n\r\n\r\nDosa Avakai is ready to be consumed the day after preparing the pickle (approx 24 hours).The spices and oil blend with the cucumbers which absorbs the spice-pungent flavors to form a thick paste like consistency due to the water content in the cucumbers and salt.\r\n   \r\n \r\n\r\nCertain tips to follow while preparing dosa avakai :\r\n1.Ensure that you buy nice firm fresh looking yellow cucumbers. Dont peel the cucumbers as the skin which is edible is responsible for the crunchy texture of the pickled pieces and doesnt allow the inside of the cucumber to become too soft. Discard the seeds.Thoroughly dry the cucumber before chopping it into pieces.\r\n2.Pickles are best prepared by using home-made freshly ground red chilli pwd and mustard pwd.If you can prepare fresh chilli pwd and mustard pwd at home,there is nothing like it.Remove the stalks of the dry Kashmiri red chillis and grind to make a fine pwd and sieve. Similarly grind the mustard seeds (use the smaller variety of black mustard seeds) to a fine rava-like pwd and sieve. These days ready-made red chilli powder and mustard powders to prepare pickles are available in the stores and you can use these store bought powders if you dont have the time , of course ensuring that they are of good quality.\r\n3.The entire pickling process should be moisture free, be it the area where the pickling is being done or the ingredients used.\r\n4.Use wide-mouthed ceramic jars to store the pickle to ensure easy mixing and removing of pickle for usage.Try to sterilize it with salted hot water and wash thoroughly and dry completely before storing the pickle.\r\n5.Never ever use your hands directly while mixing and removing the pickle from the jar.Keep the ladles used for mixing or removing the pickle from the jar absolutely clean and dry.Very important you do that everytime you have to mix or remove the pickle.\r\n6.If you follow the above precautions while preparing and storing dosa avakai, this pickled cucumber can be stored in the refrigerator for a period of 2 - 3 months or even more. If not stored in the refrigerator, dosa avakai is best consumed within 2-3 weeks of preparation.\r\n\r\nDosa avakai annam mudda (rice ball prepared by mixing cucumber pickle with hot steamed rice and ghee)\r\nRecipe Source & Prep : Amma\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/dosa_avakai.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dosa_avakai-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dosa_avakai-300x300.jpg","main-ingredient":["yellow cucumber"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Pickles","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"],"tags":["avakai","pickle","yellow_cucumber"]}