{"id":14708,"permalink":"http:\/\/www.sailusfood.com\/2013\/12\/23\/kothu-parotta-recipe-salna-muttai\/","title":"Kothu Parotta with Egg","content":"Kothu Parotta ~ Tamil Nadu Street Food\r\n\r\nKothu Parotta with Egg\r\n\r\nHaving blogged Tamil Nadu\/Kerala style parotta and chicken salna, its now time to bring to you an irresistible street food of Tamil Nadu that combines both of them in a mish mash of sorts. I am talking about Kothu Parotta. Kothu Parotta is prepared with mixed vegetables that include carrot, beans and green peas, egg kothu parotta calls for scrambling eggs while chicken kothu parotta has chicken pieces with salna gravy going into it. Whatever the variation, I can tell you that it is a hard to resist fast food.\r\n\r\nShredded Parottas\r\n\r\nKothu means 'minced' in Tamil where the small strips of soft and flaky parottas are coated with a medley of spices and salna (gravy) and pounded into a mince using the edge of a flat spatula. Egg Kothu Parotta or Muttai Parotta is prepared with shredded parotta that is tossed in a sauteed onion-tomato spiced mixture, scrambled eggs and salna. In most restaurants it is served with raita but you can savor the dish without any accompaniment. Its a meal on its own, very filling and full of flavor. To learn more on how it is prepared in restaurants and street food hawkers, do watch the video of Egg kothu parotta recipe.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/12\/muttai-parotta.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/muttai-parotta-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/muttai-parotta-300x300.jpg","style":["easy","quick","modern"],"special-diet":["egg","dairy free","gluten","nut free","kid friendly","pregnancy"],"cuisine":["tamil nadu"],"cook-time":"20","prep-time":"10","main-ingredient":["parotta","eggs","salna"],"serves":"4","author":null,"type":"post","categories":["All Recipes","Indian Snacks and Starter Recipes","South Indian Recipes"],"tags":["egg","parotta","street-foods"]}