{"id":14715,"permalink":"http:\/\/www.sailusfood.com\/2013\/12\/24\/almond-cookies-recipe-eggless-kids\/","title":"Almond Cookies","content":"Almond Cookies ~ Easy Cookie recipes for kids to make this Christmas \r\n\r\nAlmond Cookies\r\n\r\nChristmas to me wouldn't be complete without baking a batch of my favorite rich almond cookies. I always stock on nuts like almonds, walnuts, pistachio and cashew nuts and dried fruits like golden raisins for our family's daily intake of nuts\/dried fruits. All I had to do was reach for the jar of almonds and whip up a batch of cookies to gift this festive season. Let me tell you that they are a breeze to bring together and one of the easy cookie recipes for kids to make this Christmas.\r\n\r\nAlmond cookies before and after baking\r\n\r\nWith almond meal being the star player for this eggless cookie recipe, it can be expensive but if you want something rich and special, almond cookies are the way to go. With minimal ingredients going into its making, almond cookies have a slightly crunchy texture with the almond flavor coming through each bite. They are not overly sweet and make for a great gifting idea. All those celebrating Christmas and looking out to bake some goodies for family and friends, do check out more cookie recipes that I have blogged earlier.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2013\/12\/almond-cookies-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/almond-cookies-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/almond-cookies-recipe-300x300.jpg","style":["easy","quick","modern"],"course":["dessert"],"special-diet":["eggless","dairy","gluten","nuts","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"20","prep-time":"10","main-ingredient":["flour","almonds"],"serves":"12","goes-well-with":["milk"],"author":null,"type":"post","categories":["All Recipes","Cookie Recipes","Eggless Cake &amp; Cookie Recipes","Festival Foods","Flour Recipes"],"tags":["almonds","christmas-cookies","cookies","eggless_cookies"]}