{"id":14729,"permalink":"http:\/\/www.sailusfood.com\/2014\/01\/06\/aloo-matar-recipe-north-indian\/","title":"Aloo Matar ki Sabzi (no onion no garlic recipe)","content":"Aloo Matar ~ North Indian style potatoes and green peas curry (no onion no garlic recipe)\r\n\r\nAloo Matar\r\n\r\nAloo Matar ki Sabzi is one of my most favorite North Indian style recipes that I prepare often during the winter months when fresh green peas are in season. Simple, comforting, warm and delicious with sweet, spicy and tangy flavors!! This no onion no garlic recipe is a rasawala (the consistency of the curry\/gravy is thin) that makes for a perfect accompaniment with roti, puri, stuffed parathas or flavored rice like vegetable pulao or jeera rice. \r\n\r\nRipe tomatoes are crucial so do not make this if you do not have them on hand. Ensure you blanch the tomatoes till the skin wilts and the tomatoes are soft. I like to add the stalks of fresh coriander while the curry is simmering and garnish with the leaves at the time of serving. I served Aloo Matar with Gobi parathas which made for a delectable combination. \r\n\r\nNorth Indian style Aloo Matar ki sabzi with Gobi Paratha\r\n\r\nDo try this easy vegetarian curry when green peas are in season and you are sure to add it to your recipe repertoire. Vegans, you are going to love this recipe. :)\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/01\/aloo-matar-ki-sabzi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aloo-matar-ki-sabzi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aloo-matar-ki-sabzi-300x300.jpg","style":["easy","quick","modern"],"course":["side"],"special-diet":["eggless","nut free","gluten free","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"30","prep-time":"15","main-ingredient":["potatoes","green peas","tomatoes"],"serves":"5","goes-well-with":["roti"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["aloo","curry","indian_vegan_recipe","matar","sabzi"]}