{"id":14728,"permalink":"http:\/\/www.sailusfood.com\/2014\/01\/11\/udupi-tomato-rasam-recipe\/","title":"Udupi Tomato Rasam","content":"Udupi Tomato Rasam ~ Udupi Vegetarian Recipes\r\n\r\nUdupi Tomato Rasam\r\n\r\nUdupi tomato rasam is a perfect winter fare with its aromatic, soothing and warming flavors. I realised that I am yet to blog Amma's signature tomato rasam and I'm not sure how I missed it. Meanwhile I am sharing another favorite rasam with tomato that has its origins in Udupi which is famous for Sri Krishna temple.\r\n\r\nWhile travelling to Karnataka I always look forward to savor authentic traditional Udupi cuisine. I love Udupi style of vegetarian cooking which is purely saatvik where onions and garlic are a no-no. My family and I were fortunate to relish traditional Udupi food at a dear friend's wedding and the food served was an absolute treat to the senses and a delight to the palate. Saatvik food at its best!\r\n\r\nSaaru Podi ~ Udupi Rasam Powder\r\n\r\nUdupi tomato rasam has ripe red tomatoes, cooked tur dal, saaru podi or rasam powder and tamarind as its main players other than the finishing touch of tempering of spices and garnish of coriander leaves. Fresh coconut is also used by most Udupi home cooks. It is the saaru podi which sets this flavorful rasam apart from the everyday rasam. It is a lovely warming soup to sip on a cold dull day or if you are sick with a nagging cough or cold.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/01\/udupi-tomato-saaru.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/udupi-tomato-saaru-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/udupi-tomato-saaru-300x300.jpg","style":["easy","traditional"],"course":["side"],"special-diet":["egg","dairy free","gluten","nut free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["udupi"],"cook-time":"20","prep-time":"15","main-ingredient":["tomato"],"serves":"5","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Mangalorean Recipes","Podi Recipes","South Indian Recipes"],"tags":["rasam","udupi-recipes"]}