{"id":14792,"permalink":"http:\/\/www.sailusfood.com\/2014\/03\/14\/rabri-recipe-easy-sweet-indian\/","title":"Rabri Recipe","content":"Rabri Recipe ~ Easy sweet recipes of India\r\n\r\nRabri aka Rabdi is a classic, traditional Indian sweet. A rich dessert that is a mixture of thickened creamy milk and bits of malai (top of milk) that is lightly sweetened with sugar and flavored with saffron and cardamom powder. The making of authentic rabri recipe is a laborious process that requires cooking full fat milk over a slow flame till it reduces to a thick mixture. The key to a rich and creamy Rabri lies in the quality of milk used and simmering the milk over low flame. Always use full cream milk while making Rabdi.\r\n\r\nRabri (Rabdi)\r\n\r\nMy family relishes chilled creamy Rabdi served over a dollop of ice cream. Yes, you heard right. It is one of the most awesome food combination you can think of. Another favorite of mine is mixed fruit rabri which is super simple to put together especially when you have a party at home. Just chop fruits like apple, pomegranate, grapes, strawberry into bite sized pieces, place them in a bowl, top them with chilled rabri and chopped nuts of your choice and you have a heavenly dessert. Rabri can be served both warm or cold. It is also served with Jalebi, Gulab jamun, Shahi Tukda and Malpua. \r\n\r\nI hope you make this indulgent easy to make sweet to celebrate Holi. :)\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/03\/rabdi-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rabdi-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rabdi-recipe-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","nuts","gluten free","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"120","prep-time":"5","main-ingredient":["milk"],"serves":"8","goes-well-with":["malpua","jalebi"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["festival_sweets","rabdi","rabri","sweets"]}