{"id":14812,"permalink":"http:\/\/www.sailusfood.com\/2014\/03\/19\/matar-kachori-recipe-indian-veg-snack\/","title":"Matar Kachori ","content":"Matar Kachori ~ Indian Veg Snacks Recipes\r\n\r\nMatar Kachori as part of the Holi breakfast platter(Dahi Bhalla, Phirni, Methi Mathri, Namakpare and Gujiya)\r\n\r\nI made Matar Kachori along with Dahi Bhalla and Phirni as part of our brunch platter to celebrate Holi, the Indian festival of colours. Kachoris are savory fried puff pastry with varied fillings based on the region they are prepared and most of them are usually lentil based. The most popular Kachori has a filling of fried urad dal paste and spices called Khasta Kachori. Kachoris are usually served with a thin potato gravy aka dubki wale aloo sabzi or sweet tamarind chutney or as a chaat. I like to eat Kachori on its own over a cup of masala chai. Comforting tea time snack! :)\r\n\r\n\r\nRecipe of Matar Kachori ~ Step by Step\r\n\r\nKachoris like samosas are much loved Indian veg snack among us Indians and it is a common sight to find kachoriwalas selling crisp, hot off the stove kachori around street corners. It does require a bit of an effort to put this veg snack recipe together and I draw my inspiration from the street hawkers who churn out hundreds of kachoris\/samosas each day with effortless ease. :)\r\n\r\nThe filling is very interesting in terms of the spices that go into it. My friends mother adds a dash of sugar to balance the spice factor and says that asafoetida is an essential spice to bring out the lasting flavor of the matar filling. Garam masala and aniseeds (saunf) add the right touch of flavor without tasting overpowering. You can check out the Khasta Kachori recipe that I posted earlier where you will also find a Kachori chaat recipe. If you want to make chaat with Matar ki kachori, just follow that recipe.\r\n\r\nMatar Kachori","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/03\/matar-kachori-snack.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/matar-kachori-snack-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/matar-kachori-snack-300x300.jpg","style":["traditional"],"special-diet":["eggless","nut free","gluten","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"30","prep-time":"45","main-ingredient":["flour","green peas"],"serves":"20","goes-well-with":["tea"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["chaat","indian-food","kachori","snacks"]}