{"id":14833,"permalink":"http:\/\/www.sailusfood.com\/2014\/03\/22\/dahi-bhalla-recipe\/","title":"Dahi Bhalla","content":"Dahi Bhalla ~ Delhi style Dahi Bhalla Chaat\r\n\r\nDahi Bhalla\r\n\r\nFor our Holi brunch, I had prepared Delhi style Dahi Bhalla chaat and it literally transported me to heaven. Love, love dahi bhalla! The flavors of Indian street food are mesmerizingly addictive and very hard to resist. One bite into a dahi bhalla and you will experience an explosion of a diversity of flavors in your mouth. Its undescribable! \r\n\r\nDown South, we make Perugu Garelu (Andhra) and Thayir Vada (Tamil Nadu) where the vadas are soaked in beaten curd and tempered with mustard seeds and curry leaves while the North Indian Dahi Vada and Dahi Bhalla are topped with a colorful array of delicious contrasting flavored chutneys, spice powders and garnishes like sev. The yogurt for Dahi Bhalla is thick, creamy, chilled and sweetened with sugar and poured over the soft vadas. At the time of serving, green chutney and sweet chutney are spooned over them followed by a generous sprinkling of roasted cumin powder, red chili powder, chaat masala, black salt, sev, coriander leaves and finally finished with off with a colorful sprinkle of pink pomegrante seeds.\r\n\r\n\r\n\r\nHow to make Dahi Vada ~ Step by Step\r\n\r\nThe secret to soft and melt in the mouth bhallas or vadas lies in beating the vada batter till light and airy. The consistency of the batter is extremely important and will decide how soft the vadas will turn out. And you should use the beaten batter immediately to prepare the vadas. Use fresh thick curd that is not sour. Do make the green chutney and sweet tamarind chutney a day ahead to easen your preparation process. I have blogged the recipes of both the chutneys earlier. So are you going to give Dahi Bhalla recipe a try? :)\r\n\r\nDahi Bhalla Chaat","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/03\/dahi-vada-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dahi-vada-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dahi-vada-recipe-300x300.jpg","style":["easy","traditional"],"course":["starter"],"special-diet":["eggless","nut free","gluten free","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"20","prep-time":"60","main-ingredient":["urad dal","yogurt"],"serves":"20","author":null,"type":"post","categories":["All Recipes","Festival Foods","Indian Festivals","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["chaat","dahi","dahi bhalla","snacks","starter"]}