{"id":14843,"permalink":"http:\/\/www.sailusfood.com\/2014\/06\/27\/how-to-make-pizza-home\/","title":"How to make Pizza at home","content":"How to make pizza at home - Italian Food\r\n\r\nI have received a lot of requests to post homemade pizza recipe from scratch. I never buy store bought pizza base to make pizza as its a breeze to make the base. For those of you who want to learn how to make pizza at home, I have for you an easy pizza dough recipe that has never failed me. Many are intimidated to make pizza from scratch. Let me tell you that homemade pizza recipe is one of the easiest you can ever make and once you get down to making your own pizza at home, you will never buy ready made pizza base or order another takeaway. I guarantee. :)\r\n\r\nThe recipe that I follow is a no frills, an easy to make and 'no rise' pizza dough that can be prepared in less than an hour from start to finish. I prepare pizza sauce as and when I require in small portions. I like to add dried Italian herbs to the pizza dough which makes the pizza more flavorful. I usually like to make a thin crust pizza hence roll out the dough as thin as possible. The crust is crisp on the outside and chewy on the inside.\r\n\r\nHomemade Pizza\r\n\r\nHomemade pizza dough ~ Rolled out dough\r\n\r\nHomemade pizza sauce spread & grated mozarella cheese sprinkled\r\n\r\nColored bell peppers and basil toppings and some more grated cheese just before baking\r\n\r\nHome Made Vegetarian Pizza\r\n\r\nA favorite topping of mine is placing tomato slices all over the base and liberally sprinkle mozarella cheese and Italian herb seasoning. Simple and extremely flavorful. What are you favorite pizza toppings? Do share via the comment box. :)\r\n\r\nMy favorite topping ~ Tomato Pizza","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/06\/easy-pizza-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/easy-pizza-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/easy-pizza-recipe-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","nut free","gluten","dairy free","vegetarian","kid friendly","pregnancy"],"cuisine":["italian"],"cook-time":"15","prep-time":"60","main-ingredient":["flour","tomato","cheese"],"serves":"4","author":null,"type":"post","categories":["All Recipes","Flour Recipes","Italian Food","Lunch Box Recipes"],"tags":["italian","pizza"]}