{"id":14877,"permalink":"http:\/\/www.sailusfood.com\/2014\/06\/18\/bel-ka-sharbat-recipe-maredu-drink\/","title":"Bel Ka Sharbat, Maredu Drink, How to make Bel syrup","content":"Bel Ka Sharbat, Maredu Drink, How to make Bael Syrup - Summer Drinks\r\n\r\nAlong with Nannari syrup, I also prepared a batch of Bel Syrup since it is a healthy thirst quencher, filled with nutritional goodness. The Bael tree is considered sacred in Hinduism where the leaves and fruit are used to worship Lord Shiva.  Bael fruit (Botanical name ~ Aegle marmelos), also known as Stone Apple, Bael Pathar, Vilvam (Tamil), Bilva (Hindi) and Maredu pandu (Telugu) is packed with nutrition, helps cure acidity, ulcers, gastric disorders and helps to cool and detoxify the body. In fact, every part of Bael tree is useful, the roots and leaves are used to treat skin infections and stomach ailments. \r\n\r\nBel Ka Sharbat\r\n\r\nMost people prepare Sharbat using the ripe fruit. One can also prepare Sharbat using bel syrup that is prepared from dried Bel fruit. Bel syrup preparation is similar to Nannari syrup preparation. It is slightly labor intensive but simple. Basically you wash the dried Bael aka Maredu thoroughly and soak in water overnight. Next day morning the dried bel is boiled along with the soaked water till it reduces to half the original quantity. The resultant mixture is strained and further boiled with sugar till it becomes slightly thick brown colored mixture. To prepare Bel Ka Sharbat, pour 3 heaped tablespoons of the prepared Bel syrup into a tall glass, add 1 tbsp of lemon juice and pour chilled water to the brim. Add ice cubes and serve. \r\n\r\nIf you want to prepare Bel ka Sharbat using the ripe fruit, all you need to do is break open a bel and scoop out the pulp using a spoon. Soak the pulp in a cup of water for a few minutes and use your hands to squish the pulp. Strain to remove the seeds and discard them. Blend the bael pulp to a smooth mixture. Add add sugar or jaggery as per taste, roasted cumin powder, pinch of black salt, chilled water to the blended pulp, mix well. Pour into tall glasses, add ice cubes and serve.\r\n\r\nMaredu ~ Dried Bael Fruit\r\n\r\nMaredu aka dried Bael is usually available at any local Ayurveda medical stores. In Vizag, Maredu (in its dried form) is available at Pachipulusu Venkata Sannaiah & Sons and Sri Sambasiva Ayurvedic Centre in Kurupam Market. You can even buy ready made Bel syrup from Ayurveda medical stores. In Vizag, Maredu drink is prepared by juice vendors in their push carts especially in Kurupam Market area, near CBM High School and Seethammadhara.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/06\/bael-sharbat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bael-sharbat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bael-sharbat-300x300.jpg","style":["easy","traditional"],"course":["beverage"],"special-diet":["eggless","nut free","gluten free","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"180","prep-time":"1200","main-ingredient":["maredu","bael"],"serves":"30","author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["bel","drinks","maredu","summer-drink"]}