{"id":14873,"permalink":"http:\/\/www.sailusfood.com\/2014\/06\/17\/nannari-sarbath-recipe-sugandhi-drink\/","title":"Nannari Sarbath Recipe, Sugandhi Drink, How to make Nannari Syrup","content":"Nannari Sarbath (Sugandhi Drink) - How to make Nannari Syrup\r\n\r\nI have been away from the blog and social media since early April. Last week, my family and I got home from a wonderful rejuvenating vacation only to be welcomed by the scorching summer heat. We are experiencing one of the worst summers with Vizag reeling under a heat wave with no sign of respite. Desperately praying to the the rain Gods to bring in some relief. All I do is drink copious amount of chilled drinks like lassi, buttermilk, fresh fruit juice, homemade sherbet and tender coconut water. :) Traditional herbal drinks with no preservatives or artificial colors are the best thirst quenchers during the scorching hot days. \r\n\r\nNannari Sarbath aka Sugandhi Drink\r\n\r\nI prepared Nannari (Sarsaparilla roots) syrup as well as Maredu syrup (Bael fruit) to help us get through the hot summer. In Coastal Andhra we call the aromatic Sarsaparilla roots as Sugandhi and in the Rayalaseema region as well Tamil Nadu and Kerala, it goes by the name Nannari. Nannari is a very pleasant smelling herb and is known for its medicinal properties. Its an excellent diuretic, body coolant that prevents sunstroke and purifies  blood.\r\n\r\nToday, I am sharing with you Nannari Sarbath preparation that is slightly laborious yet simple. Basically you have to pound the washed Sarsaparilla roots so that the central portion (white pith) is discarded and the outer skin is sun dried for a day. These roots are soaked in  water overnight. Next day morning the roots are boiled along with the soaked water till it reduces to half the original quantity. The resultant mixture is strained and further boiled with sugar till it becomes slightly thick and sticky honey colored mixture. To prepare Nannari sarbath, pour 3 heaped tablespoons of the Nannari syrup into a tall glass, add 1 1\/2 tbsps of lemon juice and pour chilled water to the brim. Add ice cubes and serve. \r\n\r\nNannari aka Sarasaparilla Roots\r\n\r\nSugandhi aka Nannari roots are usually available at any local Ayurveda medical stores. In Vizag, the roots are available at Pachipulusu Venkata Sannaiah & Sons and Sri Sambasiva Ayurvedic Centre in Kurupam Market. You can even buy the Nannari syrup aka Sugandhi syrup from Ayurveda medical stores.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/06\/nannari-syrup.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nannari-syrup-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nannari-syrup-300x300.jpg","style":["easy","traditional"],"course":["beverage"],"special-diet":["eggless","nut free","gluten free","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"180","prep-time":"1200","main-ingredient":["nannari roots"],"serves":"30","author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["nannari","sarbath","sugandhi","summer-drink"]}