{"id":14887,"permalink":"http:\/\/www.sailusfood.com\/2014\/06\/20\/rooh-afza-lemonade-cold-drinks-recipes\/","title":"Rooh Afza Lemonade","content":"Rooh Afza Lemonade, Cold Drinks Recipes\r\n\r\n\r\n\r\nDuring my childhood, whenever I visited our Muslim neighbors or a few of my North Indian friends during the summer months, I was invariably treated to a chilled tall glass of Rooh Afza or Rooh Afza Lemonade. Initially, the flavor was too strong for me but over time, I began to like the flavor and tried different flavored drinks with Rooh Afza. There are many variety of drinks one can prepare using Rooh Afza syrup. You can even drizzle a tablespoon of blood red colored Rood Afza syrup on desserts like puddings, milkshakes, custard and ice cream. Not only does it look visually appealing but also elevates the flavor. If you want to prepare Rose milk and do not have rose essence or rose syrup on hand, you can use Rooh Afza syrup as an alternate. \r\n\r\nFor those of you who are not aware of Rooh Afza, it is a exotic concoction of natural herbs, extracts of fruits like orange and pineapple, mint, spinach, rose petals, coriander seeds and other natural ingredients. It is known for its soothing and healing properties and protects one from heat exhaustion and sun stroke. It has a cooling effect on the body and keeps one refreshed, active and energetic. Rooh Afza concentrate is available in most departmental stores.\r\n\r\nI like to add a few slices of lemon or orange and crushed mint leaves to a jug of chilled Rooh Afza water and allow to steep for sometime in the fridge. You can even add chopped fruits of your choice like watermelon and apple for variation. \r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/06\/roohafza-sharbat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/roohafza-sharbat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/roohafza-sharbat-300x300.jpg","style":["easy","quick","modern"],"course":["beverage"],"special-diet":["eggless","nut free","gluten free","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["indian"],"prep-time":"5","main-ingredient":["rooh afza","lemon juice"],"serves":"1","author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["lemonade","rooh afza","summer-drink"]}