{"id":14883,"permalink":"http:\/\/www.sailusfood.com\/2014\/06\/19\/rose-milk-recipe-summer-drinks\/","title":"Rose Milk Recipe, How to make Rose syrup","content":"Rose Milk Recipe, How to make rose syrup, Summer Drinks Recipes\r\n\r\nRose Milk\r\n\r\nContinuing on my summer drinks spree, today its homemade rose syrup recipe and rose milk recipe. Sweet and summery with a mild floral aroma, homemade rose syrup is a must have pantry staple during the hot summer months. All you need to do is mix the rose syrup with chilled milk or almond milk and you have an exotic flavored summer drink on hand. In fact, if you are throwing a get together or party, gulab sharbat or rose milk would make an ideal party drink. Rose syrup is also an essential ingredient for the famous dessert Falooda, the recipe of which I will be sharing soon. :)\r\n\r\nYou can even buy store bought rose syrup or another alternate is to use rose essence and rose water instead of rose syrup. For a rich flavored rose milk, add some heavy cream. I like to add ground almond paste to the chilled rose milk for a richer flavor. In Rajamundry (East Godavari district), there is a shop by name Rose Milk that was established in 1950 and is a hot favorite among the locals. Here, rose milk is served in different avatars and a favorite of mine is the version made with Palkova (very soft doodh peda), rose syrup and chilled milk. Absolutely rich and addictive. This shop even sells bottles of rose syrup concentrate. Travelling through Tamil Nadu, I found that most towns and cities have juice stalls selling rose milk that is in great demand as well as Jil Jil Jigarthanda (close to Falooda) that is a popular Madurai special and a favorite of mine. \r\n\r\nSummer Drinks ~ Rose Milk Recipe\r\n\r\nIf you are yet to try making rose syrup at home, I urge you to give it a try and prepare this flavorful rose milk recipe for your kids, family and friends. An ideal drink to beat the heat during the hot summer months. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/06\/rose-milk.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rose-milk-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rose-milk-300x300.jpg","style":["easy","traditional"],"course":["beverage"],"special-diet":["eggless","nut free","gluten free","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["Indian"],"cook-time":"30","prep-time":"360","main-ingredient":["organic rose petals","sugar","milk"],"serves":"30","author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["rose-milk","rose-syrup","summer-drink"]}