{"id":14908,"permalink":"http:\/\/www.sailusfood.com\/2014\/07\/15\/neer-dosa-recipe\/","title":"Neer Dosa Recipe","content":"Neer Dosa Recipe with Chicken Curry (Mangalore style)\r\n\r\nNeer Dosa with Mangalore Chicken Curry\r\n\r\nEver since I posted Mangalorean egg curry that I served with Neer Dosa, I have been bombarded with requests to post Neer Dosa recipe. Last weekend, I prepared Neer Dosa and served it with Mangalore chicken curry. Neer dosa, a Karnataka breakfast fare, literally means 'water crepe' since the batter is of flowing watery consistency. Neer in Kannada and Tulu language means water. \r\n\r\nThese white, light, lacy paper thin crepes are popular not only for the flavor but for the simple preparation and lack of fermentation. My Konkani friends gave me some tips on how to prepare neer dosa (called panpole in Konkani) that does not stick to the pan which I have listed in the 'Tips' section below the Neer dosa recipe. The vegetarians enjoy Neer dosa with spicy tomato chutney or coconut chutney, saagu, sambar, rasayana (mango with coconut milk) and a sweet mixture of jaggery and fresh coconut. The non-vegetarians enjoy it with chicken\/mutton\/fish\/egg curry, egg roast or chicken\/mutton\/prawn sukka. One can enjoy these dosas even after they turn cold. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/07\/neer-dosa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/neer-dosa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/neer-dosa-300x300.jpg","style":["easy","traditional"],"course":["breakfast"],"special-diet":["eggless","gluten free","vegetarian","vegan","nut free","kid friendly","pregnancy"],"cuisine":["mangalore"],"cook-time":"20","prep-time":"15","main-ingredient":["rice"],"serves":"10","goes-well-with":["chicken curry"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Konkani Recipes","Mangalorean Recipes","South Indian Recipes"],"tags":["dosa","dosa-batter","konkani_recipes"]}