{"id":14948,"permalink":"http:\/\/www.sailusfood.com\/2014\/08\/26\/rice-flour-how-to-make-rice-flour\/","title":"Rice Flour - How to make Rice flour at home","content":"Rice Flour - How to make rice flour at home to prepare snacks\r\n\r\nRice flour aka biyyam pindi (Telugu) is an 'essential' ingredient in a South Indian kitchen. So what can you do with rice flour? This gluten free flour is used to prepare snacks (pindi vantalu) like murukku, jantikalu, palakayalu etc and prasadam (offering to God) like kudumulu, undrallu, appalu, ammini kozhukottai etc. After receiving repeated requests for recipe of rice flour to make snacks, I captured pictures of the entire process as I was making a large batch for Ganesh Chaturthi recipes. Extremely simple but takes a bit of effort. :)\r\n\r\nRice flour made at home\r\n\r\nThe rice needs to be soaked for a minimum of one hour. I'd suggest 2 to 3 hours of soaking time as it yields a softer flour. Use any good quality raw white rice like sona masuri. Ensure you dry the rice on cotton cloth in the shade till it is almost dry with a bit of moisture. I usually place a newspaper on the floor, spread the cotton cloth over the paper and then spread the drained rice as a thin layer.\r\n\r\nRice drying in the shade ~ Dried rice ground in a mixer grinder\r\n\r\nRice flour being sieved ~ Residue rice rava (coarsely ground rice)\r\n\r\nAfter sieving the rice flour, the residue coarse rice rava can be further ground to a smooth flour or used to make recipes that call for rice rava (coarsely ground rice). A small batch of rice flour can be made at home while large quantities (more than 1 kg) can be sent your neighbourhood flour mill. Usually, I prepare biyyam pindi with 1 kg rice during festivals like Ganesh Chaturthi to prepare naivedhyam (offering to God).\r\n\r\n\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/08\/rice-flour.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rice-flour-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rice-flour-300x300.jpg","style":["easy","traditional"],"special-diet":["eggless","gluten free","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["indian"],"prep-time":"90","main-ingredient":["rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Flour Recipes","Indian Festivals","Indian Vegan Recipes","South Indian Recipes"],"tags":["rice","rice flour"]}