{"id":14992,"permalink":"http:\/\/www.sailusfood.com\/2014\/09\/16\/rajma-sundal-navarathri-recipes\/","title":"Rajma Sundal","content":"Rajma Sundal - Sundal Varieites for Navarathri (Dasara festival)\r\n\r\nRajma Sundal\r\n\r\nNavratri is round the corner and its time for Sundal. Rajma Sundal recipe is an easy to make and tasty neivedhyam among the sundal varieties for Navarathri. It can be eaten as a light meal anytime be it breakfast or an evening snack. Rajma or black beans need to be soaked in lots of water overnight, washed thoroughly in fresh water before being pressure cooked till soft. Ensure you use good quality rajma.\r\n\r\nSundal is a South Indian savory snack prepared with legume and dal varieties like kabuli chana (white chickpeas), kala chana (black chickpeas), black eyed peas (lobia), rajma (black beans), peanuts, battani (dried peas), chana dal, green gram and sweet corn. Soaked and cooked legumes are tempered with spices, curry leaves, green chilies and garnished with fresh coconut. There is another version of sundal where a spiced powder (masala\/kura podi)) of roasted chana dal, cumin seeds, coriander seeds, fennel seeds and red chilis is sprinkled over the tempered sundal.  Sprinkle this masala powder over the prepared Rajma sundal and your Rajma Masala Sundal is ready. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2014\/09\/rajma-sundal-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rajma-sundal-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rajma-sundal-recipe-300x300.jpg","style":["easy","traditional"],"course":["snack"],"special-diet":["eggless","gluten free","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"5","prep-time":"20","main-ingredient":["rajma"],"serves":"5","author":null,"type":"post","categories":["All Recipes","Festival Foods","Indian Festivals","Indian Vegan Recipes","Indian Vegetarian Recipes","Navratri Recipes","South Indian Recipes"],"tags":["festival","rajma","sundal"]}