{"id":15010,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/13\/idli-recipe-idli-batter-recipe\/","title":"Idli recipe - the perfect idli batter recipe for soft and fluffy idlis","content":"idli recipe - perfect idli batter recipe for soft idlis using idli rava (cream of rice) and urad dal\r\n\r\nI have received requests me to blog a detailed post on idli recipe with tips on how to make soft idlis that are fluffy and melt in the mouth. I did post an idli recipe earlier on my blog but this time around, I am sharing an elaborate post with step by step photos. Let me mention at the outset two factors regarding the making of idlis at our home. I use idli rava (cream of rice) instead of parboiled rice or idli rice and I do not use a wet grinder for grinding the idli batter. In most Andhra homes, idli rava is preferred over idli rice. If you are looking for an idli recipe using idli rice or parboiled rice, I will blog it over the next few weeks. \r\n\r\nidli with sambar and idli podi ~ our Breafast\r\n\r\nIdli is one of the best breakast recipes from India and its a popular tiffin item in our home. Idli is basically steamed rice cake prepared with fermented batter of rice and black gram dal. It is a popular breakfast food in the four states of South India since its light on the stomach and easy to digest. We make idlis at least 3 to 4 times a week either for breakfast or an early dinner. The best side with idli is tiffin sambar followed by coconut chutney and idli podi smeared with a dash of ghee or gingelly oil. Having said that, idli tastes equally good with a variety of pachadis and podis.\r\n\r\nwhole skinned urad dal ~ rice rava (cream of rice)\r\nsoaked and drained urad dal ~ soaked rice rava squeezed of all the water\r\nground urad dal batter ~  urad dal batter and rice rava before mixing\r\nidli batter before and after fermentation\r\nidli batter poured into idli moulds and idlis steamed in idli cooker\r\n\r\nIdli recipe Andhra style - I am sharing a few tips to follow while making this idli with idli rava. \r\n\r\n1) The quality of urad dal used to make idli is extremly important. I cannot emphasis enough the importance of fresh, high quality whole skinned ural dal. If you use good quality urad dal, you are sure to make perfect soft idlis.\r\n2) I use a mixer grinder to make my idli batter and it works out perfect. \r\n3) I use my hand to mix urad dal batter and idli rava instead of a spoon\/ladle. It ensures better fermentation.\r\n4) If you are using refrigerated idli batter, always bring it to room temperature, add salt and mix before spooning it into the moulds. \r\n5) Proper fermentation is essential. In tropical countries like India, fermentation is a breeze. During summers, less than 7 hours is enough for the batter to ferment while winter it might take 10-12 hours.\r\n6) In extreme cold climate, its advisable to place the batter in an oven with the light on. It might take more than 15 to 20 hours to ferment.\r\n7) Idli rava is not to be mistaken for rice rava or coarsely ground rice (called biyyam rava in telugu) or sooji aka semolina. It has a finer and softer texture compared to semolina though it looks similar to fine semolina. It absorbs a lot of water during soaking so ensure you squeeze out the water completely from the idli rava before adding it to the urad dal batter.\r\n \r\nI will try my best to answer readers queries on the making of soft idlis and help you nail the perfect fool proof idli batter for soft idlis. :)\r\n\r\na) \"why are my idlis sticky\" -  if you add too much water while grinding the urad dal, you will have a very flowy batter yielding sticky idlis. The batter has to be just right, neither too flowy nor too thick. \r\nb) \"why are my idlis hard\" - if the urad dal batter is too thick, it will yield hard idlis. Also do not beat the fermented batter too much. Just mix lightly 4 to 5 times. Over steaming or over cooking of idlis can yield hard idlis. When the quantity of urad dal is less in proportion to the quantity of idli rava, it yields hard idlis. \r\nc) \"why are my idlis flat\" - if you add too much water while grinding the urad dal it will result in a watery batter yielding flat idlis. When the quantity of urad dal is more in proportion to the quantity of idli rava, you will get flat but soft idlis.\r\nd) \"how to ferment idli batter\" - use your clean hands to mix urad dal batter and rice rava in a stainless steel vessel. It aids in fermentation. Place the lid and keep the vessel in a warm area of your kitchen for at least 8 hours. It may take 10-12 hours for fermenting during winter. In very hot climatic conditions, fermention takes less than 7 hours and it will turn sour if you ferment it beyond 7-8 hours. Once fermented, refrigerate till use. For very cold climates, I'd suggest you cover the vessel with a thick woolen cloth or shawl and place it close to your cooking zone. Those of you who have an oven, switch on the light and place the batter in the oven. Do not preheat the oven. Just switch on the light of the oven and the heat of the light will aid fermentation.\r\ne) \"how to know if idli batter is fermented\" - the fermented batter will increase by atleast 50% of its original volume with a distinct fermented sour smell. It will be light and foamy and as you spoon the fermented batter and pour it into the idli mould, it will fall like a blob.\r\ng) \"why is my idli batter not fermenting\" -  it could be due to a couple of reasons like cold weather, bad quality urad dal or idli rava, loose or runny idli batter and incorrect ratio of urad dal and idli rava.\r\nh) \"how to know if idli is cooked\" - wet your finger and touch the top of the idli, if it sticks, you need to steam it further. If it does not stick to your finger and a toothpick or knife inserted into the idli comes through clean, it means the idli is cooked.\r\n\r\nidli made with idli rava and served with sambar","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/idli-with-idli-rawa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idli-with-idli-rawa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idli-with-idli-rawa-300x300.jpg","style":["easy","quick","traditional"],"course":["breakfast"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"15","prep-time":"120","main-ingredient":["urad dal","idli rava"],"serves":"32","goes-well-with":["chutney","sambar"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Breakfast Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["breakfast","idli","idli-batter","tiffin"]}