{"id":15026,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/18\/tiffin-sambar-recipe-best-sambar-recipes\/","title":"Tiffin sambar recipe ","content":"Tiffin sambar recipe - one of the best sambar recipes for tiffins like idli, dosa, pongal\r\n\r\nbest tiffin sambar\r\n\r\nI am surprised that it took me so long to blog tiffin sambar recipe. Sambar is an integral part of South Indian cuisine and there are innumberable variations with some of the best sambar recipes out there based on the state\/region and community they are prepared. I have already blogged sambar recipe as well as an authentic sambar powder recipe. The sambar that I have blogged earlier is best served with rice but it can also be served with tiffins like idli or dosa. The aromatic sambar powder is an essential part of the sambar which is served with rice and is slightly thicker and tangier than tiffin sambar. \r\n\r\ntiffin sambar for idli, dosa and pongal\r\n\r\nFor today's tiffin sambar recipe, jaggery or red pumpkin, asafoetida, shallots and tomatoes are essential. In many homes, tiffin sambar is made with only moong dal while few others use a combination of two to three types of dals. I have used both tur dal and moong dal. Quite a few do not use sambar powder and tamarind but I have added tamarind as the tomatoes I had on hand were more on the sweeter side. I usually add a carrot or drumstick to increase the nutrition profile of the sambar. Vegetables are not essential for tiffin sambar except for shallots and tomatoes. \r\n\r\nIf you are looking for a good recipe of idli sambar, then look no further. It tastes awesome with mini idlis when drizzled with hot ghee. While serving mini idlis, place them in a slightly deep serving bowl, dunk them in a liberal amount tiffin sambar, drizzle melted ghee and garnish with fresh coriander leaves. Your kids will relish it and so will you. :) ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/idli-sambar-e1424258623103.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idli-sambar-e1424258623103-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idli-sambar-e1424258623103-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"35","prep-time":"30","main-ingredient":["moong dal","tur dal","tamarind"],"serves":"5","goes-well-with":["idli","dosa","pongal"],"author":null,"type":"post","categories":["All Recipes","Indian Dal Recipes","Indian Lentil Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["easy-vegetarian-recipes","sambar","tiffin"]}