{"id":15030,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/16\/godhuma-rava-payasam-cracked-wheat-kheer\/","title":"Godhuma rava payasam","content":"godhuma rava payasam - cracked wheat kheer, recipes for festivals, Maha Shivaratri prasadam\r\n\r\ngodhuma rava payasam\r\n\r\nI have received requests to post recipes for festivals like Maha Shivaratri, Navratri, Ganesh Chaturthi. Tomorrow is Maha Shivaratri (17th February, 2015) and am fasting. Down South we eat grains during fasts unlike in North India. I usually like to make recipes that are subtly spiced, not too sweet and with minimal ingredients. Godhuma rava payasam is a fairly simple prasadam, a breeze to make and not to mention, comforting. \r\n\r\nThe main ingredients in this particular payasam are cracked wheat aka broken wheat and jaggery. Cracked wheat goes by the name godhuma rava in telugu, daliya in hindi, gothumai ravai in tamil and gothambu rava in malayalam. Sweetener of choice is jaggery but sugar can also be used or a combination of both. Vegans can use almond milk or coconut milk. If you have any left over payasam, refrigerate. At the time of serving, add some warm milk, mix over low flame and its as good the day it was prepared. But keep in mind, milk based desserts do not have a long shelf life and its best to refrigerate and eat within 2-3 days of preparation. There are a few variations to cracked wheat kheer. I will also blog another version which calls for the addition of yellow moong dal and coconut milk. \r\n\r\nIf you are looking for festival food items or prasadam to offer God, godhuma rava payasam fits the bill. :)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/cracked-wheat-kheer.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/cracked-wheat-kheer-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/cracked-wheat-kheer-300x300.jpg","style":["easy","quick","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"50","prep-time":"10","main-ingredient":["cracked wheat","jaggery"],"serves":"5","author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Sweets Recipes","Indian Vegetarian Recipes","Navratri Recipes","South Indian Recipes","Sweet Dessert Recipes"],"tags":["diwali-sweets","festival","festival_sweets","payasam","sweet","wheat"]}