{"id":15035,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/17\/sabudana-vada-recipe-sabudana-recipes\/","title":"Sabudana vada recipe","content":"sabudana vada recipe - sagubiyyam vadalu, javvarisi vadai - sabudana recipes for fasting days\r\n\r\nsabudana vada recipe for fasting days \r\n \r\nSabudana vada recipe is an addictive, tasty and easy to make Indian snack. It is a popular Maharashtrian snack prepared with sago aka tapioca pearls and is made during for fasting days (vrat). Down South it is called sagubiyyam vadalu in telugu and javvarisi vadai in tamil. Roasted peanuts is an essential ingredient in sabudana vada which has a crispy exterior and a soft interior. Its a perfect fasting food to make during vrat if the entire family is on fast keeping in mind it is a kid friendly snack. It can also be served as finger food\/starter for parties or as an evening snack with a cup of chai. \r\n\r\nWhile preparing sabudana vada recipe, ensure you use good quality medium or large sized sago pearls and do not soak them in water. If soaked in water, they will asborb a lot of oil while being deep fried. Its best to allow the washed sago to sit in a few tablespoons of water for one or two hours. Do check out more sabudana recipes for fasting days like Mahashivaratri or Navratri.\r\n\r\nsago vada\r\n\r\nFind below sabudana vada recipe with easy to follow steps and tips to make it crispy.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/sago-vada.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sago-vada-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sago-vada-300x300.jpg","style":["easy","traditional"],"course":["snack"],"special-diet":["eggless","dairy free","nuts","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["maharashtrian"],"cook-time":"20","prep-time":"20","main-ingredient":["sago","potato"],"serves":"18","goes-well-with":["chutney"],"author":null,"type":"post","categories":["All Recipes","Festival Foods","Indian Festivals","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Maharashtrian Recipes","Navratri Recipes"],"tags":["maharashtrian","sabudana","sago","snack","vada"]}