{"id":15040,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/19\/paneer-recipe-how-to-make-paneer\/","title":"Paneer recipe","content":"Paneer recipe - how to make paneer at home that is fresh and soft\r\n\r\npaneer\r\n\r\nI have quite a few queries and requests from readers asking for tips on how to make paneer that is soft. In fact two days ago, a reader of Sailu's Kitchen Facebook fan page asked me \"soft paneer kaise banta hai\", meaning how to make soft paneer. I felt its time for a post on the making of homemade paneer. :)\r\n\r\nPaneer is an unsalted white Indian cottage cheese that is used in a range of Indian dishes. Paneer recipe is the simplest and easiest dish one can ever make. Homemade paneer is the best as its fresh and soft. If you have been buying store bought paneer, I urge you to try making your own paneer at home as there is a lot of difference in texture and taste. Full fat milk that is boiled is curdled by adding an acidic medium like yogurt or lemon juice and the resultant milk solids are drained of all its liquid before it is set to harden. The best curdling agent is curd aka yogurt as it yields soft and creamy paneer compared to the paneer prepare with lemon juice or vinegar. \r\n\r\nIf I have to prepare paneer recipes like paneer kheer, rasgulla and rasmalai, I allow the excess liquid to drain completely and use it right away (i.e after Step 7 below) To prepare dishes like paneer burji, paneer kulcha, paneer paratha etc, I place a weight over the drained chenna for only 10 mts so that it holds shape and some moisture is retained in the paneer. For dishes like paneer butter masala, matar paneer, palak paneer or any gravy based dishes or chilli paneer, I place a weight over the drained chenna for a longer period of approx 30 to 45 minutes so that it fully sets and is easy to cut into any shape of our choice.\r\n\r\nYou can prepare flavored paneer by adding spices and herbs of your choice while making the paneer recipe. At the time of curdling the milk, you can add finely chopped mint leaves or coriander leaves or crushed black pepper or red chili flakes. You can even add cumin seeds, kasuri methi, roasted garlic or Italian herbs. \r\n\r\nPaneer Recipe - follow the step by step photos to make paneer at home with easy instructions \r\n\r\nboiled milk ~ adding curd to boiled milk\r\n\r\nmild curdled ~ whey (left over liquid after curdling milk)\r\n\r\naddition of ice cubes to stop cooking of milk solids ~ curdled milk solids ( chenna)\r\n\r\npaneer tied in muslin cloth to drain excess liquid ~ paneer drained of all liquid\r\n\r\nheavy weight placed over paneer ~ homemade fresh paneer","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/homemade-paneer.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/homemade-paneer-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/homemade-paneer-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"10","prep-time":"45","main-ingredient":["milk","curd"],"serves":"4","author":null,"type":"post","categories":["All Recipes","Indian Milk Recipes","Indian Paneer Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["cottage-cheese","paneer","vegetarian"]}