{"id":15054,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/20\/chocolate-sandesh-recipe\/","title":"Chocolate Sandesh recipe","content":"chocolate sandesh recipe - bengali sweets recipe for festivals, desserts to serve kids at a party\r\n\r\nWe are fans of bengali sweets especially sandesh aka sondesh, basundi, rasgulla, rasmalai and misti doi. Bengalis are the epitome of hospitality and we are lucky to have friends who serve us the most enticing, delicious bengali sweets like there is no tomorrow. :) \r\n\r\nchocolate sandesh\r\n\r\nSandesh is a soft on bite sweet fudge prepared with fresh chenna. It is prepared for special occasions and festivals like Durga puja and Diwali. There are many variations to the basic sandesh recipe in terms of flavor and texture, and is beautifully colored and moulded to different shapes and sizes. I love the versatility of sandesh and a popular variation is chocolate sandesh. If you are looking at desserts to serve kids at a party, you  should be looking at giving chocolate sandesh recipe a try. \r\n\r\nboiled full fat milk ~ curdled milk\r\n\r\nstrained milk solids ~ chenna being drained of all liquid\r\n\r\nchenna\r\n\r\nFresh chenna is the most important part of making sandesh and I have shared detailed instructions including step by step photos on how to make chenna in this blog post even though I posted the paneer recipe earlier (fresh chenna that is drained of all its liquid and allowed to set under a heavy weight yields paneer). You can use cocoa powder, drinking chocolate or melted chocolate to make chocolate sandesh recipe.\r\n\r\nchocolate sandesh ~ perfect diwali sweet\r\n\r\nFollow the instructions on how to make chocolate sandesh ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/chocolate-sandesh-bengali-sweet.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-sandesh-bengali-sweet-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-sandesh-bengali-sweet-300x300.jpg","style":["easy"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["bengali"],"cook-time":"10","prep-time":"40","main-ingredient":["chenna","cocoa powder"],"serves":"5","author":null,"type":"post","categories":["All Recipes","Bengali Food Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["Bengali Food Recipes","chenna","diwali-sweets","festival_sweets"]}