{"id":15067,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/22\/khoya-recipe-how-to-make-khoya-at-home\/","title":"Khoya recipe","content":"khoya recipe - how to make khoya at home, unsweetened khoya recipe \r\n\r\nkhoya (mawa)\r\n\r\nKhoya recipe is one of the easiest dish to prepare but it is labour intensive. :) You do require a lot patience to allow the milk to thicken with no moisture left. Khoya is pronounced differently in different parts of the country. Down South, khoya in telugu is 'kova' or 'khoa, khoya in tamil, kannada and malayalam is also 'kova' and another name for khoya in hindi is mawa especially in western states of India like Rajasthan. \r\n\r\nThe main and only ingredient to make khoya recipe is full fat milk. Unsweetened khoya is nothing but thick milk solids that are formed by boiling and stirring milk on low flame for a long duration of time. Usually a liter of milk will take more than 2 hours to transform into khoya or mawa. There are three different textures of khoya according to the moisture content that it contains. Khoya in its softest state, with maximum moisture and loose consistency, is called dhapa or chickna (chikna) which is used to make gulab jamun and rabri. Khoya which is slightly firmer with less moisture and quite grainy in appearance is called danedar and is used to make Indian sweets like kalakand and milk cake. The firmest khoya with no moisture is hard and usually moulded or shaped into small bricks called pindi that is used to make sweets like burfi and laddu.\r\n\r\nHow much khoya do we get from 1 litre milk? You will get about 230 gms to 250 gms of khoya. For those who want to know the measurement of khoya, 1 cup khoya in grams is 200 to 225 (gms). It is best to make khoya at home as store bought is quite expensive and sometimes adulterated. Khoya shelf life is around a week in the refrigerator. Once khoya reaches room temperature, refrigerate it until use.\r\n\r\nboiling milk ~ thickened milk\r\n\r\nthickened milk solids at different stages\r\n\r\nkhoya\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/khoya-mawa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/khoya-mawa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/khoya-mawa-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"150","prep-time":"5","main-ingredient":["milk"],"serves":"5","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Indian Vegetarian Recipes","Navratri Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["diwali-sweets","festivals","indian-food","milk-fudge"]}