{"id":15066,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/11\/shahi-paneer-recipe\/","title":"Shahi Paneer Recipe","content":"shahi paneer recipe - restaurant style recipe of shahi paneer \r\n\r\nshahi paneer\r\n\r\nYesterday, I made Shahi paneer to go with homemade kulcha for dinner. I usually make a large batch of paneer and freeze the cubed paneer in ziplock bags. As and when I require, I thaw a batch of paneer, place the paneer cubes in warm water and am good to go. To learn how to make paneer from scratch, follow the paneer recipe I have blogged earlier. After I posted the homemade paneer recipe, I have been receiving emails to post easy paneer recipes and special dishes to serve for get togethers and parties. \r\n\r\nA rich paneer dish that is apt to serve on special occasions is shahi paneer. It is a rich, onion-cashew nut paneer gravy dish that makes for a flavorful side with roti, naan, kulcha, paratha or pulao. The key to this fragrant curry is to use blanched onions and freshly ground spices. Usually tomato and turmeric powder are avoided to lend the dish a white shade. \r\n\r\nshahi paneer restaurant style\r\n\r\nI did not saute the paneer in ghee\/butter before adding to the simmering gravy. I soaked the paneer cubes in luke warm water for a few minutes and added them to the simmering curry. The paneer is cooked to perfection in the spiced gravy and attains a melt in the mouth texture. If you are throwing a party, do add this dish to your menu. This restaurant style shahi paneer will please your guests. :)\r\n\r\nFollow the instructions below to learn how to make shahi paneer \r\nHow to blanch onions ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/shahi-paneer.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/shahi-paneer-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/shahi-paneer-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy","nuts","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"40","prep-time":"15","main-ingredient":["paneer"],"serves":"5","goes-well-with":["naan"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Paneer Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["indian-cooking","paneer","paneer-recipes","vegetarian"]}