{"id":15081,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/24\/kalakand-recipe-how-to-make-kalakand\/","title":"Kalakand recipe","content":"kalakand recipe - how to make kalakand at home with khoya - indian dessert recipes for diwali, holi & navratri\r\n\r\nkalakand\r\n\r\nKalakand recipe, a culinary gem among Indian dessert recipes, is prepared during festivals like diwali, holi and navratri. It is a rich, soft, crumbly, milk based fudge that literally melts in the mouth. The traditional recipe of Kalakand is made with chenna (coagulated milk solids), khoya aka mawa (reduced milk), sweetened with sugar and subtly flavored with cardamom. Chenna is prepared by curdling milk with an acidic medium like lemon juice, vinegar or yogurt (learn how to make chenna). Khoya is thickened milk that is prepared by heating milk over low flame till it reduces to almost one fourth of its original quantity (learn how to make khoya). There are also quicker versions to make Kalakand using microwave or stove top with condensed milk and grated paneer or ricotta cheese. \r\n\r\nTo prepare kalakand from scratch, chenna and khoya are cooked over low flame along with sugar to form a thick mixture which is then allowed to set for a few minutes. Once set, square slices are cut and garnished with nuts like pistachio or almonds. \r\n\r\nFollow the instructions on how to make kalakand recipe with step by step photos. You will have to prepare chenna and khoya, the recipes of which I have already posted. chenna recipe (follow the recipe method till step 7 and your chenna is ready) & khoya recipe\r\n\r\nhomemade chenna & khoya (mawa)\r\n\r\nkhoya and chenna cooking over low flame\r\n\r\nkhoya, chenna and sugar mixture cooking~ kalakand allowed to set\r\n\r\nkalakand with khoya","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/kalakand-recipe-with-khoya.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kalakand-recipe-with-khoya-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kalakand-recipe-with-khoya-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"180","prep-time":"15","main-ingredient":["milk"],"serves":"8","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Navratri Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["diwali-sweets","festival_sweets","mawa","swee"]}