{"id":15093,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/10\/red-poha-upma-recipe-how-to-make-poha\/","title":"Red poha upma ","content":"Red poha upma - how to make poha - a healthy poha recipe to add to your list of breakfast items\r\n\r\nred poha upma\r\n\r\nRed poha or red rice flakes is nothing but flattened rice made from red rice. Red poha nutrition value is high compared to white rice flakes. It has health benefits in terms of having more iron content and is also easy to digest. Rice flakes also goes by the name flattened rice, beaten rice, poha, atukulu, aval and avalakki. It is a dehusked rice that is flattened into dried flakes. There are a variety of rice flakes available in the market based on their thickness. Red rice poha is a healthy alternative to white rice flakes and is an essential pantry ingredient to make quick tiffins or lunch box items.\r\n\r\nred poha or red rice flakes\r\n\r\nOne of the quickest and flavorful breakfast meal or tiffin one can ever make is poha upma. There are numerous versions or recipes for poha as breakfast items based on the ingredients available at home. Replace white rice flakes with nutrition rich red rice flakes and you have a power packed breakfast which can further be enriched with vegetables and nuts. \r\n\r\nred aval upma\r\n\r\nFollow the instructions to learn how to make poha upma with red rice flakes","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/how-to-make-poha.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-poha-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-poha-300x300.jpg","style":["easy","quick","traditional"],"course":["breakfast"],"special-diet":["eggless","dairy free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"15","prep-time":"15","main-ingredient":["red poha"],"serves":"4","author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","South Indian Recipes"],"tags":["breakfast","easy-vegetarian-recipes","poha","red poha","tiffins"]}