{"id":15105,"permalink":"http:\/\/www.sailusfood.com\/2015\/02\/27\/chocolate-barfi-indian-sweets\/","title":"Chocolate barfi","content":"chocolate barfi - how to make choclate barfi using mawa - indian sweets for holi, diwali, navratri festivals\r\n\r\nchocolate barfi\r\n\r\nChocolate barfi is a sinful amalgamation of mawa (reduced milk) and chocolate with a hint of cardamom and saffron. This irresistible, decadent Indian sweet has two of my favorite ingredients, cardamom and chocolate. The texture is silky smooth, not overly sweet and is balanced with crunchy pistachios. Since its rich in calories, I rarely make it at home, unless its an occasion to celebrate or during festivals like holi or diwali.\r\n\r\nWith holi round the corner, chocolate barfi is an apt Indian sweet to make. Since its quite time consuming to make mawa from scratch, you can use store bought mawa. I made a large batch of mawa and froze it in small packs of 150 gms to make Indian sweets using mawa. I thaw, grate and use mawa as required. While making chocolate barfi recipe, ensure that you set it for at least two hours so that it has a firmer texture and is easy to cut and slice. I was impatient and sliced the chocolate burfi within a few minutes of setting. :)\r\n\r\nmawa cooking on low flame~milk added to simmering mawa\r\n\r\nmilk powder, saffron milk, sugar added to the simmering mawa\r\n\r\nchocolate mawa simmering ~ setting the two layers before cutting into squares\r\n\r\nchocolate mawa barfi\r\n\r\nFollow the instructions and step by step photos to learn how to make chocolate barfi at home. Here's the link to make mawa aka khoya.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/chocolate-mawa-barfi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-mawa-barfi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chocolate-mawa-barfi-300x300.jpg","style":["easy"],"course":["dessert"],"special-diet":["eggless","dairy","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"150","prep-time":"10","main-ingredient":["milk","cocoa powder"],"serves":"8","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Navratri Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["chocolate","diwali-sweets","holi-recipe","khoya","sweets"]}