{"id":15118,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/01\/aloo-ki-sabzi-kachori-aloo-recipes\/","title":"Aloo ki sabzi for kachori","content":"kachori aloo ki sabzi recipe - a gem among North Indian style aloo recipes served with khasta kachori\r\n\r\naloo ki sabzi\r\n\r\nWith Holi around the corner, its an apt time to post kachori aloo ki sabzi recipe. This flavorful UP style aloo ki sabzi is served with khasta kachori and is an integral part of the street food menu prepared by street hawkers. It is more popularly known as Mathura ki dubki wala aloo sabzi meaning potatoes dunked in water. It is a no tomato, no onion, no garlic potato curry with a loose liquidy consistency. Tangy with highly pronounced spice and aromatic notes, aloo curry uses a generous amount of cloves and black peppercorns including few green chilies and dry red chilies. Hand crushed boiled potatoes are slow cooked in lots of liquid for a long duration to absorb the flavors of the spices making it 'extremely' delicious and addictive. :)\r\n\r\nkachori aloo kis sabzi\r\n\r\nThis Mathura aloo ki sabzi is usually served with a lentil stuffed, deep fried pastry, khasta kachori. The kachoris are slightly bruised on the top and allowed to dunk in the soupy textured aloo ki sabzi. It can also be served with puris. In such case, you can thicken the curry by adding a tablespoon of flour or maida. \r\n\r\nKhasta kachori recipe\r\nLearn how to make kachori aloo ki sabzi recipe by following the instructions below","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/02\/kachori-aloo-sabzi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kachori-aloo-sabzi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kachori-aloo-sabzi-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"45","prep-time":"15","main-ingredient":["potatoes"],"serves":"5","goes-well-with":["kachori"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["aloo","curry","potato curry","potatoes","sabzi"]}