{"id":15117,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/02\/basundi-recipe-how-to-make-basundi\/","title":"Basundi recipe","content":"basundi recipe - how to make basundi, indian sweet recipes for festivals like diwali, holi\r\n\r\n\r\n\r\nBasundi recipe is almost the same as rabdi aka rabri, the recipe of which I had posted earlier. Basundi is thick sweetened milk that is flavored with cardamom or saffron and garnished with nuts like pistachios or chironji. Rabri is similar to basundi but differs in texture due to the difference in the method of preparation. \r\n\r\nBoth basundi and rabdi, call for the use of full fat milk that is slow cooked for long duration with constant stirring. For authentic basundi preparation from scratch, whole milk is reduced to a little less than two thirds of its original quantity by constant stirring till the milk thickens. It has more liquid content compared to rabdi and less milk solids. Basundi is eaten on it own, either warm or chillied and is also be served with puri or jalebi. While making rabri recipe, whole milk is reduced to less than half of its original quantity. It is thick with milk solids and has minimal liquid content compared to basundi. Rabri can be eaten on its own, either warm or chilled and is also served with malpua.\r\n\r\n\r\n\r\n\r\nThis traditonal basundi recipe is a special Indian sweet prepared during festivals in western part of India especially Maharashtra and Gujarat. There are easier and less labour intensive methods to prepare basundi but then it would not be authentic. Basundi can be prepared using khoya (mawa), condensed milk, cream and evaporated milk powder. We can even flavor the authentic basundi recipe with strawberry, custard apple, orange, mango\r\n\r\nFollow the instructions below on how to make basundi recipe including tips","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/how-to-make-basundi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-basundi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-basundi-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"45","prep-time":"5","main-ingredient":["full fat milk","sugar"],"serves":"8","goes-well-with":["puri","jalebi"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Navratri Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["dessert","diwali-sweets","festival_sweets","sweets"]}