{"id":15148,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/14\/shikanji-recipe-summer-drinks\/","title":"Shikanji, Indian Lemonade - Summer Drinks","content":"shikanji - indian lemonade with a twist - summer drinks of India\r\n\r\nShikanji\r\n\r\nI have many friends from the Marwari Jain community. Whenever I visit their homes, I am offered a glass of chilled shikanji aka shikanjvi, a flavorful summer cooler that is rich in Vit C. It is popular in Northern and Central India as well as Pakistan. What is the basic difference between normal nimbu pani (lemonade) and shikanji? Lemonade is a mixture of normal water, lemon juice and sugar with a pinch of salt. When spices like black salt, roasted cumin powder, black pepper powder and ginger are added to the basic lemonade drink, it is called shikanji.  Infact jain shikanji masala is a very popular ready made spice mix that is added to the basic lemonade.\r\n\r\nShikanji recipe is one of the easiest summer drinks of India that you can put together in a jiffy. It is light, refreshing, with citrus flavoring and fragrant due to the spices and mint. Simple spices like roasted cumin and black salt shine through to make a perfectly balanced flavored lemonade. \r\n\r\nShikanji - Indian Lemonade\r\n\r\nUsually I make a bottle of simple sugar syrup during the summer months and refrigerate it. During the summer months, it is a good idea to refrigerate a large jug of this spiced nimbu pani to fight off the Indian summer heat. Do give it a try because I'm sure you will love this Indian lemonade with a twist. \r\n\r\nFollow the instructions below to learn how to make shikanji","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/how-to-make-shikanji.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-shikanji-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-shikanji-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"prep-time":"5","main-ingredient":["lemons","black salt"],"serves":"3","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","North Indian Recipes"],"tags":["drinks","lemon","lemonade","nimbu","summer-drink","summer_cooler"]}