{"id":15155,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/26\/chalimidi-recipe-rice-flour-recipes\/","title":"Chalimidi recipe","content":"chalimidi recipe, how to make chalimidi - rice flour recipes\r\n\r\nChalimidi is a unique traditional sweet recipe of Andhra. Whenever there is a celebration like a baby shower (seemantham) or Sri Rama Navami festival, you can be sure that chalimidi will be a star player. :) There are 2 versions of chalimidi, one is uncooked or pachi chalimidi and the other is paakam chalimdi which involves making sugar syrup. Chalimidi recipe involving the preparation of sugar or jaggery syrup can be quite tricky for beginners. I will share that version too in a future post.\r\n\r\nchalimidi - andhra sweet dish for sri rama navami festival\r\n\r\nWhatever version you make, its imperative you make fresh rice flour at home. It involves soaking rice overnight, drying it for half an hour and grinding it to a fine powder. I have already done a post on how to make rice flour at home and few recipes with rice flour. \r\n\r\nI'm sharing the simplest process of making chalimidi which is popular as pachi chalimidi (raw or uncooked version). It is recommended to use fresh coconut while cardamom is essential for an aromatic and flavorful chalimidi. With Sri Rama Navami festival round the corner, get ready to serve Lord Rama his favorite sweet using rice flour, along with vadapappu panakam.\r\n\r\nFollow the instructions below to learn how to make chalimdi recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/chalimidi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chalimidi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chalimidi-300x300.jpg","style":["easy","quick","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"prep-time":"30","main-ingredient":["rice flour","sugar"],"serves":"5","goes-well-with":["moong dal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Eggless Dessert Recipes","Festival Foods","Indian Festivals","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["andhra-recipes","festival_sweets","rice flour","traditional"]}