{"id":15152,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/24\/jal-jeera-jaljeera-powder-recipe\/","title":"Jal jeera","content":"jal jeera or jaljira and jaljeera powder recipe - refreshing ayurvedic energy drink, summer drinks of india.\r\n\r\njal jeera, ayurvedic energy drink\r\n\r\nOn a hot summer day, all you need is a tall glass of chilled jal jeera. Jal jeera or jaljira is a refreshing, traditional Indian summer drink with health benefits. Jaljira not only quenches your thirst but also increases your appetite and aids in digestion. Jal jeera literally translates to 'cumin water' but there is more to this drink than just roasted cumin seeds. According to Ayurveda, ingredients like cumin and tamarind aid in digestion and cumin seeds are known to balance all the three doshas: vata, pita, kapha. This refreshing ayurvedic energy drink has herbs and spices that go into its making that have a cooling effect on the body and revive one's appetite.\r\n\r\nThis spiced minty summer cooler is served as an appetizer drink as part of a North Indian style thali (lunch). During the summer months, its a common sight to find street vendors selling jaljeera in earthen pots (matka) which help to keep it cool. The unique flavor of this summer drink is the jaljeera powder where spices like roasted cumin, black peppercorns, cloves, black cardamom and black salt are ground to a fine powder and added to a paste of fresh mint and coriander leaves. Fresh mint and coriander leaves impart a refreshing fragrance and flavor. Traditionally, tamarind is used to make jaljira but one can use lemon juice too. Unsweetened boondi (made with chickpea flour) makes for a beautiful and tasty garnish. \r\n\r\nWith summmer upon us, do stock on jaljeera powder and make jal jeera, one the best summer drinks of India.\r\n\r\nFollow the instructions below to learn how to make jaljeera drink with homemade jaljeera powder","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/jaljira.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/jaljira-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/jaljira-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"5","prep-time":"20","main-ingredient":["mint leaves","black salt"],"serves":"5","goes-well-with":["boondi"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Festival Foods","Indian Drink - Sharbat Recipes","Indian Festivals","North Indian Recipes"],"tags":["Ayurveda","summer-drink","summer_cooler"]}