{"id":15154,"permalink":"http:\/\/www.sailusfood.com\/2015\/03\/25\/vadapappu-panakam-recipe-sri-rama-navami\/","title":"Vadapappu Panakam Recipe","content":"vadapappu panakam recipe, how to make panakam for sri rama navami festival\r\n\r\nVadapappu panakam are offered to Lord Rama on his birthday i.e Sri Rama Navami festival celebrated by Hindus on March 28th, 2015. Vadapappu is nothing but soaked moong dal that is served with jaggery and chalimidi (rice flour based sweet) and panakam. There is savory version of vadapappu where grated raw mango, coconut and green chilies are added to soaked yellow moong dal. \r\n\r\nvadapappu panakam - sri rama navami prasadam\r\n\r\nPanakam is a thirst quenching, palate pleasing, traditional, ayurvedic energy drink. It is a naturally sweetened summer cooler laced with a subtle hint of spice. Grated jaggery (gud), dry ginger (sonth or sonti), black pepper corns and cardamom go into the making panakam recipe. According to Indian ancient medicine, Ayurveda, panakam (also called panaka or panagam) balances the three doshas: vata, kapha and pitta during the hot summer days. Health benefits of panakam are not to be underated. It provides instant relief from the hot sweltering sun, cools the body, revives appetite and gives a rejuvenating feeling on consumption. Dry ginger has astringent properties and heals gastric related issues. Vadapappu panakam when consumed together help in digestion. I am sharing vadapappu recipe including how to make panakam. \r\n\r\npanakam - sri rama navami\r\n\r\nFollow the instructions below to learn how to make vadapappu panakam recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/03\/vadapappu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vadapappu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vadapappu-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"1","prep-time":"60","main-ingredient":["moong dal","jaggery","black pepper corns"],"serves":"4","goes-well-with":["chalimidi"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Festival Foods","Indian Drink - Sharbat Recipes","Indian Festivals","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["festival","panakam","summer-drink","summer_coolers"]}