{"id":15174,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/06\/recipe-virgin-mojito-mocktail-recipes\/","title":"Virgin Mojito - Mocktail Recipes","content":"Recipe of Virgin Mojito - how to make mocktail - mocktail recipes\r\n\r\nMojito is basically a alchohol based drink that has mint leaves, lemon juice (citrus flavors) and sugar. A mojito that does not have alchohol in it is a 'virgin mojito' and is categorized as a mocktail. So, what is a mocktail? Mocktail is a non alchoholic drink which consists of a mixture of fruit juices, syrups or soft drinks. Mocktails like fruit punches can be consumed by all those who relish flavorful drinks without alcohol. \r\n\r\nvirgin mojito\r\n\r\nPreparation of virgin mojito involves adding lime juice, sugar syrup and mint leaves in a serving glass. With the helps of a muddler or spoon this mixture is gently crushed to lightly bruise the mint leaves so that the essential oils are released. Chilled aerated drink like spirte is slowly poured into the glass and stirred to mix. This mocktail drink can be garnished with a lemon slice and few mint leaves. Add some ice cubes and you are ready to beat the heat with a glass of refreshing virgin mojito. \r\n\r\nThis chilled carbonated beverage is perfect to serve a crowd during the hot summer months since it is incredibly easy to make. And let me tell you that mocktail recipes like home made virgin mojito will beat the ones served at KFC. :)\r\n\r\nvirgin mojito mocktail\r\n\r\nFollow the instructions below to learn the recipe of virgin mojito","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/virgin-mojito-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/virgin-mojito-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/virgin-mojito-recipe-300x300.jpg","style":["easy","quick"],"course":["beverage"],"special-diet":["eggless","dairy free","nut free","vegetarian","vegan","kid friendly"],"cuisine":["western"],"cook-time":"1","prep-time":"8","main-ingredient":["sprite","mint leaves","lemon"],"serves":"3","goes-well-with":["chips","nachos"],"author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes"],"tags":["drinks","lemon","mint","summer-drink","summer_cooler"]}