{"id":15244,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/09\/meetha-sattu-sharbat-healthy-summer-drink\/","title":"Meetha Sattu, Sattu Meetha Sharbat","content":"Meetha Sattu or sattu meetha sharbat – healthy summer drinks with sattu flour (roasted gram flour)\r\n\r\nYesterday, I posted the savory version of Sattu drink, a traditional, nutrition rich summer drink from Bihar and UP. For those of you who are new to sattu, do read this post on sattu health benefits. Sattu is roasted gram flour (roasted chane) that is rich in natural fibre, has low glycemic index, detoxes and cleanses the system and helps in weight loss too. Other than roasted gram flour, there are number of sattu varieties made with millets, pulses and cereals. Sattu, a staple diet of the farming community of Bihar and UP, is sold as health food in major grocery stores all over the country. \r\n\r\n\r\nRoasted chickpeas ~ Sattu Flour\r\n\r\nToday, I am sharing the sweet version of sattu drink which is more popular as meetha sattu or sattu meetha sharbat. I love the simplicity of this summer drink recipe. It is high on flavor with minimal ingredients. Only 3 ingredients go into the making of meetha sattu - sattu flour, jaggery and water. A refreshing, thirst quenching drink that is cooling to the body. One of the best traditional summer drinks of India and the most flavorful drink I have had in a long time.\r\n\r\nMeetha Sattu\r\n\r\nFollow the instructions below to learn how to make meetha sattu or sattu meetha sharbat","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/sattu-ka-meetha-sharbat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sattu-ka-meetha-sharbat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sattu-ka-meetha-sharbat-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"1","prep-time":"5","main-ingredient":["sattu flour","jaggery"],"serves":"2","goes-well-with":["fruits"],"author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","Sweet Dessert Recipes"],"tags":["drinks","healthy-recipe","summer-drink","summer_coolers"]}