{"id":15243,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/08\/sattu-drink-recipe-summer-drinks\/","title":"Sattu Drink, Sattu Namkeen Sharbat","content":"Sattu drink or sattu namkeen sharbat - summer drinks with chane ka sattu flour (roasted gram flour)\n\nSattu Drink\n\nSattu drink is one of the most popular, traditional, healthy summer drinks from Bihar and UP. What is sattu and is it good for health? Sattu is  roasted gram flour. Sattu is full of nutrition with cooling properties, rich in soluble fibre, high in protein and good for the digestive system. Its low glycemic index makes it suitable for diabetics. In fact, it is considered a detox food that cleanses the system and aids in weight loss. \n\nOther than chane ka sattu (roasted gram flour) there are many sattu varieties that are available in the market. Sattu is a mixture of 7 varieties of pulses, millets and cereals which include horsegram, wheat, barley and maize and is consumed all over Bihar and Uttar Pradesh especially by the farmering community and those who labor in the hot sun. This healthy mix is available in major supermarkets all over India. A variety of dishes like litti, parathas and laddus are prepared with sattu flour. \n\nRoasted gram or chane ~ Sattu flour\n\nOne can prepare sattu flour or roasted gram flour from scratch at home but it is a labour intensive process. Basically black chickpeas or kala chana (not kabuli channa) are cleaned, boiled in hot water for 3-4 mts, drained and allowed to rest for 2 hours, covered. The chane is spread out on a cloth to dry completely and is roasted in an iron kadai long with sand. The roasted chane and sand are sieved to separate the chana. The roasted chane is ground to a fine powder and stored in an air tight container. The best alternative would be to use store bought roasted chana, roast it on medium flame for 3 mts, allow to cool and grind to a fine powder. I have followed the easy way out to make sattu flour at home.\n\nThere are two versions of sattu drink - meetha (sweet) and namkeen (savory). Sattu namkeen sharbat is a salted version where black salt, black pepper, roasted cumin powder, lemon juice and mint leaves are used. The sattu drink recipe or sattu namkeen sharbat that I am posting today is prepared with roasted gram flour or chane ka sattu. An energizing drink that not only quenches our thirst but also protects us from heat strokes due to intense summer heat. In fact, roasted barley flour (jau ka sattu) which is known for its cooling and hydrating nature is also added to sattu drink. I love the flavor of this healthy drink. I also enjoy the sweet version of sattu drink, the recipe of which I will post tomorrow.\n\nSattu ka sharbat\n\nFollow the instructions below to learn how to make sattu drink or sattu ka sharbat","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy free","nut free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"3","prep-time":"10","main-ingredient":["sattu flour"],"serves":"2","goes-well-with":["fruits"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","North Indian Recipes"],"tags":["brown","drinks","healthy-recipe","summer-drink","summer_coolers","vegan_recipe"]}