{"id":15257,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/14\/sabja-lemonade-summer-drinks\/","title":"Sabja Lemonade","content":"Sabja lemonade - Sweet basil seeds lemon drink, how to make summer drinks with sabja seeds\r\n\r\nSabja lemonade or sweet basil seeds lemonade is one of the healthiest summer drinks. Sabja seeds are basically sweet basil seeds that have a nice crunchy texture. The scientific name is Ocimum basilicum. In India, they are popular as sabja or falooda seeds. Another popular name is tukmaria and sabja seeds in telugu is known as sabja ginjalu. These healthy seeds are from maruwa or rudra jada plant of the tulsi family and should not be mistaken for holy basil or tulsi. \r\n\r\nSabja Lemonade\r\n\r\nThe health benefits of sabja seeds are tremendous. It is antioxidant rich, cools the body, aids digestion, cures constipation, cold, skin infections and respiratory disorders. For excessive pitta dosha one can consume sabja seeds to reduce body heat. It has many more medicinal values according to Ayurvedic texts. Sabja seeds when soaked in water, appear like tapioca on swelling, crunchy on bite with a bland flavor. You can add the bloomed seeds to almost any drink, juice or dessert of your choice. The famous dessert, falooda, is incomplete without the addition of sabja. \r\n\r\nSabja seeds - bloomed basil seeds\r\n\r\nThe next time you make shikanji or lemonade, nannari sharbat, bel ka sharbat, rooh afza lemonade or any sharbat, do add a heaped tbsp of bloomed sabja as garnish. It is cooling to the body and protects us from intense heat. Sabja lemonade recipe is nothing but addition of sabja seeds to your basic nimbu pani aka lemonade.\r\n\r\nFollow the instructions below to make sabja lemonade","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/sweet-basil-seeds-lemonade.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sweet-basil-seeds-lemonade-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sweet-basil-seeds-lemonade-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","nut free","diary free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"1","prep-time":"15","main-ingredient":["sabja seeds","lemon"],"serves":"2","goes-well-with":["fruits"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes"],"tags":["drinks","healthy-recipe","lemon","nimbu","sabja-seeds","summer-drink","summer_coolers"]}