{"id":15278,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/15\/lassi-recipe-sweet-lassi-punjabi\/","title":"Lassi Recipe","content":"Lassi recipe, sweet lassi to beat the summer heat - Punjabi food recipes\r\n\r\nLassi\r\n\r\nLassi is a traditional summer drink from the state of Punjab. This popular, creamy, sweetened yogurt drink is a gem among Punjabi food recipes.  It is a common sight in the North especially in Punjab, Rajasthan, UP and Delhi to find street vendors selling frothy lassi in matka (clay pots). There are three versions of lassi - salted, sweet and masala. Sweet lassi is slightly heavy due to the use of rich milk and sugar. The key to good lassi is to use thick homemade yogurt (curd) that is absolutely chilled and hand blended with a wooden churner. The yogurt should be fresh and sweet in flavor. Lassi makes for a filling breakfast and you are good to go for the day.\r\n\r\nSweet Lassi\r\n\r\nThere are many variants to the basic lassi recipe. You can flavor with cardamom powder, saffron, dry fruits, nuts, fruits like mango, papaya, banana and more. Street vendors sell a plethora of lassi varieties in matkas by garnishing the sweet lassi with dollops of either fresh cream, makhan (butter), khoya, rabri or malai. Inspite of the lassi varieties that are sold in the market, nothing to beat homemade lassi to combat the summer heat. One of India's best summer drinks.\r\n\r\nFollow the instructions below to learn how to make lassi recipe or sweet lassi","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/lassi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/lassi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/lassi-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy","nuts","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["punjabi"],"prep-time":"5","main-ingredient":["yogurt","cardamom"],"serves":"2","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes"],"tags":["cooler","curd","drinks","healthy-recipe","summer-drink","yogurt"]}