{"id":15303,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/17\/salted-lassi-recipe-summer-drinks\/","title":"Salted Lassi","content":"Salted lassi, namkeen lassi - healthy summer drinks of India\r\n\r\nsalt lassi drink\r\n\r\nSalted lassi, India's traditional drink, is one of the best healthy drinks recipes to beat the heat and protects us from sun strokes. Similar to the sweet lassi recipe I blogged earlier, the ingredients to make salted lassi recipe are also minimal. Basic salted lassi recipe needs thick yogurt, salt and water. You can flavor the lassi with either ginger juice, green chili, black pepper, mint, coriander leaves or black salt.\r\n\r\n\r\nsalted lassi\r\n\r\nLassi benefits are many according to Ayurveda. Salted lassi with ginger is nutritive, aids in digestion, acts as a general laxative and provides calcium, potassium and Vitamin B12 to the body. Lassi contains good bacteria that lubricate the intestines, aid digestion and helps to reduce gas and bloating. It helps to pacify Vatta imbalances. Use thick homemade yogurt with either full fat or skimmed milk when making salt lassi drink at home. During summer months, make yogurt on a regular basis and drink salted lassi to beat the heat. Best summer drink to beat the heat.\r\n\r\nFollow the instructions below to learn how to make namkeen lassi at home","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/salt-lassi-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/salt-lassi-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/salt-lassi-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"prep-time":"5","main-ingredient":["yogurt"],"serves":"2","author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes","Indian Vegetarian Recipes"],"tags":["drinks","healthy-recipe","summer-drink","yogurt"]}