{"id":15327,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/20\/gulkand-milkshake-healthy-summer-drink\/","title":"Gulkand Milkshake","content":"Gulkand milkshake - milkshake recipe using rose petal jam \r\n\r\nGulkand milkshake\r\n\r\nGulkand milkshake makes for a perfect summer drink as it is cooling to the body and protects us from heat strokes. Gulkand is nothing but rose petal jam or preserve. It is a cooling tonic according to Ayurveda and an essential ingredient to make paan (betel leaf digestive and mouth freshner). Gulkand has many benefits according to Ayurveda. It purifies the blood, improves appetite and digestion, cures acidity, cools the body, good for eyesight, works as a mild laxative and improves skin complexion. It has a unique flavor and an enticing aroma. \r\n\r\nGulkand - rose petal jam\r\n\r\nYou can make gulkand at home if you have access to desi or wild pink roses. I will share homemade gulkand recipe in my future posts. I have used store bought gulkand to make gulkand milkshake. Its a super quick milkshake recipe provided you have boiled milk on hand. Just chill the milk in the fridge for a few minutes, add gulkand and rose syrup to the chilled milk, give it a stir and your gulkand milkshake is ready. I usually add rose syrup to give this refreshing summer drink a nice pink shade. Its purely optional though. Do add this aromatic milkshake to your list of summer drinks recipes repertoire.\r\n\r\nRose petal jam milk shake\r\n\r\nFollow the instructions below to learn how to make gulkand milkshake recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/rose-petal-jam-shake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rose-petal-jam-shake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rose-petal-jam-shake-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"prep-time":"5","main-ingredient":["gulkand","milk"],"serves":"3","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Flowers","Indian Drink - Sharbat Recipes","Indian Milk Recipes"],"tags":["drinks","milkshake","rose-milk","rose-syrup","summer-drink"]}