{"id":15344,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/23\/thai-basil-seed-drink-nam-manglak\/","title":"Basil seed drink,  Nam Manglak","content":"Basil seed drink - Nam Manglak, a healthy beverage from Thailand\r\n\r\nBasil seed drink\r\n\r\nDuring the summer months, I usually make a large pitcher of healthy drinks that are refreshing and tasty like chaas or buttermilk, lassi, shikanji, iced tea and more. Today, I made a basil seed drink, Nam Manglak, which is a popular healthy beverage of Thailand. Super simple drink to put together with minimal ingredients.\r\n\r\nSweet basil seeds\r\n\r\nSweet basil seed or sabja is the key ingredient to the drink. Basil seeds when soaked in water begin to swell and form a thin transparent layer on the outside. They are crunchy on bite with a bland flavor. You can add the bloomed seeds to almost any drink, juice or dessert of your choice. Since soaked basil seeds have a bland flavor, you can flavor the basil seed drink with any flavor of your choice like rose syrup, litchi syrup or mango syrup. I have used rose syrup, simple sugar syrup and basil seeds. During the summer months, buy a pack of sweet basil seeds (known as sabja in India) and make healthy drinks like nam manlak or basil lemonade to beat the heat.\r\n\r\nNam Manglak - Thailand's healthy beverage\r\n\r\nFollow the instructions below to learn how to make basil seed drink or Nam Manglak","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/thai-basil-seed-drink.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/thai-basil-seed-drink-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/thai-basil-seed-drink-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","diary free","nut free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["thai"],"cook-time":"1","prep-time":"15","main-ingredient":["basil seeds"],"serves":"2","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Thai Recipes"],"tags":["drinks","sabja-seeds","summer-drink","summer_coolers"]}