{"id":15354,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/21\/chaas-buttermilk-recipe\/","title":"Chaas","content":"Chaas, buttermilk recipe - traditional, healthy summer drink of summer\r\n\r\n\r\nchaas\r\n\r\nChaas, a refreshing summer drink, is basically a diluted, salted yogurt drink. In India, its more popularly known as buttermilk. Thick curd or yogurt is beaten and diluted with water to the ratio of 1:2 i.e for 1 cup of curd, you need to add 2 cups of water. This plain chaas recipe is only flavored with salt and\/or black salt. Most home cooks have their own favorite flavors of chaas based on the region. Basic buttermilk recipe can be flavored with ginger juice, green chili, asafoetida, black salt and roasted cumin powder. Down South, chaas is known as majjiga, majige or mor.\r\n\r\nbuttermilk\r\n\r\nYogurt or curd is the main key player of buttermilk recipe. It is usually served along with lunch especially during the hot summer months. This salted yogurt drink has many health benefits which include cooling the body and good digestion. I usually like to add a lot of fresh coriander, black salt and roasted cumin powder. You can add either of them based on what is available in your pantry. Plain simple salted buttermilk with a dash of lemon juice is like manna from heaven on a hot day. Do give this healthy beverage a try this summer. Keep yourself well hydrated and do check out more summer drink recipes.\r\n\r\nFollow the instructions below to learn how to make chaas or buttermilk recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/buttermilk-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/buttermilk-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/buttermilk-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"prep-time":"5","main-ingredient":["curd","ginger"],"serves":"3","author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes"],"tags":["drinks","healthy-recipe","summer-drink","yogurt"]}