{"id":1538,"permalink":"http:\/\/www.sailusfood.com\/2009\/01\/18\/kandi-pachadi-tur-dal-chutney\/","title":"Kandi Pachadi - Tur Dal Chutney","content":"Kandi Pachadi ~ Tur dal Chutney\r\n\r\nTypically eaten with rice during meal times and an absolute Andhra delight, is Kandi Pachadi.  Rich in protein, its preparation involves dry red chillis, cumin, split urad dal, sauteed and ground with tamarind and finally tempered with the magic touch of aromatic curry leaves. Its all in the texture, which should be a coarsely ground thick pachadi and not a smooth paste. A dash of ghee with white rice and a slice of raw onion, this pachadi is to die for!\r\n\r\nKandi Pachadi Recipe\r\nPreparation: 18-20 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/2 cup kandi pappu\/tur dal\/red gram dal\r\n\r\n3\/4 tsp cumin seeds\r\n\r\n1 tsp split gram dal\/minappa pappu\/urad dal\r\n\r\n3-4 dry red chillis, tear and de-seed\r\n\r\n3-4 garlic flakes\r\n\r\ngooseberry sized tamarind\r\n\r\n2-3 tsps oil\r\n\r\nsalt to taste\r\n\r\nFor popu\/tadka\/seasoning:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1 tsp split gram dal\/minappa pappu\r\n\r\n10 -12 curry leaves\r\n\r\n1 tsp oil\r\n\r\n\r\n\r\n1 Heat a tsp of oil in a pan, add the red gram dal and roast it on low to medium flame till slightly red in color and you get a nice aroma. Remove from pan, give a quick rinse with water and strain. Keep aside.\r\n2In the same pan, add another tsp of oil, add cumin seeds and roast them for a mt, add the split gram dal and stir fry for another two mts. Next add red chillis and fry them for half a minute on low heat. Remove from pan and cool.\r\n3 Once cool, grind the toasted ingredients, red gram dal, raw garlic, tamarind and salt to a coarse paste by adding very little water (few tbsps). You shouldn't make it into a smooth paste. \r\n4 Heat oil in a small pan. Add the mustard seeds and let them pop. Add the split black gram and let it brown. Add the curry leaves and toss them for a few seconds till the flavors come out.\r\n5 Turn off heat and add the seasoning to the ground kandi pachadi and combine.\r\n6 Serve with hot steamed rice, ghee and raw onions. \r\n\r\n\r\nFrom my desktop quote book, 'Mottos for Success'  ~\r\n'Your expression is your billboard by the highway of life. It is your first means of unspoken communication, and your most powerful \"advertisement\".'","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/01\/tur-dal-chutney.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tur-dal-chutney-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tur-dal-chutney-300x300.jpg","main-ingredient":["tur dal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Dal Recipes","Indian Lentil Recipes","Indian Vegan Recipes"],"tags":["pachadi"]}