{"id":15406,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/27\/variyali-sharbat-recipe-summer-drink\/","title":"Variyali Sharbat, Fennel seed drink","content":"Variyali sharbat or saunf sharbat is a healthy fennel seed drink to beat the summer heat\r\n\r\nvariyali sharbat\r\n\r\nVariyal sharbat or saunf sharbat is a popular summer beverage of Gujarat. Variyali and saunf are common names of fennel seeds. I have harvested fennel seeds from my organic garden, sun dried them and used them to make this sattvic fennel seed drink. Its a joy to use home grown fresh produce in my everyday cooking. :)\r\n\r\nhome grown organic saunf\r\n\r\nFennel seeds are good for digestion and are  cooling to the body according to Ayurveda. The seeds are usually used as a mouth freshner. Variyali sharbat recipe is a simple traditional drink and very few ingredients go into its making. Usually rock sugar (mishri) is used to sweeten the drink. You can use jaggery, sugar or honey if do not have rock sugar on hand. You can further flavor the basic variyali sharbat with dried black raisins, laung (cloves) and\/or cardamom. Another variation of saunf sharbat is the use of lemon juice, black salt and mint leaves. \r\n\r\nDo include healthy drinks with no preservatives or artificial colors like lassi, buttermilk, tender coconut water, sabja lemonade in your diet during the hot summer days. Here are more summer drinks that are perfect thirst quenchers. \r\n\r\nFollow the instructions below to learn how to make variyali sharbat or saunf sharbat","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/saunf-sharbat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/saunf-sharbat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/saunf-sharbat-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","nut free","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["gujarati"],"prep-time":"10","main-ingredient":["fennel seeds","rock sugar"],"serves":"2","author":null,"type":"post","categories":["Ayurvedic Cooking - Ayurveda Recipes","Gujarati Recipes","Indian Drink - Sharbat Recipes"],"tags":["drinks","fennel-seeds","healthy-recipe","summer-drink","summer_coolers"]}