{"id":15432,"permalink":"http:\/\/www.sailusfood.com\/2015\/04\/30\/bombay-chutney-recipe\/","title":"Bombay Chutney","content":"Bombay chutney for dosa and idli, a quick side dish that also goes with poori, chapati or roti\r\n\r\nBombay chutney for dosa\r\n\r\nBombay chutney is a gravy dish served as a side with breakfast items like dosa, idli, puri, chapati and roti. It is popular down South especially in Andhra Pradesh and Tamil Nadu. Go to any of the road side tiffin centers in any small town or city, you are sure to find 'bombay chutney' on their menu. It is an age old recipe in many telugu households. My grandmother used to serve use this gluten free chutney with poori and dosa. \r\n\r\nIt is basically a Maharashtrian recipe, pitla (pithle\/pithla) adapted to the South Indian palate. Pitla is a besan based, thick gravy served with bhakri roti which is a staple dish of Maharashtrian cuisine. Since chutney or pachadi is part and parcel of South Indian tiffins, pitla might have taken the name 'Bombay chutney', a thinner consistency gravy dish. That's my guess. :) Can someone please throw some light on how the name 'bombay chutney' came about? \r\n\r\nBombay chutney andhra style \r\n\r\nQuite a few Indian food dishes are versatile and bombay chutney is one of them. There are a few variations to the basic bombay chutney recipe and just a slight change in tempering or addition of either onion, tomato or potato changes the flavor profile. In our home, we make three to four variations that are served with different tiffins. Bombay chutney with potato or bombay aloo chutney goes best with puri, chapati and roti. Another version without onions goes well with idli. The version with tomato and onions goes well with dosa and puri while the version with curd makes for a flavorful side with puri. I will share all versions in future posts. Today am sharing andhra style bombay chutney with tomato and onion. \r\n\r\nA gluten free, vegan dish that extremely easy to make, flavorful and makes for a pleasant change from the usual sides like coconut chutney and sambar. If you have sudden guests, run out of vegetables, run out of time or run out of ideas on what to cook, you know which chutney to make. :)\r\n\r\nFollow the instructions below to learn how to make bombay chutney for dosa or puri","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/04\/bombay-chutney-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bombay-chutney-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bombay-chutney-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["side"],"special-diet":["eggless","dairy free","gluten free","nut free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"30","prep-time":"5","main-ingredient":["besan","tomato"],"serves":"4","goes-well-with":["idli","dosa","puri","chapati","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes"],"tags":["andhra-recipes","besan","easy-vegetarian-recipes","indian_vegan_recipe","side-dish","vegetarian"]}