{"id":15470,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/02\/mango-chutney-recipe\/","title":"Mango Chutney","content":"Mango chutney recipe, an authentic Indian sweet and sour relish made with green mango\r\n\r\nMango chutney\r\n\r\nIt is that time of the year when most homecooks are cooking raw mango recipes like mango chutney, pickles, pachadi, curry, rice, dal, stew, drink and more because best quality green mangoes are in season. It is no different in our home. I made a small batch of my favorite mango chutney that is popular in many parts of Northern, Western and Eastern India. It is popularly known as aam ki launji or aam ki meethi chatni.\r\n\r\nWe have two mangoes trees in our backyard garden which give us enough yield to make pickles and enjoy the ripe mangoes. We usually make a large batch of avakai (Andhra mango pickle), sweet mango pickle and small batches of a variety of mango pickles from other regional cuisines of India like mango chutney and aam chunda.  \r\n\r\nGreen mangoes from my backyard garden\r\n\r\nSo, what is mango chutney? A thick chutney with chunks of soft mango that have been infused in a tempering of spices like black onions seeds, fennel seeds, asafoetida and jaggery sauce. Its all about balance, not too sweet, not too spicy and not to sour. Mango chutney recipe is a simple, straightforward recipe that even a novice cook can make with ease. In fact it is one of the easiest chutney to make among the numerous Indian food chutney varieties. Its best to use a slightly ripe (very slight) mango and the second best would be a perfect raw mango just plucked off the tree. There are slight variations to the basic mango chutney recipe based on the region it is prepared. Whatever version one makes, the sour, fruity aroma of mango chunks simmering in the spiced sauce cannot be described but can only be experienced. \r\n\r\nThe irresistible mango chutney has many uses and can be served as a dip, spread, condiment, relish or pickle. Some of my favorite ways to relish this sweet mango chutney is with paratha or roti, as a spread on crackers or mathri, toasted multi grain bread, sandwich spread and kathi roll. I also use it as a salad dressing along with vinaigrette for summer salads like cole slaw, som tum or sprouts. I like to perk up oats and yogurt with a heaped tablespoon of mango chutney. You must try it too. At parties you can serve mango chutney along side tomato salsa to go with nachos and chips. If you like grilled chicken or shrimp, you can serve mango chutney with it too.\r\n\r\nA few tips to follow while making mango chutney\r\n~ Use medium sour raw mango. If the mango is too sour, allow it to ripen for 2 days and then use to make mango chutney. Peel and chop mangoes into slighly large chunks or thin wedges. \r\n~ I used Kashmiri red chili powder which gives a deep red shade to the chutney. You can use store bought red chili powder which is generally used to make pickles.\r\n~ I used organic jaggery that is soft. You can grate or pound the jaggery. Sugar can replace jaggery or gud. If using sugar, use 1 1\/4 cups. Increase sugar quantity after testing the flavor of the chutney while it is simmering. \r\n\r\nSweet mango chutney\r\n\r\nLearn how to make mango chutney with green mango ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/mango-chutney-indian-style.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-chutney-indian-style-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-chutney-indian-style-300x300.jpg","style":["easy","quick","traditional"],"course":["chutney"],"special-diet":["eggless","nut free","diary free","gluten free","kid friendly","vegetarian","vegan"],"cuisine":["north indian"],"cook-time":"40","prep-time":"15","main-ingredient":["raw mango","jaggery"],"serves":"10","goes-well-with":["roti"],"author":null,"type":"post","categories":["All Recipes","Gujarati Recipes","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["chutney","mango","mango_pickle","pickle","raw_mango","sweet-chutney"]}