{"id":15540,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/04\/mamidikaya-menthi-pachadi-instant-mango-pickle-recipe\/","title":"Mamidikaya menthi pachadi, instant mango pickle recipe","content":"Mamidikaya menthi pachadi, instant mango pickle recipe andhra\r\n\r\nmamidikaya menthi pachadi\r\n\r\nEarly April, I made a batch of mamidikaya menthi pachadi aka instant mango pickle Andhra style with home grown raw mangoes. We are pickle addicts in our home and relish a variety of pickles with the most favorite being the mango based pickles. After all, I belong to the land of pickles where pickling is a way of life for most home cooks. Come summer, you will find almost every home making large batches of mango pickle to last a whole year. Pickle making has begun in our home too. \r\n\r\nIts quite common to find a few mangoes make their way to the ground naturally without being plucked. We usually use these fallen mangoes to make instant pickles which last us a few weeks or till we make the king of pickles, Avakaya. This year we had a few such mangoes which we put to use by making a small batches of instant pickles. Even if the mango is slightly bruised you can go ahead and use for them to make a small batch of instant pickle. Such mangoes should be used to make only instant pickles since their shelf life is a couple of weeks in the refrigerator.\r\n\r\nmamidikaya menthi mukkalu\r\n\r\nMy favorite food combination is eating rice with mudda pappua (cooked tur dal), a dollop of ghee and mango pickle. Its comfort food at its best, in other words, manna from heaven.\r\n\r\nandhra meals with mamidikaya menthi pachad\r\n\r\nI have already blogged mamidi turumu pachadi (instant grated mango pickle) and mamidikaya mukkala pachadi (instant mango pickle with mustard) and few tips to follow while making pickles. Today, am posting an instant mango pickle recipe with menthulu aka methi seeds or fenugreek seeds. It is made with finely chopped pieces of mango, chilli powder, roasted methi powder (fenugreek seed powder) and roasted mustard powder. It has a short shelf life, needs refrigeration and it will be good for atleast 2-3 months. Due to its short life, we usually make a small batch with 2 mangoes. This pickle hardly needs sitting time and is ready to eat the day after its made. \r\n\r\nmamidikaya menthi baddalu \r\n\r\nLearn how to make mamidikaya menthi pachadi or instant mango pickle recipe andhra style ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/mamidikaya-menthi-pachadi-pickle1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mamidikaya-menthi-pachadi-pickle1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mamidikaya-menthi-pachadi-pickle1-300x300.jpg","style":["easy","quick","traditional"],"course":["chutney"],"special-diet":["eggless","dairy free","egg free","nut free","gluten free","vegan","vegetarian"],"cuisine":["andhra"],"cook-time":"10","prep-time":"30","main-ingredient":["raw mango","fenugreek seeds"],"serves":"30","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Pickles"],"tags":["andhra-recipes","easy-vegetarian-recipes","mangoes","mango_pickle","raw_mango"]}