{"id":15560,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/05\/aam-ka-chunda-gujarati-sweet-mango-pickle-recipe\/","title":"Aam ka chunda, gujarati sweet mango pickle recipe","content":"Aam ka chunda, Gujarati sweet mango pickle recipe, chundo\r\n\r\naam ka chunda\r\n\r\nIts raining mangoes pickles at Sailu's Kitchen. Today, I bring to you another gem of Indian regional cuisine, aam ka chunda aka chundo, a Gujarati sweet mango pickle recipe and a close cousin to mango chutney recipe or aam ki launji. Most of Western and Northern parts of India make a sweet achaar with grated raw mangoes that are sour and sugar or jaggery. Based on the region it is prepared the spices used in making the chunda differ sligthly. Its lip smackingly good, addictive mango pickle that can be slathered over toast, used as a dip with mathri, chips or corn chips and a side with paratha, rotis. Traditionally it is served with Gujarati chickpea flour (besan) based snacks like thepla (methi flatbread), fafda, ganthia and khari puri. The ultimate combination is chundo with thelpa. \r\n\r\ngujarati chundo\r\n\r\nThe traditional way to make aam ka chunda or chundo is by sun drying method. It is a time taking process but not laborious. Grated mangoes and sugar are mixed and sun dried for a week to ten days till the sugar takes a thick syrupy texture. Minimal ingredients and high on flavor. I have prepared the traditional method but you can follow the short cut method to make this gujarati sweet mango pickle recipe by cooking it over stove top. This pickle is instant, quick to make and equally tasty as the sun dried method. \r\n\r\ngrated mango and sugar - before and after sun drying\r\n\r\nTo cook over stove top, follow the ingredients with same quantities mentioned in aam ka chunda recipe. Heat a heavy bottomed pan on low flame, add grated mango, cloves, cinnamon and sugar. Cook on low flame stirring continuously till sugar dissolves. The mixture will become thin. You will find bubbles appearing on the surface and and as they subside, continue to cook such that the mixture become slightly thick. This could take quite sometime, so please be patient. Do not over cook as it will crystallize. Turn off flame and allow the mixture to come to room temperature.  The mixture will thicken on cooling. Add salt, chili powder and roasted cumin powder and mix. Remove to a sterilized bottle and refrigerate. Sweet mango pickle is ready to be consumed the moment it is cooked. \r\n\r\ngujarati sweet mango pickle\r\n\r\nLearn how to make aam ka chunda or gujarati sweet mango pickle recipe (sun drying method)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/aam-chunda1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aam-chunda1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aam-chunda1-300x300.jpg","style":["easy","traditional"],"course":["chutney"],"special-diet":["eggless","dairy free","nut free","egg free","gluten free","vegetarian","vegan","kid friendly"],"cuisine":["gujarati"],"prep-time":"15","main-ingredient":["raw mango","sugar"],"serves":"25","goes-well-with":["paratha","thepla"],"author":null,"type":"post","categories":["All Recipes","Gujarati Recipes","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["easy-vegetarian-recipes","gujarati-food","mangoes","mango_pickle","raw_mango"]}