{"id":15629,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/10\/kulfi-recipe-easy-malai-kulfi\/","title":"Kulfi Recipe","content":"Kulfi recipe, traditional Indian ice cream, easy malai kulfi \r\n\r\nkulfi\r\n\r\nKulfi is undoubtedly India's best sweet dessert on a stick. This classic, creamy, traditional Indian ice cream is centuries old and has been passed down from the Mughal kitchens. A rich frozen dessert that is made with reduced full fat milk and flavored with either cardamom or saffron. Milk is slow cooked on low flame over a long period with constant stirring till it reduces to one third of its original quantity. The reduced milk is slightly thick rabri with bits of malai or top of milk. \r\n\r\nkulfi moulds ready to be frozen\r\n\r\nPatience is the key to make an authentic homemade kulfi recipe. There is no short cut method to achieve the original flavor of kulfi. You can make instant versions of kulfi with condensed milk, evaporated milk and cream. The instant kulfi does taste good but the traditional method of making malai kulfi is the best kulfi ever. Nuts of your choice like unsalted and raw almonds, cashew nuts or pistachios that are roughly chopped are also added which give a good nutty texture to the kulfi. \r\n\r\nThere is another version where mawa or khoya is added for a rich flavor. Traditionally kulfi is set in terracotta pots or matka. You can set kulfi in kulfi moulds that are available in most stores. Alternately you can set it in stainless steel glass or katori or popsicle molds.\r\n\r\nOne can add different flavorings according to one's choice. Pureed fruit of mango, banana, pineapple and other fruits can also be added to the kulfi mixture before setting it in the moulds. \r\n\r\nTraditional Indian ice cream, kulfi\r\n\r\nThe authentic Kulfi recipe calls for the use of full fat milk and sugar. Sugar, cardamom or saffron and chopped nuts are added to the milk once it reaches half its original quantity. Skimmed milk will not give the rich flavor or texture. You need to be alert and ensure that the milk does not burn by stirring it at regular intervals. It does take some time to make kulfi but its totally worth the effort and time as the flavor of slow cooked milk is far superior to any other method followed to make it. A culimary gem among Indian dessert recipes. I encourage you to try this easy malai kulfi at least once and you can thank me later. :)\r\n\r\nMalai Kulfi\r\n\r\nLearn how to make kulfi at home or easy malai kulfi","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/malai-kulfi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/malai-kulfi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/malai-kulfi-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","gluten free","vegetarian","kid friendly"],"cuisine":["north indian"],"cook-time":"90","prep-time":"5","main-ingredient":["full fat milk","sugar"],"serves":"5","goes-well-with":["rose syrup"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Festival Foods","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["dessert","easy-vegetarian-recipes","festival_sweets","sweets"]}