{"id":15654,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/11\/fruit-chaat-recipe\/","title":"Fruit Chaat Recipe","content":"Fruit chaat recipe, Indian style fresh fruit salad that's healthy and refreshing\r\n\r\nFruit Chaat\r\n\r\nWe have been loading ourselves with lot of fresh fruit especially for our mid day meal. We usually have a late brunch and end up having fruits, smoothies, sandwiches or wraps for lunch. Yesterday I made fruit chaat, Indian style. One of the best fresh fruit salad I have eaten in the past few weeks. It is light, easy on the stomach and high on flavor. Fruit chaat recipe is one the easiest and quickest salad to put together. It can be served as a meal on its own or at the end of a meal or as a mid day snack.\r\n\r\nFruit Salad\r\n\r\nThis refreshing, rainbow fruit chaat recipe combines the fruity flavors of summer like watermelon, banana, apple and pineapple into one colorful summer salad. The cut fruits are tossed in a mixture of freshly ground black pepper, roasted cumin powder, chaat masala and black salt. A few mint leaves can also be added for a minty fresh flavor. This summer in a bowl which is full of nutrients and vitamins has an unbeatable flavor. Not only is the fruit chaat refreshing but it also helps detox your body. Once in a while, its good to go on a fruit diet to cleanse the system. I have blogged quite a few high raw food salads earlier that are not only tasty but also detoxify the system.\r\n\r\nThis cheerful summer bowl makes for a perfect salad for summer entertaining. You are sure to hear a lot of 'ooh's and aah's the moment your guests set eyes on the vibrant colored salad. A perfectly sweet, summer-y, fruit chaat recipe that you should be making and eating more often during the hot sultry days. It will not only brighten your day but will also keep you refreshed and cool.\r\n\r\nIndian fruit chaat to beat the summer heat\r\n\r\nLearn how to make fruit chaat recipe, Indian style","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/how-to-make-fruit-chaat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-fruit-chaat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-fruit-chaat-300x300.jpg","style":["easy","quick"],"course":["salad"],"special-diet":["eggless","dairy free","gluten free","nut free","vegan","vegetarian","kid friendly"],"cuisine":["indian"],"prep-time":"15","main-ingredient":["fresh fruits"],"serves":"3","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Fruit Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Raw Food Recipes","Salad Recipes"],"tags":["fruit","Fruit Recipes","fruit-salad","healthy-recipe","indian-salad-recipe","salad","summer_salads","vegan_diet","vegan_recipe"]}