{"id":15669,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/14\/fruit-lassi-mixed-fruit-smoothie-recipe\/","title":"Fruit Lassi, Mixed Fruit Smoothie Recipe","content":"Fruit lassi, a mixed fruit smoothie recipe with yogurt, Indian style\r\n\r\nFruit Lassi\r\n\r\nWith summer at its peak, smoothie, fruit juice, sharbat, milkshake, iced tea, tender coconut water, fresh seasonal fruits and salad are the way to go in our home. I tend to go the smoothie way during the hot season since its quick to make, calls for seasonal fresh ingredients, versatile, filling and healthy. Yesterday, I made fruit lassi or mixed fruit smoothie with yogurt that combines a few of my favorite fresh fruits like apple, banana, mango, grapes and musk melon. It is a popular Indian beverage sold by street vendors during the summer months.\r\n\r\nAlong with a medley of fruity flavors, fruit lassi is loaded with vitamins and antioxidants and has a natural sweetness. Not to mention the gorgeous pink shade. The refreshing mixed fruit smoothie has a sweet tart flavor and a creamy texture similar to aam ki lassi or mango lassi. Kids just love it and its a great way to get them to eat a variety of fruits in the form of a smoothie. A tip for a smooth creamy textured lassi is to freeze the banana for a while before blending it along with the rest of the chilled fruits. \r\n\r\nMixed fruit smoothie\r\n\r\nA refreshing blend of seasonal fruits that make for a good looking beverage to kick start your day on a bight note. Perfect for breakfast or a mid day snack that is filling and will see you through till lunch time. You can top the fruit lassi with cut fresh fruit and spice it with cinnamon powder instead of cardamom. One of the best Indian beverage recipes to try this summer.\r\n\r\nMixed fruit smoothie\r\n\r\nFollow the instructions to learn how to make fruit lassi or mixed fruit smoothie recipe\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/fruit-lassi-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fruit-lassi-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fruit-lassi-recipe-300x300.jpg","style":["easy","quick"],"course":["beverage"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"prep-time":"15","main-ingredient":["yogurt","fruits"],"serves":"3","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Indian Drink - Sharbat Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["drinks","easy-vegetarian-recipes","fruit","Fruit Recipes","indian-food","smoothie","summer-drink"]}