{"id":15694,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/16\/virgin-pina-colada-recipe\/","title":"Virgin Pina Colada Recipe","content":"Virgin pina colada recipe with coconut milk, smoothie recipes to beat the heat\r\n\r\nvirgin pina colada\r\n\r\nVirgin pina colada recipe is basically a mocktail with pineapple juice and thick coconut milk. Pina colada is an alchoholic Mexican drink that calls for rum but I have made a non-alchoholic virgin pina colada smoothie that kids can enjoy during the summer months. Frozen pineapple chucks and thick coconut milk are the main ingredients to make this thick, creamy smoothie recipe.\r\n\r\nvirgin pina colada with coconut milk\r\n\r\nIts best to use frozen pineapple chunks and freshly prepared thick coconut milk. I suggest you make this beverage only at the time of serving as virgin pina colada smoothie tastes best when freshly made. I usually place fresh pineapple chunks in the freezer for 2-3 hours and extract coconut milk from freshly grated coconut. It can be sweetened with sugar or honey. A tropical fruity beverage that is rich in Vitamin C with the nutritional goodness of coconut milk and its vegan and gluten free too. A perfect smoothie to kickstart your day or to beat the heat on a hot day. Do add it to your repertoire of mocktail recipes.\r\n\r\nvirgin pina colada smoothie \r\n\r\nLearn how to make virgin pina colada recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/virgin-pina-colada-smoothie.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/virgin-pina-colada-smoothie-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/virgin-pina-colada-smoothie-300x300.jpg","style":["easy","quick"],"course":["beverage"],"special-diet":["eggless","dairy free","gluten free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"prep-time":"15","main-ingredient":["pineapple","coconut milk"],"serves":"3","goes-well-with":["snack"],"author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Indian Drink - Sharbat Recipes","Mexican Recipes"],"tags":["cooler","fruit","Fruit Recipes","pineapple","summer-drink","summer_cooler"]}