{"id":15711,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/19\/aam-ka-achar-punjabi-mango-pickle-recipe\/","title":"Aam Ka Achar, Punjabi Mango Pickle Recipe","content":"Aam ka achar or Punjabi mango pickle recipe using raw mangoes, Indian spices & mustard oil\r\n\r\naam ka achar\r\n\r\nI am a pickle fiend and relish a variety of regional cuisine traditional pickle recipes made by home cooks. With an abundance of tart home grown mangoes, I got down to making a small batch of aam ka achar or Punjabi mango pickle recipe. I had jotted down an authentic aam ka achar recipe from a Punjabi family who were our neighbors during my growing years. I have made it a couple of times and the flavor was spot on, just like the pickle I had relished at my neighbors home. \r\n\r\nI always look out for passed down family pickle recipes and try to preserve the cooking traditions of our elders. Recently at a family wedding, celebrations were in full swing with everyone indugling in revelry while I was sitting with a group of elderly relatives (read great grandmothers and grandmothers) jotting down culinary notes on a tissue paper about heirloom family recipes. Whenever I get a chance to spend time with family elders, our discussion centers around family culinary traditions. \r\n \r\nraw mango pieces for achar ~ spices mixed for aam ka achar\r\n\r\nOn Sailu's Kitchen facebook page, I have been receiving requests to post regional cuisine based mango pickle recipes since its the season of mangoes. A few days ago, a loyal reader sent me a recipe request - \"aam ka achar banane ki vidhi bataye\" (how to make aam ka achar). By the time she had posted her request I had already finished making the pickle and I was waiting for it to mature so that I can blog aam ka achar recipe. One of the easiest pickle recipe provided you take certain precautions in cleaning the mangoes and keeping the pickling area moisture free as well as the jars which are used to store the pickle. \r\n\r\nAam ka achar preparation is completely different from the Andhra style or South Indian mango pickle. Whole spices like mustard seeds, fennel seeds, fenugreek seeds, nigella seeds, turmeric powder, red chili powder, salt and mustard oil are the main ingredients that go into the making of aam ka achar. Each home cook has her\/his own unique blend of pickle masala based on the region\/community they belong. Mustard oil or sarson ka tel is used to give the pickle its  flavor. The recipe of aam ka achar that I am posting today is popular in Punjab and is best relished with hot parathas and mathri.\r\n\r\npunjabi mango pickle recipe\r\n\r\nDo check out more regional cuisine mango pickle recipes like aam ka chunda or Gujarati sweet mango pickle, aam ki launji or mango chutney recipe and avakai or mango pickle recipe andhra style.\r\n\r\npunjabi mango pickle recipe\r\n\r\nLearn how to make aam ka achar or punjabi mango pickle recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/aam-ka-achar-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aam-ka-achar-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/aam-ka-achar-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["chutney"],"special-diet":["eggless","dairy free","gluten free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["punjabi"],"cook-time":"1","prep-time":"45","main-ingredient":["mangoes","mustard oil"],"serves":"25","goes-well-with":["paratha"],"author":null,"type":"post","categories":["All Recipes","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["mango","mango_pickle","pickle","raw-mango","vegan_recipe"]}