{"id":15732,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/21\/nongu-paal-taati-munjalu-dessert\/","title":"Nongu paal, taati munjalu or toddy palm seeds summer dessert","content":"Nongu paal, taati munjalu or toddy palm fruit dessert popular in S.India especially Tamil Nadu\r\n\r\nnongu paal\r\n\r\nInspite of the sultry weather, I look forward to summer for three reasons - mangoes, toddy palm seeds (ice apple\/taati munjalu) and vacation. I absolutely cannot do without any one of them. :) Yesterday, I made Nongu paal, a sweet summer dessert made with sugar palm or toddy palm seeds (nongu in tamil) popular in Tamil Nadu. A perfect summer drink to beat the heat. \r\n\r\nRecently, I posted a picture of toddy palm seeds in Sailu's Kitchen facebook page and there has been a tremendous response to that post. I gathered a lot of information about toddy palm seeds, its health benefits, desserts prepared with it as well as the local names by which it is known in different parts of the country. For the benefit of my dear readers, I'm also sharing the local names of toddy palm seeds. Telugu - Taati munjalu, Tamil - Nongu, Bengali - Taal shash, Gujarati - Tadfali, Talfadi, Galeli, Konkani - Targula, Kannada - Taati lingu, Tulu - Eroll, Marathi - Tadgola, Malayalam - Karimpana thengu, Urdu - Munjal, Odiya - Tala Saja, Bihar - Taar ka koa, Hindi - Tari or Taal. It is a natural coolant, contains vitamins and minerals, improves digestion and works as a mild laxative too.\r\n\r\ntaati munjalu, toddy palm fruit, nongu, tadgola\r\n\r\nIn Andhra, toddy palm seed vendors sitting with clusters of palm fruit along the highway road is a common sight. I am fortunate to have access to fresh toddy palm seeds every summer. Ever day, a sugar palm seeds vendor comes home and delivers fresh taati munjalu. Often, I crush the peeled tender taati munjalu, add some sugar and chill for an hour before relishing it. \r\n\r\nDuring my visit to Tamil Nadu, I relished nongu sharbat and rose flavored nongu paal sold by street hawkers. I have never seen taati munjalu being transformed into a dessert in Andhra. I was quite intrigued with the idea of adding crushed nongu to nannari sharbat (sarsaparilla  orsugandhi) and served chilled. Both nannari and nongu have a cooling effect on the body. Digging into a bowl of chilled nongu paal on a hot day is like manna from heaven. It leaves you refreshed and is quite addictive too.\r\n\r\nnungu paal\r\n\r\nLearn how to make nongu paal","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/nongu-dessert.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nongu-dessert-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nongu-dessert-300x300.jpg","style":["easy","quick"],"course":["beverage"],"special-diet":["eggless","nut free","dairy","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"20","prep-time":"5","main-ingredient":["toddy palm fruit","milk"],"serves":"2","author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Indian Drink - Sharbat Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["fruit","Fruit Recipes","summer-drink","summer_cooler"]}