{"id":15768,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/24\/nungu-recipes-rose-nungu-sharbat\/","title":"Nungu recipes, rose milk with nungu & nungu sarbath with nannari","content":"Nungu recipes, rose nungu and nungu sarbath with nannari syrup to beat the heat\r\n\r\nrose nungu\r\n\r\nThe mercury is rising higher each day and summer has reached its peak with no sign of respite. Scorching conditions with high humidity! We are guzzling down tender coconut water, smoothies and refreshing drinks like there is no tomorrow. With an abundance of toddy palm fruits, I made two varieties of drinks using them that are very refreshing and invigorating, perfect for the hot weather. These summery drinks are not only cooling to the system but absolutely delicious too. \r\n\r\n[caption id=\"attachment_15772\" align=\"alignnone\" width=\"811\"] tadgola, taati hingu, taal[\/caption]ice apple, taati munjalu, nungu\r\n\r\nToddy palm seeds are nutritious loaded with vitamins and minerals. I am so glad that nongu or taati munjalu is getting the credit that it deserves as being versatile than just a plain palm seed to relish in its natural form. I have seen toddy palm seeds being used a lot in Tamil Nadu street food drinks where street hawkers have creatively concotted sarbaths and desserts. I should try using them to make ice cream, kulfi and other desserts that usually use fruits like strawberry or litchi. Will keep you posted on those new concoctions in future posts.\r\n\r\nnungu sarbath\r\n\r\nDuring our visit to Rameswaram last summer, we came across a street hawker selling nongu sarbath which is nothing but nannari sarbath (sugandhi drink made with   sarsaparilla roots) with addition of crushed fresh toddy palm seeds. Absolutely loved the flavor. \r\n\r\nYesterday, I posted nongu paal, sweetened milk with crushed nongu that is flavored with cardamom. Another variation to nongu paal recipe is to add rose syrup or rooh afsa. Believe me, rose milk nungu is brilliant. Absolutely refreshing, cooling to the body and delicious. I am sharing two nungu recipes in today's post. Simple recipes that even a child can whip up in no time.\r\n\r\nnungu drink\r\n\r\nLearn how to make nungu recipes like rose nungu and nungu sarbath","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/nungu-recipes.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nungu-recipes-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/nungu-recipes-300x300.jpg","style":["easy","quick"],"course":["beverage"],"special-diet":["eggless","dairy","egg free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"15","prep-time":"15","main-ingredient":["toddy palm seeds"],"serves":"2","author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Indian Drink - Sharbat Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["drinks","nannari","sugandhi","summer-drink","summer_cooler"]}