{"id":15789,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/25\/falooda-sev-recipe-how-to-make-falooda-sev\/","title":"Falooda sev recipe","content":"Falooda sev recipe, how to make falooda sev at home with corn flour for desserts like falooda\r\n\r\n\r\n\r\nFalooda is a rich Indian dessert that is apt for the summer days. Falooda, which has its origins in ancient Persia, is a cold beverage that consists of noodle like delicate strands, tukmaria or falooda seeds (sabja or basil seeds), milk and rose syrup. One of the prettiest layered dessert in a glass and a gem among Indian recipes. Before I post falooda recipe, I am sharing falooda sev recipe which is an essential ingredient to make falooda. Falooda sev is also served with kesar kulfi and is a popular dessert called kulfi falooda. \r\n\r\nI have never had success in finding falooda sev manufacturers in Andhra\/Banglore\/Chennai. It makes sense to make falooda sev at home as its a super easy recipe to prepare in few minutes. Basically store bought falooda noodles or sev is made of tapioca or sago. The falooda sev recipe I am sharing uses corn flour. You can use arrowroot starch in place of corn flour. The falooda sev machine that I use is a bhujia press or sev maker aka jantikalu gottam (in telugu) to make falooda noodles.\r\n\r\ncorn flour mixture cooking on low flame\r\n\r\ncorn flour mixture thickening on cooking\r\n\r\ncooked corn flour mixture pressed through sev\/bhujia maker ~ falooda sev in cold water\r\n\r\nCorn flour and water mixture is cooked to form a thick, glossy mixture which is then passed through a bhujia maker to form thin noodles or falooda sev. These thin transparent strands are stored in ice cold water so that they do not stick to each other and to prevent them from forming a lump. Homemade falooda sev can be stored in cold water in the fridge for two to three days. So why buy falooda sev when you can make freshly pressed falooda seviyan at the comfort of your home. :)\r\n\r\nfalooda sev\r\n\r\nLearn how to make falooda sev recipe at home with corn flour and bhujia press\/sev press","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/falooda-sev.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/falooda-sev-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/falooda-sev-300x300.jpg","style":["easy","quick"],"course":["dessert"],"special-diet":["eggless","dairy free","nut free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"10","prep-time":"10","main-ingredient":["corn flour"],"serves":"6","goes-well-with":["falooda"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Flour Recipes","Indian Drink - Sharbat Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["dessert","noodles","sweet"]}