{"id":15816,"permalink":"http:\/\/www.sailusfood.com\/2015\/06\/05\/ice-cream-recipe\/","title":"Ice cream recipe","content":"Ice cream recipe, how to make ice cream at home without egg and without ice cream maker\r\n\r\nice cream\r\n\r\nI am going to share with you an absolutely easy basic vanilla ice cream that you can make at home almost effortlessly. I am not sure why it took me so long to post vanilla ice cream recipe. In fact, I had made this all time favorite frozen dessert more than two weeks ago when the temperatures were soaring and unbearable. Yes, the month of May is the ice cream season of India.\r\n\r\nThe secret ingredient that gives ice cream its creamy, soft and incredibly smooth texture is corn flour. If I want to serve ice cream as an after dinner dessert, I usually boil the milk around breakfast time and allow it to come to room temperature. Around noon, when I cook lunch I finish the ice cream making process and freeze it. Between lunch and tea time, I am done with stirring the ice cream mixture at least 4 times and the finally I blend the slush textured icecream mixture in a blender before freezing it. If you avoid mixing the cold ice cream mixture, you will end up with a hard, frozen block of ice. It will be impossible for you to scoop the ice cream off the container. The stirring and blending is essential to restrict the formation of ice crystals and yield a soft, light, smooth textured ice cream that can be easily scooped.\r\n\r\nhomemade ice cream\r\n\r\nthickened boiled milk - fresh cream beaten\r\n\r\nthickened boiled milk beaten - fresh cream & thickened milk mixed\r\n\r\nice cream mixture ready to be freezed - homemade ice cream\r\n\r\nAfter many attempts of trying to create that perfect textured ice cream that does not melt quickly, I have settled with this tried and tested ice cream recipe. This style of ice cream is different from the French style ice cream that uses eggs to make a custard base. Popular Philadelphia style ice cream uses only milk and cream. Believe me, this eggless dessert is insanely delicious. \r\n\r\nSimple, foolproof recipe of ice cream that is eggless and can be made without an ice cream maker. Do yourself a favor and give this homemade icy goodness a try. You can thank me later.\r\n\r\nvanilla ice cream\r\n\r\nLearn how to make ice cream recipe at home","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/06\/how-to-make-ice-cream.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-ice-cream-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-ice-cream-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"cook-time":"40","prep-time":"600","main-ingredient":["full fat milk","vanilla essence"],"serves":"8","goes-well-with":["caramel sauce"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Sweet Dessert Recipes"],"tags":["dessert","ice cream","vanilla"]}