{"id":15827,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/26\/falooda-recipe\/","title":"Falooda recipe","content":"Falooda recipe, easy rose falooda drink with ice cream\r\n\r\nfalooda recipe\r\n\r\nYesterday, I had posted how to make falooda sev at home and today I am sharing falooda recipe. Falooda is one the best layered dessert in a glass that has its origins in Iran. This multi-textured summer drink has made its entry into many countries like India, Pakistan, Middle East, Bangladesh, Myanmar (Burma) and Turkey. The Parsis who migrated to India from Iran introduced this sweet concoction to the Indian people. It is an integral part of the menus of street food hawkers that sell drinks, ice cream parlours and restaurants which serve numerous variations to the basic falooda recipe. \r\n\r\nThe basic falooda recipe, a milk based dessert, has rose syrup, falooda sev or vermicelli made from arrowroot or corn flour, milk, falooda seeds (basil seeds) and ice cream going into it. Indian falooda recipe has evolved into various flavors like saffron, pista, mango, strawberry, chocolate, rabri etc. Fruit falooda is also very popular where the basic falooda recipe is layered with fresh cut fruits.\r\n\r\nfalooda indian style\r\n\r\nHomemade falooda recipe is easy to put together provided you have all the falooda ingredients on hand. Falooda sev can be made at home using corn flour. Falooda seeds need to soak for a few minutes to swell. Use full fat milk and I usually boil the milk till it reduces to three fourth of its original quantity as it does wonders to enhance the creaminess and flavor. Use good quality rose syrup or rooh afsa. Pistachios and almonds add a bit of crunch and richness to the falooda. Top it off with a scoop of vanilla ice cream and you have a delicious dessert in a glass. \r\n\r\nfalooda ingredients - sabja, jelly, falooda sev and jelly\r\n\r\nIts good to over indulge in a falooda once in a while especially on a hot sultry day. This heavenly dessert has contrasting flavors and textures with chewy falooda seeds, soft noodles and jelly, melt in the mouth ice cream and crunchy nuts. Falooda drink or milkshake is truly a delightful summer dessert that is addictive. Every sip is luscious and truly a taste of heaven!\r\n\r\nTomorrow you can look forward to falooda kulfi recipe, where falooda and kulfi are served together drizzled with rose syrup. \r\n\r\nLearn how to make falooda recipe indian style","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/how-to-make-falooda.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-falooda-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-falooda-300x300.jpg","style":["easy","quick","traditional"],"course":["beverage"],"special-diet":["eggless","dairy","nuts","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"15","prep-time":"45","main-ingredient":["milk","falooda sev","rose syrup"],"serves":"2","goes-well-with":["ice cream"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Indian Drink - Sharbat Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["drinks","rose-milk","rose-syrup","summer-drink","sweet"]}