{"id":15851,"permalink":"http:\/\/www.sailusfood.com\/2015\/05\/28\/kulfi-falooda-recipe\/","title":"Kulfi falooda recipe","content":"Kulfi falooda recipe, Indian street food style dessert\r\n\r\nkulfi falooda\r\n\r\nKulfi falooda recipe is one of the easiest Indian desserts you can make at home. There are many variations of kulfi falooda that I have eaten off the streets during my travels. Basically kulfi or no churn, eggless, Indian ice cream made with full fat milk is placed on a bed of sweet basil seeds and falooda noodles, drizzled with rose syrup and\/or khus syrup and garnished with nuts and dry fruits. A delicious North Indian summer dessert that is hard to resist especially on a hot sultry day.\r\n\r\nI have already blogged the recipe of kulfi and falooda sev recipe. Do refer to these summer desserts while making falooda kulfi recipe. Many street hawkers make a killing selling popular summer desserts like kulfi, falooda, and kulfi falooda during the summer season. Absolutely refreshing, cooling and outright delicious. Kulfi is a frozen dessert like ice cream while falooda is a drink which has rose milk, sabja and falooda sev as its main ingredients. Kulfi falooda is not a drink but a rich and creamy frozen dessert accompanied with chewy falooda noodles which have been flavored with rose syrup. \r\n\r\nIf you are lazy to make kulfi or falooda sev at home, you can buy store bought kulfi and falooda sev and fix this dessert in minutes. You can add fresh cut fruits, rabri or jelly to add some texture to the dessert. Your kids are going to love it and you too. And we are not going to talk about the calories while relishing kulfi falooda. :)\r\n\r\nkulfi falooda with rose syrup and jelly\r\n\r\nhow to make kulfi falooda recipe at home","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/05\/kulfi-falooda-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kulfi-falooda-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kulfi-falooda-recipe-300x300.jpg","cook-time":"90","prep-time":"10","main-ingredient":["milk","falooda noodles"],"serves":"2","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Indian Sweets Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["dessert","falooda","kulfi","sweet","sweets"]}