{"id":15865,"permalink":"http:\/\/www.sailusfood.com\/2015\/06\/02\/kesar-pista-kulfi-recipe\/","title":"Kesar Pista Kulfi Recipe","content":"Kesar pista kulfi recipe, frozen Indian dessert perfect to beat the heat\r\n\r\nkesar pista kulfi\r\n\r\nTemperatures are coming down but humidity levels are high. Over the past few days, I have prepared a lot of chilled summer desserts using ripe mango. I also made kesar pista kulfi which is a variant of traditional Indian ice cream, authentic malai kulfi. This creamy, grainy, frozen dessert is made with reduced full fat milk, malai or fresh cream and flavored with kesar aka saffron, cardamom and chopped pistachios. \r\n\r\nAn all time favorite in our home and while preparing it I couldn't help reminse relishing this addictive dessert on a stick in the gallis (narrow lanes) of Charminar area of Hyderabad especially during Ramzan. One particular kulfiwallah served kesar pista kulfi drizzled with rose syrup and a generous sprinkling of pistachios. I can never ever forget that culinary memory which has been etched in my heart. :)\r\n\r\nkesar pista kulfi with rose sryurp\r\n\r\nWhile making kulfi, I wouldn't suggest going the short cut way using milk powder, evaporated or condensed milk unless you are pressed for time. For real simple delicious flavor, slow cook full fat milk till it thickens and changes color. Saffron adds richness and an aromatic flavor that gives kulfi a nice shade and flavor. Unsalted pistachios that are roughly chopped give a nutty texture to the kulfi. I have added cornflour to the reduced  milk while stirring constantly till the milk thickened into a smooth mixture devoid of any lumps. Addition of cornflour gives a creamy texture and reduces crystal formation in the kulfi while it freezes.\r\n\r\nIf you want to make a slightly low fat version, use skimmed milk and do use corn flour to thicken the milk. You can set the kufli the traditional way in terracotta pots or matka. I set kesar pista kulfi in aluminum kulfi moulds that are available in most stores. It can also be set in stainless steel katori or popsicle molds. Though it is a slightly time consuming dessert, kesar pista kulfi recipe is easy to put together provided you have access to good quality saffron and fresh unsalted pistachios.\r\n\r\nkesar pista kulfi dessert\r\n\r\nLearn how to make kesar pista kulfi recipe at home","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/06\/how-to-make-kesar-pista-kulfi-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-kesar-pista-kulfi-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-kesar-pista-kulfi-recipe-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","nuts","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"90","prep-time":"5","main-ingredient":["milk","saffron"],"serves":"10","goes-well-with":["rose syrup"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["dessert","sweet","sweets"]}