{"id":15905,"permalink":"http:\/\/www.sailusfood.com\/2015\/06\/19\/jigarthanda-recipe-special-drink-madurai\/","title":"Jigarthanda recipe, special drink of Madurai","content":"Jigarthanda recipe, a special drink of Madurai perfect for the hot summer days\r\n\r\nJigarthanda - Madurai special drink\r\n\r\nI first tasted Jigarthanda as a college student during a trip to Madurai. One of the best tasting summer drink which has its origins in Madurai. This unique flavored milk based drink, introduced by the Mughals who settled down South, was given the name Jigarthanda. Popular as jil jil jigarthanda, this drink has made its way to many restaurants and drink parlours around Tamil Nadu. The ingredients that go into the making of the jigarthanda drink recipe have a cooling effect on the system and is a close cousin of falooda drink which has varied textures and flavors. \r\n\r\nBadam pisin ~ edible almond gum\/badam gond\r\n\r\nThe main ingredients of jigarthanda recipe are reduced full fat milk, reduced milk ice cream and two natural coolants i.e, badam pisin (edible almond gum) and nannari (sarsaparilla roots) syrup. The gum that secretes from the bark of the almond tree dries up to form small light golden brown hued hard granules. It also goes by the name badam gond and badam pisiru. The small rock like granules are soaked in water for a couple of hours to yield a thick transparent jelly like substance. It has a lot of medicinal properties and very cooling to the body. Not only is it a natural coolant, it is recommended for weight gain in young children. \r\n\r\nNannari syrup also known as sugandi is made from Sarsaparilla root, a pleasant smelling herb. This herb has medicinal properties and makes for a great diuretic, cools the body and prevents heat strokes. I have already blogged the recipe for nannari syrup and nannari sarbath recipe. You can use store bought nannari syrup which is available in local native ayurvedic stores which also sell badam pisin.\r\n\r\nJigarthanda - summer special\r\n\r\nFull fat milk is reduced by slow boiling the milk till it thickens and reduces to almost half of its original quantity. The color of the reduced milk which is light brown gives jigarthanda drink its unique color and flavor. The ice cream used in the drink is also made with reduced milk. You can use store bought vanilla ice cream in its place. I have already blogged ice cream recipe which I have made with reduced milk. \r\n\r\nDo try making this unique, refreshing indulgent summer drink at home and add it to your collection of Indian drink recipes. You can also serve as an after lunch or dinner dessert. If you cannot find badam pisin at your local market substitute it with china grass or agar agar.  \r\n\r\nJigarthanda - summer special\r\n\r\nHow to make jigarthanda drink recipe at home","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/06\/jigarthanda-drink-recipe-madurai.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/jigarthanda-drink-recipe-madurai-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/jigarthanda-drink-recipe-madurai-300x300.jpg","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"90","prep-time":"10","main-ingredient":["milk","badam pisin"],"serves":"3","goes-well-with":["ice cream"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes","South Indian Recipes","Sweet Dessert Recipes"],"tags":["dessert","drinks","ice cream","summer-drink"]}