{"id":15959,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/07\/mango-kulfi-recipe\/","title":"Mango Kulfi Recipe","content":"Mango kulfi recipe - indian ice cream with a mango flavor, unbeatable Indian dessert\r\n\r\nMango kulfi\r\n\r\nThere is absolutely no respite from the hot sultry weather that we are experiencing since the past two weeks. Looking forward for some light showers with cool weather. Meanwhile, I have been relishing some refreshing desserts using ripe mango before the mango season ends. One of the easy desserts that I made was mango kulfi recipe. Ever since I have posted the kulfi recipe, I have received requests for recipe of mango kulfi. I made it slightly different from the authentic style kulfi which calls for boiling the milk over slow flame for a long duration of time. I decided on a short cut method and followed an easy mango kulfi recipe with condensed milk and fresh mango pulp.\r\n\r\neasy mango kulfi to beat the heat\r\n\r\nAn absolutely no cook mango kulfi recipe with minimal ingredients that you can prepare in less than 15 mts. You can put your ripe mangoes to full use by making a batch of mango kulfi to beat the heat. Inspite of going the quick or instant way, the result is amazingly good using condensed milk and cream. It has a rich and creamy texture with an unbeatable flavor. Utterly delicious Indian style ice cream that makes for a fantastic dessert to beat the heat.\r\n\r\nbest mango kulfi\r\n\r\nLearn how to make mango kulfi recipe at home","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/how-to-make-mango-kulfi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-mango-kulfi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-mango-kulfi-300x300.jpg","style":["easy","quick"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["indian"],"prep-time":"15","main-ingredient":["mango pulp","condensed milk"],"serves":"8","goes-well-with":["falooda"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Fruit Recipes","Indian Milk Recipes","Indian Sweets Recipes","North Indian Recipes","Sweet Dessert Recipes"]}