{"id":16195,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/08\/mango-sago-recipe\/","title":"Mango sago recipe","content":"Mango sago recipe, easy mango desserts to beat the heat\r\n\r\nMango sago\r\n\r\nMango sago is a delicious, addictive pudding made with fresh mango pulp and tapioca pearls. There are many versions to the basic mango sago recipe based on the region its prepared especially in South Asian countries like Singapore, Thailand or Hong Kong. Coconut milk and palm sugar are usually an integral part of this classic mango dessert but I have used dairy and replaced palm sugar with normal white sugar. \r\n\r\nThis easy mango sweet dish has a light, fluffy, creamy texture bursting with mango flavor and a sutble aroma of cardamom. One of the easiest mango desserts that is refreshing, smooth, creamy and perfect to beat the heat.\r\n\r\nMango sago dessert\r\n\r\nThis pudding has my favorite fruit go into its making and am so glad that I made it before the mango season ends in my part of the world. One of the main ingredients of this eggless dessert is tapioca pearls or sago aka sabudana which is made from gluten free tapioca starch and comes in different sizes. I have used the large size tapioca pearls which I washed thoroughly and soaked in water for 20 minutes. After they have been soaked, I washed  and boiled the sago in lots of water till the pearls turned transparent yet held shape. The creamy texture of mango sago pudding contrasts perfectly with the chewy texture of soft tapioca pearls. \r\n\r\nInstead of going for that boxed pudding mix for your next party, do consider serving this delicious mango sago dessert to your friends and family. You can easily make this eggfree pudding ahead of time and nothing beats homemade desserts made with fresh ingredients and loads of love. \r\n\r\nMango sago pudding\r\n\r\nHow to make mango sago recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/mango-sago-pudding.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-sago-pudding-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-sago-pudding-300x300.jpg","style":["easy","quick"],"course":["dessert"],"special-diet":["eggless","dairy","gluten free","nut free","vegetarian","kid friendly","pregnancy"],"cuisine":["thai"],"cook-time":"45","prep-time":"60","main-ingredient":["mango","sago"],"serves":"5","goes-well-with":["ice cream"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Fruit Recipes","Sweet Dessert Recipes","Thai Recipes"],"tags":["dessert","mango","pudding","ripe-mango","sago","sweet"]}