{"id":16203,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/09\/mango-ice-cream-recipe\/","title":"Mango ice cream recipe","content":"Mango ice cream recipe, eggless and without an ice cream machine\r\n\r\nMango ice cream\r\n\r\nWe are going through a very bad heat wave with high humidity in the midst of the monsoon season. The weather is screaming for ice cream. The perfect frozen dessert to beat the heat would be one with a mango flavor since the mango season is almost ending. I love fruit based ice creams with mango ice cream being my favorite. Armed with a perfect easy mango ice cream recipe without an ice cream maker, I got down to making it recently. \r\n\r\nHomemade mango ice cream\r\n\r\nIt needs only 4 ingredients and yields a creamy textured ice cream with absolutely no crystal formation. Love the burst of real mango flavor due to the use fresh mango pulp. Its an eggless, no churn ice cream and melts fairly quicker than the basic ice cream recipe I have posted earlier. Perfectly scoopable, gorgeously addictive and a recipe worth trying for birthdays or summer parties.\r\n\r\nWith mango being the flavor of the season, I think this is the perfect homemade mango ice cream to make at this time of the year. With refreshing summer flavors and ultra creamy texture, its the best refreshing summer treat for mango lovers. Do bookmark this straightforward mango ice cream recipe to add to your list of easy mango desserts. \r\n\r\nFresh mango ice cream\r\n\r\nHow to make mango ice cream","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/mango-ice-cream.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-ice-cream-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-ice-cream-300x300.jpg","style":["easy","quick"],"course":["dessert"],"special-diet":["eggless","dairy","nut free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["western"],"prep-time":"20","main-ingredient":["mango","cream"],"serves":"6","goes-well-with":["mangoes"],"author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Fruit Recipes","Sweet Dessert Recipes"],"tags":["dessert","eggless","mango","sweet"]}