{"id":16241,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/12\/mango-phirni-recipe\/","title":"Mango Phirni","content":"Mango phirni, a North Indian style easy mango dessert made with mango puree, basmati rice & sugar\r\n\r\nMango phirni\r\n\r\nMango phirni is an ultimate comfort dessert in a bowl. A fantastically rich, creamy, silky smooth pudding that is popular as aam ki phirni in North India. Phirni is a festive sweet dish prepared with full fat milk, fragrant rice like basmati, sugar and cardamom. The main star of today's easy mango dessert is fresh mango puree which is added to the basic phirni recipe lending it a fruity sweetness.\r\n\r\nThe mango phirni recipe starts by boiling milk till it reduces to three fourth of its original quantity. Soaked raw rice paste that is diluted in milk is slowly added to the simmering milk and constantly stirred till the mixture is cooked through and thickens. Sugar, almond paste and cardamom are added in the final stage and cooked for a couple of more minutes. Once this mixture comes to room temperature, fresh mango puree is added and mixed to combine to a smooth consistency. It can eaten either warm or chilled. I like to serve chilled mango phirni that's garnished with chopped pistachios.\r\n\r\nAam ki phirni\r\n\r\nSoaked raw rice paste lends a really rich, creamy consistency to this phirni aka mango pudding. The simmering pudding has an aroma that is intoxicating due to the use of basmati rice. This eggless mango dessert is by no means overly sweet and the flavor of cardamom cuts through the richness of the mango phirni. \r\n\r\nMango phirni is one of the best Indian mango dessert to make for festivals like Ramzan or birthday celebrations. And if you are looking for an eggless Indian dessert to make for your next party, do try this deliciously decandent chilled mango dessert in a bowl.\r\n\r\nchilled mango pudding\r\n\r\nFollow the instructions below on how to make mango phirni ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/how-to-make-mango-phirni.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-mango-phirni-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-mango-phirni-300x300.jpg","style":["easy"],"course":["dessert"],"special-diet":["eggless","dairy","egg free","gluten free","vegetarian","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"45","prep-time":"20","main-ingredient":["mango","basmati rice","sugar"],"serves":"8","author":null,"type":"post","categories":["All Recipes","Eggless Dessert Recipes","Fruit Recipes","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","North Indian Recipes","Sweet Dessert Recipes"],"tags":["dessert","festival_sweets","mango","phirni","rice","sweet"]}