{"id":16268,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/16\/mango-rasam-indian-mango-recipes\/","title":"Mango Rasam","content":"Mango rasam is a South Indian style raw mango soup also popular as saar, saaru or charu\r\n\r\nMango rasam\r\n\r\nToday I'm posting one my favorite comforting soup made with raw mango pulp. Mango rasam! Light on the stomach, easy to make and absolutely flavorful. In many telugu speaking households you will find homecooks whipping up a variety of raw mango recipes other than the famed avakai (mango pickle) and its likes including pachadi, pulusu, pappu (dal), curry and rasam. \r\n\r\nDown South, in Tamil Nadu, Andhra and Karnataka especially in the Mangalore region, mango rasam is prepared during the mango season. Appe huli (mango rasam) is a traditional Mangalorean delicacy served at weddings and special occasions. Mango rasam is called maavina saar or saaru in kannada, mamidikaya chaaru in telugu and pacha manga rasam or mangai rasam in tamil. With minimal ingredients yet high on flavor, mango rasam preparation is almost similar across all regions with slight variations in terms of tempering and the use of rasam powder. This particular mango rasam recipe does not call for the use of rasam podi.\r\n\r\nRaw mango chopped ~ maavina saar or appe huli\r\n\r\nWith summer bringing in a bountiful harvest of mangoes and the fact that raw mango is rich in vitamin C, B vitamins, antioxidants and aids digestion, it should be included in one's diet. Mango rasam makes for a wonderful change from the regular everyday rasam. The key is to use a green mango that is almost beginning to ripen. It will have a slightly more sweet flavor which is ideal for making raw mango rasam recipe. The touch of spice and jaggery to the tangy mango broth  give it a delicious tropical flavor. Though traditionally, mango rasam is served with rice, it can also be served as a vibrant soup and makes for a wonderful vegetarian party appetizer.\r\n\r\nDefinitely one of the best mango rasam out there and if you are looking for raw mango recipes that are easy and flavorful, I'd recommend you bookmark this authentic South Indian rasam recipe that's vegan too. \r\n\r\nraw mango rasam\r\n\r\nHow to make mango rasam using raw green mango","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/mango-rasam-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-rasam-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-rasam-recipe-300x300.jpg","style":["easy","quick","traditional"],"course":["soup"],"special-diet":["eggless","nut free","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"30","prep-time":"10","main-ingredient":["raw mango","jaggery"],"serves":"5","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Indian Soup Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Mangalorean Recipes","South Indian Recipes"],"tags":["indian-cooking","indian_vegan_recipe","mango","rasam","soup"]}