{"id":16287,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/19\/rajma-recipe-no-onion-no-garlic-easy-north-indian-style\/","title":"Rajma recipe no onion no garlic, easy north indian style","content":"Rajma recipe, easy North Indian style no onion no garlic kidney beans curry that's satvik\r\n\r\nrajma masala no onion no garlic\r\n\r\nYesterday I prepared a satvik rajma recipe no onion no garlic. Rajma or kidney beans curry is a favorite among the many North Indian main course dishes. I usually prepare rajma masala with onions as the main base, the recipe of which I have already posted. Today's rajma is a simple straightforward Jain style recipe that doesn't take too much of your time in the kitchen. Only the soaking time of kidney beans and the making of homemade tomato puree takes some preparation time. \r\n\r\nrajma jeera rice\r\n\r\nI like to use freshly ground or hand pounded masalas in my cooking and especially so while preparing rajma. It enhances the flavor and the aroma is simply heavenly giving this north indian style rajma curry an authentic flavor as prepared in the langars of Gurudwaras. I have added a generous pinch of asafoetida as I have done away with onion and garlic. Use tomatoes that are not too sour and puree it to a smooth paste. A smooth tomato puree as well as a handful of mashed kidney beans lend a very special kind of smoothness and creaminess to the rajma recipe. \r\n\r\nIt is a stunning, creamy, flavorful curry that makes for a great side with roti, naan and rice. You will love this addictive cury served with warm rice. One of the most comforting Indian food out there. This rajma recipe with tomato should definitely make it to the list of satvik khana i.e no onion no garic recipes. You can serve it with rice, jeera rice or any flavored rice or naan\/roti. \r\n\r\nrajma no onion no garlic\r\n\r\nRajma chawal is pure vegetarian fare at its best!\r\n\r\nFollow the instructions on how to make rajma recipe without onion and garlic","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/rajma-recipe-no-onion-no-garlic-satvik.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rajma-recipe-no-onion-no-garlic-satvik-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rajma-recipe-no-onion-no-garlic-satvik-300x300.jpg","style":["easy","traditional"],"course":["main-course"],"special-diet":["eggless","dairy free","nut free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"60","prep-time":"15","main-ingredient":["kidney beans","tomato"],"serves":"5","goes-well-with":["rice","naan"],"author":null,"type":"post","categories":["Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","North Indian Recipes"],"tags":["curry","easy-vegetarian-recipes","indian_vegan_recipe","kidney-beans","rajma","rajma-masala"]}