{"id":16312,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/23\/rasam-recipe-south-indian-rasam\/","title":"Rasam recipe","content":"Rasam recipe, a traditional, authentic South Indian soup or appetizer made with tamarind\r\n\r\nrasam\r\n\r\nNo South Indian traditional meal or thali is complete without 'rasam'. Literally translated, 'rasam' means extracted juice or liquid . There are numerous versions of the basic rasam recipe prepared down South with each home cook lending his or her own unique touch to the rasam preparation. \r\n\r\nI am sharing \r\n~ an easy, most basic, simple, tasty South Indian rasam for beginners\r\n~ a no fail recipe that can be made even by a 10 year old. \r\n~ a rasam recipe without rasam powder and without lentils. \r\n\r\nRasam, more popularly known as charu, is an integral part of a traditional daily meal in telugu speaking homes. Rasam with rice is a comfort food that I grew up on and continues to be so even today. I am a rasam lover and prepare rasam fresh each day. If any extra rasam is left over, it is sipped as a soup during dinner time. Tamarind is star player that provides the necessary sourness. Each day, I tend to change the flavor profile of the rasam by tweaking the basic rasam recipe. I play around with ingredients like garlic, asafoetida, tomato, coriander leaves, black pepper corns, jaggery and end up making rasam that is different from the previous day and the one before that and so on. Just by adding or omitting a certain spice or herb, the rasam transforms into a unique flavored avatar. :)\r\n\r\nrasam served in a south indian thali\r\n\r\nQuite a few of my hindi speaking friends have requested me to share an authentic rasam recipe. If you ask me for a rasam recipe with specific measurements, it is not an easy task since I eyeball the ingredients. I will try my best to share  a tasty rasam recipe that works good each time I make it. The thinned down tamarind water is simmered along with turmeric, salt and jaggery that adds a touch of sweetenss and helps cut down the sourness of tamarind and curry leaves which lend an aromatic touch. The liquid is simmered till the rawness of tamarind disappears. I usually hand pound the spices like cumin seeds, pepper corns or garlic that are added to the almost done simmering rasam and finally finished off with a ghee tempering of mustard seeds, red chilis and asafoetida. The addition of asafoetida elevates the flavor profile of rasam by leaps and bounds. \r\n\r\nYou can add freshly crushed spices and herbs of your choice based on what is available in your pantry at Step 2 in the below mentioned rasam recipe.\r\n- crushed garlic (3-4 cloves) OR\r\n- crushed cumin seeds (1\/2 tsp) OR\r\n- crushed black pepper corns (7-8) OR\r\n- crushed cumin seeds (1\/2 tsp) and black pepper corns (1\/2 tsp)\r\n- crushed coriander seeds, cumin seeds and black pepper corns (1\/2 tsp each) OR\r\n- crushed garlic (2-3 cloves), cumin seeds (1\/2 tsp) and black pepper corns (1\/2 tsp) OR\r\n- crushed ginger (1\/2\") \r\n\r\nThe aroma of tangy, spicy, tasty rasam has be to experienced and cannot be described in words. It is best served with warm white rice, dal, pickle and papad. When you are feeling under the weather, rasam warms your soul and opens up your nasal passages and soothes a sore throat. In terms of health benefits, it aids digestion and prevents constipation. Rasam makes for a perfect party appetizer! Fragrant, warming and simply zen!\r\n\r\nsouth indian rasam\r\n\r\nRasam varieties\r\nRasam recipe with rasam powder \r\nAndhra charu with black pepper corns\r\nMysore Rasam \r\nUdupi Tomato Rasam \r\nPineapple Rasam \r\nMango Rasam\r\nNimmakaya Charu  (Lemon Rasam)\r\n\r\nFollow the instructions to learn how to make rasam that's easy, simple and tasty","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/how-to-make-rasam.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-rasam-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-rasam-300x300.jpg","style":["easy","quick","traditional"],"course":["soup"],"special-diet":["eggless","nut free","dairy free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"20","prep-time":"10","main-ingredient":["tamarind"],"serves":"5","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Soup Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["indian-food","rasam","soup","tamarind","vegan_recipe"]}