{"id":16345,"permalink":"http:\/\/www.sailusfood.com\/2015\/07\/30\/bhindi-masala-recipe\/","title":"Bhindi Masala Recipe","content":"bhindi masala, a restaurant style north indian okra dry dish that's easy, quick and healthy\r\n\r\nbhindi masala\r\n\r\nLadies finger or orka (bhindi) is a staple in Indian cuisine and a much loved vegetable in our home. I am maintaining an organic garden which is giving me good harvest of okra, eggplants, tomatoes, chilis, ridge gourd, ivy gourd, greens and more. You can see how green, vibrant and tender the home grown bhindi are from the image below. Last week, I made a popular restaurant style North Indian okra fry that makes for good side for chapathi, roti and rice. I have already blogged a Punjabi style bhindi masala recipe and today's bhindi dish is a slight variation without garlic. \r\n\r\nMy grandmother cooked okra to perfection with minimal ingredients where the flavor of bhindi would shine through be it a simple stir fry, stuffed bhindi dish or a yogurt based okra curry. My most favorite form of okra is in an easy dry saute made with less oil, minimal ingredients, fuss free, healthy and addictive. \r\n\r\nHome grown organic bhindi (okra)\r\n \r\nMany home cooks have issues while cooking bhindi because of the slimy texture it gives off on sauteeing. The key is to choose tender green okra and when you snap the pointed end, it should break off effortlessly. This bhindi masala requires less oil and not high in calories as we are not deep frying the okra. Roasting on low flame with a tablespoon of oil is good enough and it brings out the flavor as well as reduces the slime. Adding a tsp of lemon juice or yogurt also helps reduce slime. Also ensure that you wash the okra and pat dry with no trace of moisture before your chop them.\r\n\r\nokra masala\r\n\r\nThere are three components to this easy okra recipe that shouldn't be missed. Use of fresh, tender, vibrant bhindi, use of onions and tomatoes which add oodles of flavor along with the spices and roasting the bhindi well. Dry bhindi masala restaurant style is one of India's best known and most popular vegan food classic dish. One of the best bhindi masala that makes a great side for roti, naan as well as white rice.\r\n\r\nbhindi masala restaurant style\r\n\r\nPure vegetarian fare at its best!\r\n\r\nHow to make bhindi masala recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/how-to-make-bhindi-masala.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-bhindi-masala-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/how-to-make-bhindi-masala-300x300.jpg","style":["easy","quick","traditional"],"course":["main-course"],"special-diet":["eggless","nut free","dairy free","gluten free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"50","prep-time":"10","main-ingredient":["bhindi"],"serves":"5","goes-well-with":["rice","chapathi"],"author":null,"type":"post","categories":["All Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["bhindi","easy-vegetarian-recipes","indian_vegan_recipe","okra","okra-fry"]}