{"id":16371,"permalink":"http:\/\/www.sailusfood.com\/2015\/08\/03\/potato-fry-recipe-indian\/","title":"Potato fry recipe, easy, quick South Indian style","content":"Potato fry recipe, simple, easy to make, quick South Indian stir fry to go with rice and rasam\r\n\r\npotato fry\r\n\r\nThe humble potato holds an important place in my pantry. I usually never run out of potatoes in my kitchen and I ensure that I have at least a kilo of this root vegetable at any given time. Right from preparing a basic simple potato fry, aloo korma, curry, aloo paratha, french fries and more, potatoes are an integral part of my cooking. There are hundreds of variations to the basic potato fry and I am presenting to you a favorite potato fry recipe that I usually make to serve along side mudda pappu aka cooked tur dal, avakai, andhra vegetable stewpappu pulusu or rasam. \r\n\r\nsouth indian potato fry\r\n\r\nTo make the perfectly crisp potato fry that does not stick to the pan or become mushy, you need to follow certain steps. Dice the potato that are almost equal size cubes. Wash them thoroughly and soak in salted water for at least 15 mts before you stir fry. Soaking will aid in reducing the starch of the potatoes making them less sticky. You do not need much oil for attaining a crisp potato fry. All you require is a good seasoned iron kadai or a non stick pan, uniformly diced potatoes and soaking them in salted water for few minutes before frying them. \r\n\r\nCheck out more Indian style potato dishes that I have blogged earlier.\r\n\r\nHow to make potato fry recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/07\/potato-fry-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/potato-fry-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/potato-fry-recipe-300x300.jpg","style":["easy","quick"],"course":["side"],"special-diet":["eggless","nut free","dairy free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"30","prep-time":"10","main-ingredient":["potato"],"serves":"5","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"],"tags":["easy-vegetarian-recipes","potato","potato fry","potato-roast","stir-fry","vegan_recipe"]}