{"id":16393,"permalink":"http:\/\/www.sailusfood.com\/2015\/08\/12\/tomato-pickle-recipe-andhra\/","title":"Andhra tomato pickle recipe, instant & easy","content":"Tomato pickle recipe, a simple, instant, tasty and best tomato pachadi Andhra style preparation\r\n\r\ntomat pickle\r\n\r\nIn many Telugu speaking homes you will find that most culinary conversations center around pickle making, chutney recipes and more. I have numerous hand written recipes that I have gotten off such conversations. I am sharing one such gem that is an addictively tasty, fresh tomato pickle. An easy tomato pickle prepared in Andhra style that is \"not a long lasting\" pickle. Yes, it has a very short shelf life i.e two days at room temperature but can be refrigerated for a week. Whenever I make this pachadi, it does not last us more than 4 or 5 days. And I regularly make it when I have guests come over for a meal. It is so so good. \r\n\r\nMy organic garden is giving me a good yield of heirloom tomatoes which I put to good use by making a batch of tomato pachadi. This easy andhra pickle tastes best when made with a mix of heirloom and hybrid tomatoes which has a balance of sweet and sour flavors. Very minimal ingredients and there is no grinding involved as its more of a saucy, chunky tomato chutney. An andhra tomato pickle recipe that couldn't get any simpler. :) You will find a hint of asafoetida and is moderately spiced with a mix of dry red chilis and red chili powder. It is made without tamarind and without garlic but if you like garlic flavor, omit asafoetida and throw in a couple of crushed garlic cloves in the tempering.  \r\n\r\nbest tomato pickle\r\n\r\nI love the simplicity of this instant tomato relish and the versatality of its uses. It can be served with tiffins like idli, dosa, pongal, rice and roti. It is delicious as a dip or a salsa with chips. A vibrant orange red homemade tomato pachadi with sweet, tangy, spicy flavors and a gem among veg andhra pickles. \r\n\r\nI have already blogged a long lasting sun dried tomato pickle without garlic and another andhra tomato pickle with garlic which are hot favorites. You can also find more pickle recipes on my blog mostly Andhra and South Indian style.\r\n\r\ntomato pickle andhra style\r\n\r\nLearn how to make tomato pickle or andhra tomato pachadi","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/08\/andhra-tomato-pickle.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/andhra-tomato-pickle-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/andhra-tomato-pickle-300x300.jpg","style":["easy"],"course":["chutney"],"special-diet":["eggless","nut free","dairy free","gluten free","vegan","vegetarian","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"90","prep-time":"15","main-ingredient":["tomato"],"serves":"25","goes-well-with":["rice","idli","dosa"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["easy-vegetarian-recipes","indian_vegan_recipe","pachadi","pickle","tomato","tomato-chutney"]}