{"id":16503,"permalink":"http:\/\/www.sailusfood.com\/2015\/11\/30\/bedmi-puri-recipe\/","title":"Bedmi puri recipe","content":"Bedmi Puri recipe, a popular Indian street food, wheat flour based bread stuffed with spiced lentils and served with a spicy potato curry\r\n\r\nbedmi puri aloo sabzi - north indian street food\r\n\r\nConnoisseurs of pure vegetarian North Indian food are sure to love today's traditional breakfast recipe - bedmi puri also popularly known as bedmi aloo, bedmi kachori, urad dal kachori, bedvi, bedami or bedmi puri aloo sabzi. In the North Indian hindi speaking states of Delhi, Haryana, Madhya Pradesh, Uttar Pradesh as well as in Rajasthan, bedmi aloo is a popular street food usually served as a breakfast or an early brunch. As a street food fare, Dilli style, this urad dal stuffed crispy puri is served with a spicy aloo sabzi aka potato curry and a sweet and spicy mashed pumpkin sabzi. Perfectly balanced flavors that are addictive. It is a satwik dish, in other words, a no onion no garlic recipe and is vegan as well. Of course, it is calorie rich and makes for an indulgent breakfast on a festive day or special occasion. \r\n\r\nEach home cook has his or her own take on making bedmi puri recipe based on the region they belong. The thickness and size of the bedmi puri differs according to the region it is prepared. Smaller, thicker shaped puris are more popular as kachori. \r\n\r\nThere are two methods that one can follow to make bedmi poori. One method followed by many home cooks is to direcly add the ground raw urad dal paste along with spices to the whole wheat flour and semolina to make a slightly stiff dough. Small balls are pinched off the dough to be rolled into thick flattened puris and deep fried till crisp and golden brown. \r\n\r\nMETHOD - 1\r\nmaking of bedmi puri by mixing urad dal paste with whole wheat flour\r\n\r\n\r\n\r\nThe second method to make bedmi kachori is by stuffing cooked dhuli urad dal mixture in the dough and rolling out into circles before deep frying. Basically dhuli urad dal (black gram dal) is soaked in water for 2-3 hours, drained and ground to a coarse paste. This paste is mixed with a mixture of spices, green chilis, ginger and coriander leaves and sauteed in oil till rawness disappears and appears like a crumbly mixture. This mixture is stuffed in whole wheat flour-semolina dough before being rolled out into slightly thick circles. The flattened puri is deep fried in oil till it puffs, turn golden brown and crisp. This method is more labour intensive compared to the former method where the uncooked urad dal mix is directly mixed with wheat flour to make a dough. \r\n\r\nMETHOD 2\r\nmaking of bedmi puri by stuffing cooked urad dal mixture\r\n\r\n\r\n\r\nbedmi puri\r\n\r\nbedmi puri with aloo sabzi\r\n\r\nInterestingly, I have combined 'method-1 and method-2' by sauteeing the ural dal paste and mixing it along with the whole wheat flour, semolina and making it into a stiff dough. This method yields a very flavorful and crisp puri. Unlike the normal puris, bedmi puri holds shape and is crisp. Of course, this particular recipe of bedmi puri is time taking but worth the effort while making breakfast or brunch on festive days like Holi or Diwali. :) Perfect comforting food to satiate your taste buds.\r\n\r\nThe aloo sabzi that is served with the bedvis has a runny texture with a spicy flavor and is a no onion no garlic recipe. I will post the bedmi puri aloo sabzi recipe in a day or two.\r\n\r\nLearn how to make bedmi poori or bedmi aloo","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2015\/09\/bedmi-puri-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bedmi-puri-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bedmi-puri-recipe-300x300.jpg","style":["easy","traditional"],"course":["breakfast"],"special-diet":["eggless","nut free","dairy free","gluten","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"30","prep-time":"60","main-ingredient":["wheat flour","urad dal"],"serves":"5","goes-well-with":["potato curry"],"author":null,"type":"post","categories":["All Recipes","Festival Foods","Flour Recipes","Indian Breakfast Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["breakfast","easy-vegetarian-recipes","puri","urad dal","vegetarian"]}