{"id":1683,"permalink":"http:\/\/www.sailusfood.com\/2009\/02\/03\/arati-davva-ava-kura-mustard-flavored-plantain-stem-stir-fry\/","title":"Arati Davva Ava Kura - Mustard-flavored Plantain Stem Stir Fry","content":"Banana Stem, Arati Davva, Vazai Thandu\r\n\r\nA praise worthy Andhra delicacy is Arati Davva (Doota) aka tender plantain stem. Removing the outer layers of the stem to reach the nutritious core is a labor intensive process but worth every bit of effort. The edible core of plaintain stem is used to prepare stir fries, dals, kootu, juice and even salad. One important step to follow during the chopping of the edible stem is to place the arati davva pieces in diluted buttermilk to avoid discoloration.\r\n\r\nArati Davva Kura\r\n\r\nAt our home, davva is usually cooked as a stir fry that is seasoned with spices, ginger, curry leaves and flavored with tamarind and mustard powder. The mustard brightens the crunchy plantain stem pieces with a unique flavor and heady aroma. \r\n\r\nArati Davva Aava Kura Recipe\r\nPrep & Cooking: 40 mts\r\nServes: 3-4 \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups chopped tender plantain stem\/arati davva (soaked in diluted butter milk)\r\n\r\nbig pinch turmeric pwd\r\n\r\n1 green chillis, slit\r\n\r\n1 tsp finely chopped ginger\r\n\r\n2 tbsps tamarind paste\r\n\r\n1 tbsp oil\r\n\r\nsalt to taste\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\npinch of cumin seeds\r\n\r\n1 tsp split black gram dal\/minappa pappu\r\n\r\n1 tsp channa dal\/senaga pappu\r\n\r\n1-2 dry red chillis, tear and de-seed\r\n\r\n10-12 curry leaves\r\n\r\npinch of asafoetida\/hing\r\n\r\n1\/2 tsp mustard pwd\r\n\r\n\r\n\r\n1 Cook the arati davva along with turmeric and salt in the diluted buttermilk till soft but not mushy. Drain any left over water.\r\n2 Heat oil in a vessel, add the mustard seeds and let them pop. Add the cumin seeds, gram dal, channa dal and let it turn golden brown, then add the curry leaves, green chillis, dry red chillis, ginger and asafoetida.\r\n3 Immediately, add the cooked arati davva pieces and combine. Adjust salt, add tamarind paste and combine. Cook on low to medium flame for about 10 mts, till the rawness of tamarind disappears. The arati davva should retain a bit of crunch.\r\n4 Turn off heat. Add the mustard pwd and combine. \r\n5 Serve with hot rice. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/02\/arati-davva-ava-kura.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/arati-davva-ava-kura-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/arati-davva-ava-kura-300x300.jpg","main-ingredient":["raw plantain"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegetarian Recipes"],"tags":["arati-davva","banana-stem"]}