{"id":1841,"permalink":"http:\/\/www.sailusfood.com\/2009\/01\/31\/punukkulu-peanut-coriander-chutney\/","title":"Punukkulu & Peanut-Coriander Chutney","content":"Have leftover idli or dosa batter sitting in your refrigerator? Need something quick and easy to prepare with it? Just add chopped onion, green chillis, coriander leaves, cumin seeds to the batter and prepare fritters aka Punukulu. \r\n\r\nPunukulu\/Punugulu \r\n\r\nPunukulu are a deep fried snack, a part of Andhra street food culture, served with an assortment of chutneys. There are number of variations to punukulu aka punugulu recipe. What ever the method and ingredients used, punukulu have a tangy chewy interior and a beautiful golden crisp exterior. Inspite of Punukulu being a deep-fried treat, you cannot but feel affection for it and is an example of the simple pleasures of Andhra street food. Its a comfort oriented, addictively delicious, cold-weather favorite that is hard to resist!\r\n\r\nThis morning, it was Punukulu with peanut coriander chutney. But, I did not use any left over batter to prepare punukulu. I prepared Punukulu batter from scratch. \r\n\r\nPunukulu Recipe\r\nPrep: 20 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n4 cups raw rice, soak in water overnight, drain for an hour, make a fine powder\r\n\r\n1 cup urad dal\/minappa pappu\/black gram dal, soak for 4-5 hrs\r\n\r\noil for deep frying\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Grind the soaked dal to a fine paste. Add the ground rice pwd to the batter and make a smooth batter. Ferment the batter for 6-7 hrs.\r\n2 Heat oil for deep frying in a heavy bottomed vessel. Once it reaching piping hot stage, reduce flame to medium and drop a tbsp of batter into the hot oil. Prepare a batch of 10-12 punukulu based on the size of the vessel.\r\n3 Deep fry to a golden brown shade and remove onto absorbent paper. Serve hot with chutney and finely chopped onions by the side.\r\n\r\n Note: You can add cumin seeds, chopped onions and green chillis to the batter before deep frying. If using left over dosa\/idli batter, add 1-2 tbsps of semolina, chopped onions, cumin, green chillis and coriander leaves to the batter and prepare punukulu.\r\n\r\nPeanut Coriander Chutney\r\n\r\nPeanut Coriander Chutney Recipe\r\nPreparation: 15 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups packed fresh coriander leaves\r\n\r\n3\/4 cup roasted peanuts\r\n\r\n3-4 green chillies (increase or decrease to suit your spice level)\r\n\r\nsmall gooseberry sized tamarind (soak in 2 tbsps warm water)\r\n\r\n1 tsp jaggery or sugar\r\n\r\n2 tsps oil\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Heat oil in a pan, add the green chillis and coriander leaves and fry till for 2-3 mts. Remove and cool.\r\n4 Grind the peanuts, green chillis, coriander leaves, tamarind, jaggery and salt. Add a few tbsps water and make a fine paste. Serve with hot punukulu, pesarattu, dosas or idlis.\r\n\r\nMy entry to \"My Legume Love Affair - Seventh Helping\", food event started by Susan of The Well-Seasoned Cook and hosted this month by Srivalli of Cooking 4 All Seasons.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/01\/punukulu1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/punukulu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/punukulu1-300x300.jpg","main-ingredient":["coriander leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes"],"tags":["chutney","coriander","punukulu"]}