{"id":1917,"permalink":"http:\/\/www.sailusfood.com\/2009\/09\/21\/daawat-e-hyderabad-guest-post-by-mona\/","title":"Daawat-E-Hyderabad ~ Guest post by Mona","content":"Food blogger, Mona of Zaiqa fame needs no introduction. Her blog is home to authentic Hyderabadi home cooked meals and recipes that she creates with effortless ease. To savor authentic Ramzan recipes do visit 'The Hyderabadi Ramadan Food Festival' round up at Mona's blog. She has very kind to share an elaborate article on the food culture of the people of Hyderabad for 'The Indian Food Trail' series. \r\n\r\nThank you, dear Mona, for taking the time to share the culinary heritage of the Hyderabadis. Dear readers and food blogger friends, please welcome Mona who prepared three delicious delicacies for us!\r\n\r\nEid Mubarak to all my dear Muslim readers and food bloggers!\r\n\r\n~ Sailaja\r\n\r\nThe Cuisine of Hyderabad\r\n\r\nHyderabad! Just mentioning its name makes me nostalgic and fills my heart with a guilt of not taking advantage of those old and beautiful days to their fullest then, and a yearning wish to go back and live those maudlinly pristine years again. Today that I am very far away from Hyderabad and settled in pardes\/foreign country to join by husband, I miss and feel the deficit of everything Hyderabad has, the mehendis, the beautiful zardosi work on garments to the very frequent daawats and gatherings showcasing an assortment of appealingly flavorsome dishes to seduce a foodie.  Hyderabad, the capital of Andhra Pradesh, was founded in the year 1591 by Mohammed Quli Qutub Shah, who was the fifth sultan of Qutb Shahi dynasty. The excuisite Kohinoor diamond that adorns that crown of the queen of England was founded in Hyderabad from the Golconda diamond mines (which unfortunately today is abandoned). \r\n\r\nI did not spend my entire childhood in Hyderabad. It was during those yearly visits during my childhood to my Nani's place who still lives in Hyderabad, which were the early stepping stones for my discovery for this rapidly developing city. Later when I moved to Hyderabad, I came to sense the majesty of the place which pulled me into a strong, deep and incorruptible adulation for its own unique ambience. Hyderabad, a place largely populated by the Muslims, boasts about its very own and unique cuisine among its other specialties which is known for. A Persian Ambassador once said, \"The food is a dream of deliciousness\", when he had come to the Qutub Shahi Kingdom in 1603. Hyderabad is known for its leisurely sense of time, its own distinctive cuisine and style of dress, gracious ways and its own version on Urdu. \r\n\r\nFood, by Hyderabadi Muslims is traditionally eaten sitting on the floor cross-legged around the 'Dastarkhaan'. A dastarkhaan is a large piece of cloth spread on the floor which functions as the dining table. People are careful not to step on it or go over it, instead they are asked go around it to reach the other side. \r\n\r\n Picture of the Dastarkhaan, where people sit and dine together sitting crosslegged on the floor around the rectangular Dastarkhaan\r\n\r\nIndians generally eat their food with their right hands instead of using spoon and forks. The left hand is considered unclean and its use while eating, or even to hold glass while drinking is regarded inappropriate in Islam. The food of Hyderabad has a slight deccani flavor. Hyderabadi Muslim Cuisine is very different from the other parts of Hyderabad. The major ingredients used in the pakwaan or cookery are onions and yoghurt, and a wide assortment of spices or masalas. Some of the renowned Hyderabadi dishes are Haleem, Pathar Ka Gosht, Mahekhalya, Kacchi imli ka Dalcha, Till Ki Chutney, Maleeda, Gulgule, Qubuli, Kacchi Biryani, Double Ka meetha, Baghare Baingan, Nihari, Pakki Biryani, Mirchi Ka Salan, Khichdi, Qageena, Kulfe ki katli, Ambaday aur chanay ki Dal, Til wali Gavar ki phalli, Kacche Kofte, Chugar Gosht, Shikampur-Shaami Kawab, Do Pyaza, Luqmi-Kawab, Dum ka Qaeema, Shirmaal, Kheer, Gaajar ka Halwa, Pasinde ka Salan, Bhendi Ka Khatta, Boti ka Salan, Marag, Aloo Methi Gosht, Besan Ka Salan, Dil Khush, Kulcha, Khatti Dal, Qubani Ka Meetha, Rowghani Roti, Mithi Dal, Mash Ki dal, Sheer Qurma, Tamate Ka Kut etc. Most of these dishes are recognized by people all around the world, and hence Hyderabadi cuisine has today made a prominent mark internationally. Hyderabadi cuisine is a gastronomical treat people will not very easily forget. \r\n\r\nPeople in Hyderabad are very fond of eating. There are restaurants and small road side food stalls at regular intervals all around. Shehran, Grand hotel, Niagara, Paradise, Shadab, Ohri's, Kolhani, Kamat, Taj Mahal, Swathi tiffins etc are a handful of the established eateries famous and booming with hungry foodies. The delicious hand churned ice cream from Famous Ice cream Parlour at Mozamjahi Market and buttery sweets from G.Pulla Reddy Pure Ghee Sweets are those that I am very fond of. \r\n\r\nTraditional, elaborate Hyderabadi weddings which are conducted at a very grand scale are the best places for a quick glimpse into Hyderabadi Cuisine. Elaborate feasts after the Nikah or after signing the nuptial vows, are a treat to the eyes and nirvana for the food lovers. Let me now welcome you to a virtual tour to home-style Hyderabadi cooking plan that I normally would use. I present you with two options, a plan1 and a plan2, which will give you an insight into a party meal plan and a daily routine based plan. \r\n\r\n   Plan 1 - For a party   Plan 2 - Routine   Breakfast:   Breakfast:   Khichdi-Khatta along with Qaeema or Qageena and either Till wali chutney (Sesame seed chutney) or Hara dhaniya aur Pudina wali chutney (Cilantro and mint chutney)   Paratha along with Pyaz ka anda (recipe below)   Lunch:   Lunch:   Main course: Murgh Qorma along with Naan                            Meetha: Kaddu ki Kheer   Main Course: Qubuli (recipe below) and Tamate ki Chutney                           Meetha: Aloo ki Kheer   Dinner:   Dinner:   Main Course: Kachchi Aqni ki Dum Murgh Biryani along with Baghare Baingan                             Meetha: Gajar ka Halwa (recipe below)   Main Course: Khushka along with Khadi dal and Mahekhalya                              Meetha: Meetha Pan   \r\n\r\nPyaz Ka Anda You can also call this 'Omlette with herbs and diced Onion'. We Hyderabadis enjoy this omlette with Parathas or Khichdi for a delicious weekend breakfast.  Ingredients:  Eggs - 1, large Red onion or Yellow onion - 1\/3 cup, finely chopped Salt - 2 pinch Red chilli powder - 1\/3 tsp Ginger garlic paste - 1\/2 tsp Cilantro - 2 tsp Green chillies - 1 tsp Canola oil - 2 tbsp  \r\n\r\nMethod:  Pour oil into a non-stick frying pan at medium high heat. Break an egg into a small mixing bowl. Add the chopped onion, salt, red chilli powder, ginger-garlic paste, cilantro and green chillies. Whisk it together for about 2 minutes. Lower the heat of the pan to medium and pour the egg mixture into the pan. Cover with a lid for half a minute. Once done on one side, flip it to let it cook on the other side too. Serve the omlette warm along with Parathas.  \r\n\r\nQubuli Qubuli is mostly enjoyed as the dinner for Fridays after the Jumah Salah. It is a one-dish meal consisting of rice and lentils. Vegetarians enjoy it as a light lentil Biryani. Ingredients:  Rice - 2 1\/2 cups Caraway seeds\/Shahzeera - 1 tsp Split Bengal gram\/Chana Dal - 1 cup Red Chilli powder - 2 tsp Turmeric -  1\/4 tsp Yellow Onions - 3, large, very finely sliced Ginger garlic paste - 2 tbsp Yoghurt - 1 cup, stirred Fresh Mint leaves and Cilantro - to garnish Small Green chillies - 8, small, finely chopped Salt - to taste Lemon juice - 5 tbsp Garam masala - 1 tsp Canola oil   Method:  Wash the dal and soak it for about 30 minutes. Later, drain the dal and add 2 cups of fresh cool water to it. Add turmeric and boil the dal until just tender (be very careful so that the dal is not very soft or mushy) and there should be no water left. You can add more water as needed for the cooking process. Keep the dal aside. Deep fry the onions in oil until crisp and evenly golden brown in color. Remove the browned onions with a slotted spoon on a paper towel. Reserve the oil. In a seperate frying pan at medium heat, add 3 tbsp of the reserved oil and as it warms up, throw in ginger garlic paste and stir fry until lighty golden in color and a beautiful aroma fills the kitchen. Add half of the yoghurt and continously stir it for about a minute. Immediately, add the remaining half of the yoghurt and cook again stirring continously for about 2 minutes. Throw in the cooked dal, red chilli powder and salt. Let it cook for more 5 minutes. Close the lid and remove from heat. Preheat the oven to 350 C. Wash the rice and soak in surplus fresh cool water for about half an hour. Drain the soaking rice, and put in a large saucepan. Add surplus amount of cool water to it. Throw in about 2 1\/2 tsp of salt and shahzeera. Cook the rice in the water until half done. Drain and keep aside. Quickly, in a large oven proof casserole dish, evenly arrange half of the drained rice in a single layer. Now again evenly arrange all of the cooked dal as the second layer in the dish. Arrange the remaining half of the rice evenly as the final top layer. Garnish with fried onion, lemon juice, cilantro, mint leaves, green chillies, garam masala and 2 tbsp of the reserved oil in which the onions were fried. Cover the dish with a tight lid on aluminium foil and keep it in the pre-healted oven for about 15 minutes. Just before you plan to serve your Qubuli, dig a large spoon deep into the dish and mix the whole completely. Serve warm immediately.  Suggested Accompaniments: Serve it warm along with Tamate ki Chutney. \r\n\r\nGajar Ka Halwa Gajar ka Halwa needs no introduction. This carrot dessert is India's pride and one among every bharatiya's most preferred desserts. Enjoy this meetha, Hyderabadi style. Ingredients:  Indian Maroon Carrots -700 gms (or, you can also use baby carrots, or any sweet carrots available instead) Khoa - 75 gms Ghee - 3 tbsps Sugar - 1\/2 cup or according to taste Milk - 60 ml Red raisins - 1 tbsp Pistachios - 1 tsp, slivered Almonds - 1 tsp, slivered   Method:  Wash and peel the carrots. In a food processor, grate them and keep aside. Heat a non-stick saucepan at medium high and add the grated carrots. Keep stirring them gently until the carrot's own juices are all dried up and the carrots are a little soft in texture.  Add ghee and keep cooking it stirring continously until you observe a change in colour. The colour of the carrots gets a little darker orange in colour. This step is called as 'Bhunna', or dry roasting. Add milk, and khoa and sugar. Let it cook uncovered while stirring it gently until the meetha is mostly dry. Make sure you do not make the meetha mushy. Add raisins and let cook for a furthur 5 minutes. Remove from heat. Garnish with pistachios and almonds before you serve the meetha.  I discovered my love and attachment for Hyderabadi cuisine only after I had to leave my parents house and missed and craved for some delicious home made Hyderabadi food. And this also drove me to jot down all my recipes that I have learnt on my culinary blog as a journal, so that women like me, who suddenly after their marriage are left wondering about the procedures of those routine home-style Hyderabadi dishes (forget about the more elaborative festive dishes) that remind us of our mother's delicious hand made food.  I encourage my Hyderabadi friends to record their versions of daily based to celebratory dishes in various ways as possible. Hyderabadi Muslim Cuisine is undoubtebly one of the most delectably unique cuisine recognised and loved by poeple all over the world. Let us not let the majestic cuisine get lost away in the shades. \r\n\r\nI thank you Sailaja for the oppurtunity to write about the cuisine of the place from where my roots are. It was a pleasure. Hope your readers enjoy my article. Wishing Eid Mubarak to each and everyone of you!\r\n\r\nHappy feasting everyone! \r\n\r\n\r\nArticle, recipes and images - Mona\r\n\r\nEarlier on Indian Food Trail series\r\n Maharastra \r\nA Simple Summer Meal by Nupur of One Hot Stove\r\nTraditional Maharashtrian Thalis - Veg & Non-Veg by Meera of Enjoy Indian Food\r\nTraditional Maharastrian Sweet & Snacks by Meera of Enjoy Indian Food\r\nKonkan Region - North Canara\r\nAn Essay on Konkani Cuisine  by Shilpa of Aayis Recipes\r\nKerala \r\nMunchies from a Kerala home - Shn of Mishmash\r\nA traditional Malabar meal ~ Shaheen of Malabar Spice\r\nUdupi-Mangalore\r\nExploring Udupi Mangalorean Street Foods  by Sia of Monsoon Spice\r\nTamil Nadu\r\nTraditional Tamil Tiffins - Lakshmi of Veggie Cuisine\r\nBengal\r\nBengali Cuisine ~ Sandeepa of Bong Mom's Cook Book","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/09\/pyaz-ka-anda.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pyaz-ka-anda-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pyaz-ka-anda-300x300.jpg","main-ingredient":["eggs"],"author":null,"type":"post","categories":["All Recipes","Guest Blogger","Hyderabadi Recipes"],"tags":["Hyderabadi Recipes"]}