{"id":1923,"permalink":"http:\/\/www.sailusfood.com\/2009\/06\/29\/a-traditional-malabar-meal-guest-post-by-shaheen\/","title":"A traditional Malabar meal ~ Guest post by Shaheen","content":"Shaheen of Malabar Spices  shares with us a traditional Malabar meal that includes a delicious fish curry. Want to explore the rich traditional Malabar Muslim cuisine? Head over to Shaheen's food space and you are in for a delectable treat.\r\n\r\nFriends, please welcome Shaheen. :)\r\n~Sailaja\r\n\r\nWhen I was first asked to write a guest post on a traditional meal from Malabar Cuisine, I was excited and immediately the words and the memories tripped over one another in a hurry to get out of my mind. Ah.. I started salivating thinking of Calicut...the Arabian sea front...and the food..yes, its something to write about.. the endless array of items for breakfast, the fish meals for lunch, the layered chappathis called madikki pathiri- beef curry for dinner, the biryanis, the ghee rice .... But when I started to write to introduce a newbie to this diverse cuisine, I faltered and didn't know where to start. \r\n\r\nMalabar was influenced by Arab traders, French rulers and the native Zamorins and Namboodiris. So there are Muslims, Christians and Hindus there each contributing to the wonderful diversity of the food in their own unique way. If I started analyzing each recipe, I can find the roots to be from each of the cultures above. Just like the rest of Kerala, there is a lot of intermingling in the recipes and yet there are unique dishes too. So how do you introduce a cuisine? Is it by the unequivocal Malabar Porotta which is now a common enough term to be available in the freezer section of your local Indian grocer or by the Biryani that Malabar is famous for or it by the myriad fish cuisine? \r\n\r\nThen I thought maybe giving you a glimpse of the lunch that most are not privy to will endear you to a complicated cuisine....lunch across South India is similar and in this lunch you will find similarities and differences with your own cuisine and and that would make it more personal and accessible.\r\n\r\nA traditional lunch is what is served traditionally, I assume. My family are Malabar Muslims, known for their elaborate eating habits, an all welcoming nature and generous wedding festivities. But if you go into any of our households for lunch you would be surprised. The fish curry lunch meal is light and very healthy with a good balance of vegetables, carbs and protein.\r\n\r\nThe fish curry meal is the most unglamorous of all the luscious meals there, given that the Vegetarian Sadya gets top billing in publicity outside of Kerala. But go to any restaurant throughout Kerala, and you will get scrumptious options in fish curry meals...rice or chapathi or appams with fish curry with coconut, without coconut, with roasted coconut gravy, with coconut milk, just fried, fried and in a coconut milk gravy, in a thick spicy gravy.\r\n\r\nHome style Malabar meal\r\n\r\nThe rice eaten at home is usually parboiled or rosematta rice or Palakkadan matta rice or Kerala red rice. It is rich in fibre and nutrients. Rose Matta Rice is the rice with the outer bran removed. The grains are yellowish pink from being parboiled with the reddish out layers. Rose Matta Rice maintains a pink hue as well as its flavor on cooking. Accompanying the rice is the vegetable thoran or a vegetable mezhukkuparatti, (both are colloquially called \"upperi\" in our houses)... sometimes both are present... a fish curry (Mulaku chaar\/red spicy fish curry, or Thenga aracha meen chaar\/Yellow fish curry with coconut), fish fry, yogurt, papadum and if that's not enough maybe pickles. If no fish curry is there, then the focus shifts to Pulissery\/Yogurt curry with white pumpkin, Parippu\/ Lentil curry, Sambhar, or a multitude of vegetable based curries. \r\n\r\n\r\n\r\n\r\nThe fish curry with coconut that is shown above is a simple preparation that is made fresh everyday with the fish of the day. It goes well with rice and chapathi too. The ingredients are mixed together in the pot, crushed by hand, no oil, and then set on the flame. When it is bubbling away, the fish is added to it and when the fish is cooked, a fresh ground paste of coconut is added to it. Seasoning is just curry leaves and shallots. That's it. This is in direct contrast with the other fish curries which need slow frying of shallots or roasting the coconut etc.  \r\n\r\n This coconut based curry is best with the middle pieces of the fish.. the most meaty ones. The head and tail are more suited to the rustic molaku chaar\/ red spicy fish curry. Once only head and tails were bought from the fishmonger for a much enjoyed Molaku chaar!!! And everything is suited for fry but mostly the meaty pieces are reserved for it. Sometimes the fry is shrimp or mussels...yum!!. \r\n \r\nThe vegetable side dishes run the gamut of the Kerala cuisine but the preferred ones are Cabbage thoran, Cheera thoran, String beans, Pumpkin...actually any vegetable goes. Making the combination is the tricky part of the meal. It's best to have a light vegetable with a heavy curry or vice versa to balance the sweet with the spicy and the fried with the steamed so that the end result is not too leaden.\r\n\r\nHere, the rice lunch has been sacrificed to the American way of sandwiches and pasta and grab meals so its only on weeknights and weekends that this meal gets its turn. The meal shown above is a simple replication of the meals at home, since it has only one curry and one vegetable. But you could make the meal as light or as heavy as you like.\r\n \r\nFish Curry: Since I didn't want to use up too much of the space here, here's the fish curry recipe.\r\n\r\n\r\n\r\nCabbage Thoran:\r\nserves 4\r\nYou Will Need:\r\nFinely sliced cabbage - 1\/2..3 to 4 cups shredded.\r\nOnion- half of a small one, sliced finely.(optional)\r\nTiny Green chillies - 4\r\nGrated coconut - 1\/2 cup\r\nTurmeric powder - 1\/8 tsp\r\nCumin powder - 1\/8 tsp\r\nMustard seeds - 1\/2 tsp\r\nCurry leaves - a sprig\r\nUrad dal( optional)\r\nSalt - to taste\r\nOil - 1 1\/2 tablespoon (could do with less)\r\n\r\nMethod:-\r\nMix the grated coconut and cumin powder together. Alternately you could pulse the chilies and cumin seeds and shredded coconut to a coarse mixture without adding any water.\r\nHeat oil in a pan and allow mustard seeds to splutter. Reduce heat and add in the lentils and curry leaves. Then add the sliced onion and green chilies and saute for a minute. Now reduce heat and add the turmeric and cabbage into the pan and mix well. Make a well in the middle of the cabbage and add the coconut mixture and cover it with the cabbage. Maintain medium heat, add 1 tsp water, (again optional because too much of water will always spoil the dish. So be careful with the water) and cover the pan. Let it cook for about 5 minutes and then give it a stir. Check to see if it is cooked. It's done when there is still a bite left to it..kind of like al dente.:) Be careful with the heat setting. Too high, it will get burnt.. too low, it will leave too much moisture. If there is excess moisture, stir on high heat for a minute. When it is almost done, take it off the flame and leave covered for 5 minutes.\r\n\r\nSome cabbages don't need even the 1 tsp of water as the condensation from the lid will keep it moist.  Some cabbages are thicker and may need another 3-4 minutes time to cook.\r\n\r\nPrawn\/Shrimp Fry: \r\nserves 4\r\nShelled and de-veined prawns:2 cup\r\nRed chili powder-1 1\/2 tsp (mix with Kashmiri chili if you want to reduce spice)\r\nTurmeric-3\/4 tsp\r\nsalt -about 1\/2 tsp or to taste\r\nCurry leaves- a sprig\r\n\r\nMix the spices with the prawns\/shrimps and marinate for a while... the more time the better. Heat about 1\/2 cup oil in a cast iron skillet and deep fry on medium heat till golden brown. If you fry too long, they become dry and crunchy. If you are making this with the big shrimps, then add only a little bit oil initially and once the shrimps changes color to opaque and shed the water, add more oil and the curry leaves.\r\n\r\nMy heartfelt thanks to Sailaja for inviting as well encouraging me to write this article and introduce you all to this simple meal at my place. Sailaja, I hope your readers enjoy this meal and readers, please let me know if you have any doubts. How about making your next meal a Kerala Meal?\r\n\r\nArticle, recipes and images - Shaheen\r\n\r\nEarlier on Indian Food Trail series\r\n Maharastra \r\nA Simple Summer Meal by Nupur of One Hot Stove\r\nTraditional Maharashtrian Thalis - Veg & Non-Veg by Meera of Enjoy Indian Food\r\nTraditional Maharastrian Sweet & Snacks by Meera of Enjoy Indian Food\r\nKonkan Region - North Canara\r\nAn Essay on Konkani Cuisine  by Shilpa of Aayis Recipes\r\nKerala \r\nMunchies from a Kerala home - Shn of Mishmash\r\nUdupi-Mangalore\r\nExploring Udupi Mangalorean Street Foods  by Sia of Monsoon Spice\r\nTamil Nadu\r\nTraditional Tamil Tiffins - Lakshmi of Veggie Cuisine\r\nBengal\r\nBengali Cuisine ~ Sandeepa of Bong Mom's Cook Book","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/06\/rice-fish-curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rice-fish-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rice-fish-curry-300x300.jpg","main-ingredient":["fish"],"author":null,"type":"post","categories":["All Recipes","Guest Blogger","Malabar Recipes"],"tags":["cabbage","fish"]}