{"id":2003,"permalink":"http:\/\/www.sailusfood.com\/2009\/02\/12\/fennel-flavored-egg-curry\/","title":"Fennel-flavored Egg Curry","content":"I just got word that my blog, Sailu's Kitchen, has made it to the top 10 food blogs for the home cook by Times Online. I'm both honored and humbled. Do check out the other wonderful food blogs for the home cook mentioned in the article and top 10 food blogs from around the world. \r\n\r\nFennel flavored Egg Curry\r\n\r\nMy recipe files contain close to a few hundred egg curry recipes. Our family is fond of eggs and are an integral part of our daily meals especially breakfast. Whenever I venture out to make an egg curry, I try to prepare a recipe that I haven't made earlier. One of our favorite is a fennel (saunf) flavored egg curry that goes great with rotis. The addition of coconut, tomatoes and garam masala lend the curry body and a myriad of flavors.\r\n\r\nFennel flavored Egg Curry Recipe\r\nPrep & Cooking: 40 mts\r\nServes 4 persons\r\n.\r\n\r\nIngredients:\r\n\r\n4 boiled eggs, cut into halves\r\n\r\n2 onions, chopped\r\n\r\n1 green chilli\r\n\r\n2 tomatoes, chopped \r\n\r\n4-5 tbsps fresh coconut\r\n\r\n3\/4th tsp fennel seeds\/saunf pwd\r\n\r\n1 tsp coriander pwd\r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/4 tsp garam masala pwd (2 cloves, 1\" cinnamon, 1 elaichi)\r\n\r\ncoriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n2 tbsps oil\r\n\r\n\r\n\r\n1 Heat half a tbsp of oil in a heavy bottomed vessel, add half of the onions and green chilli and saute till transparent. Add a few tbsps of chopped tomatoes and saute further for another 4 mts. Remove from heat, cool and grind to a paste along with grated coconut.\r\n2 In the same vessel add the remaining oil, add the remaining chopped onions and saute till transparent. Add saunf pwd, coriander pwd and salt and combine. Add the ground masala paste and cook for 4-5 mts. Add the remaining chopped tomatoes and cook for 3-4 mts. Add a little less than a cup of water and bring to boil.\r\n4 Add the boiled egg halves and let it cook in this masala for 5-6 mts on medium flame. Reduce flame and cook till you get the desired curry consistency.  \r\n5 Add garam masala pwd and coriander leaves. Turn off heat and serve hot with rotis or white rice.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/02\/egg-curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-curry-300x300.jpg","main-ingredient":["eggs"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Egg Recipes"],"tags":["curry","egg","fennel-seeds"]}