{"id":2007,"permalink":"http:\/\/www.sailusfood.com\/2009\/02\/16\/vankaya-chikkudu-ginjalu-mudda-kura-brinjal-lima-beans-curry\/","title":"Vankaya Chikkudu Ginjalu Mudda Kura - Brinjal Lima Beans Curry","content":"Lima beans and eggplants are one of my all time favorite vegetable combinations. We prepare a mudda kura (a hotch potch of sorts) where plump beans merge with soft eggplants and ginger-garlic-green chillis-coriander paste to create a flavorful Andhra classic that is sure to brighten up one's meal. Spread it as a sandwich filling, eat it with rotis or plain rice, it is sure to delight your taste buds.\r\n \r\n\r\n\r\nVankaya Chikkudu Ginjalu Mudda Kura Recipe\r\nPrep & Cooking: 30 mts \r\nServes:3-4 persons \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg brinjals, washed, cubed or quartered and soaked in salted water\r\n\r\n1\/4 cup chikkudu ginjalu\/lima beans\r\n\r\n2 onions, chopped\r\n\r\npinch of turmeric\r\n\r\n1\/4 tsp cumin pwd\r\n\r\n1 tsp coriander pwd\r\n\r\n1\/4 tsp red chilli pwd\r\n\r\n1 1\/2 tbsps oil \r\n\r\nCoarsely crush:\r\n\r\n1\" ginger\r\n\r\n5-6 garlic cloves, slightly crushed\r\n\r\nsmall bunch coriander leaves\r\n\r\n2-3 green chillis\r\n\r\nSeasoning\/tadka\/poppu:\r\n\r\n1\/2 tsp cumin seeds\r\n\r\nfew fresh curry leaves\r\n\r\n\r\n\r\n1 Par-boil lima beans adding a little salt and about a cup of water. Strain any left over water once the vegetables are par-boiled.\r\n2 Heat oil in a cooking vessel and add the cumin seeds and let them splutter. Add curry leaves and toss them about for a few seconds.\r\n3 Now add the chopped onions and saute them till transparent. Add the coarsely crushed paste and saute for 4-5 mts. Add turmeric pwd, chilli pwd, cumin pwd, coriander pwd and salt and combine.\r\n4 Add the cubed brinjals and combine. Cook uncovered for 7-8 mts on medium heat. Stir once in a while. Add a few tbsps of water, reduce heat and cook covered for 10-12 mts. Add the par boiled beans and combine. At this point you can add a few tbsps of left over water from the beans. Cook covered for another 6-7 mts.\r\n6 Remove lid and let the curry cook such that there is no water and it like a hotch potch. Serve with hot rotis or rice.\r\n\r\nNote: You can use both white or purple brinjals. If large brinjals, cube them, if they are small, quarter them.  ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/02\/vankaya-chikkudu-kura1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vankaya-chikkudu-kura1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vankaya-chikkudu-kura1-300x300.jpg","main-ingredient":["brinjal","lima beans"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["chikkudukaya","vankaya"]}