{"id":204,"permalink":"http:\/\/www.sailusfood.com\/2006\/06\/01\/kajjikayalu-traditional-andhra-sweet\/","title":"Kajjikayalu - Traditional Andhra Sweet","content":"Though Andhra cuisine is reputed for its fiery hot chillis and spicy food, it also offers some popular traditional sweets, for the sweet-toothed, like borellu, arisellu, bobattu, sunni undalu, boondi laddo, jangiri etc. One such sweet is the Kajjikaya, a traditional sweet that is prepared by rolling out small balls of maida dough into thin puris and filled with a mixture of   dry coconut, sugar, semolina and cardamom powder and deep fried. \r\n\r\n\r\n\r\nKajjikaya has a light, crisp exterior and as you bite into this crescent shaped sweet, its crunchy texture with the subtle sweet flavor of dried coconut and sugar laced with a tinge of cardamom, stretches into every bite, leaving you very satisfied and craving for more. The sweetness of the kajjikaya is subtle that you can easily have 2 to 3 kajjikayalu without feeling heavy. \r\n\r\nKajjikayalu can be eaten anytime of the day and makes a great tea time snack or an after lunch\/dinner dessert. Kajjikaya is similar to the popular Maharastrian sweet 'Karanji' which is prepared using mawa (khoya \/thickened milk) instead of semolina.\r\n\r\n\r\n\r\n\r\nKajjikayalu - Andhra Sweet Recipe\r\nRecipe source & Support: Amma\r\nPrep & Cooking: 1 hour\r\nMakes approx 55-60 kajjikayalu\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n\r\n500 gms maida (all-purpose flour)\r\n\r\n4-5 tbsps ghee\r\n\r\nenough water to knead the maida\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\nFor the filling:\r\n\r\n1\/4 dry coconut finely grated\r\n\r\n1 cup sooji\/semolina (you can use putnala pappu\/roasted chick peas or khus-khus\/poppy seeds in place of sooji)\r\n\r\n1 cup sugar\r\n\r\n1 tsp cardamom pwd\r\n\r\n3 tbsps finely chopped cashewnuts\r\n\r\n\r\n\r\n1 Mix the maida with salt, 2-3 tbsps ghee and enough water to make a pliable dough, not too soft. Divide the dough and shape into small balls as shown in the picture. Keep aside covered for half an hour. \r\n\r\n2Meanwhile, heat a pan, add 1 tbsp ghee and add the grated coconut and  roast over medium flame for a few minutes, approx 3-4 mts. Remove and keep aside. If using fresh coconut, roast the coconut till golden brown. Ensure that its well roasted, it takes longer time to roast than dry coconut.\r\n\r\n3 In the same pan, add 1 tbsp ghee and add the sooji and  roast over medium flame till it turns light pink, approx 7-8 mts. Remove, cool and keep aside.\r\n\r\n4 Powder the sugar and mix with the roasted sooji, grated coconut, cardamom powder and cashewnuts. The filling is ready. Keep aside.\r\n\r\n5 Now, roll each ball with the rolling pin into a thin puri.\r\n\r\n6 Spread a tablespoon of the filling on one half of the rolled out dough. Wet your finger and run it along the edges of the spread out dough with water and fold over to the opposite end, enclosing the stuffing to form a semi-circle shaped kajjikaya. Press the ends firmly so that the filling doesnt come out during the deep frying process and twist the edges around the kajjikaya as shown in the picture.\r\n\r\n7 Heat enough oil in a wide vessel to deep fry the stuffed kajjikayalu. Drop 3-4 kajjikayalu into the oil slowly and deep fry them till golden brown, turning them carefully to the other side so that it cooks on all sides. Deep fry on medium heat and not piping hot oil.\r\n\r\n8 Cool and store in air tight containers. Kajjikayalu remain fresh for atleast a week and can be stored for 3-4 weeks.\r\n\r\n\r\n\r\nNote: Its advisable to make the kajjikayalu in batches. Roll out, stuff  and deep fry 3-4 kajjikayalu at a time (batch-wise). While preparing the next batch of kajjikayalu, reduce the stove flame and carry out the process. When deep frying the next batch, see that the oil is hot enough to deep fry. Keep the dough covered through out the preparation process. Sugar can be replaced with jaggery (panela). Kajjikaayalu moulds (available in the market) can be used to shape the kajjikayalu after rolling out the puri.\r\nOne of the variations for the filling is it to use khus-khus or poppy seeds in place of sooji, roast the khus khus and use.\r\nAnother variation is to use powdered putnala pappu (roasted chick peas) in place of sooji along with dry coconut and sugar\/jaggery. \r\nIn place of grated dry coconut, roasted and powdered sesame seeds or kova can be used with a blend of cashewnuts,walnuts and almonds.\r\n ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/kajjikayalu.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kajjikayalu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kajjikayalu-300x300.jpg","main-ingredient":["flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Flour Recipes","Indian Sweets Recipes"]}