{"id":21,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/19\/masala-dosa-sourdough-crepe-wrapped-round-potato-curry-south-indian-tiffinsnack\/","title":"Masala Dosa - South Indian Breakfast\/Tiffin","content":"Masala dosa is a South Indian breakfast - tiffin made with fermented rice and dal (lentil) batter. If you want to eat Masala dosa on Sunday, for breakfast, you need to start masala dosa batter preparation on Saturday morning. The fillings or side is a traditional potato curry  placed in the center of the Masala dosa, wrapped and served hot.\r\n\r\nRecipe of Masala Dosa with Potato Curry\r\n\r\nSoak 1 cup urad dal(black gram lentil), 2 cups rice and 1 tsp methi seeds(fenugreek) for 5-6 hours. Grind to a fine paste adding water. Let it sit overnight with lid for fermentation. Next day mix the batter well adding salt. The batter(which is similar to pancake batter consistency) is ready for making dosas.\r\n\r\nPotato Curry for Masala Dosa Filling\r\n\r\n\r\nPotato Curry Recipe for Masala Dosa\r\nPrep & Cooking: 30 mts\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n3 big potatos, peeled and cooked\r\n\r\nÂ½ cup of boiled green peas (fresh or frozen)(optional)\r\n\r\n1 carrot boiled and cubed(optional)\r\n\r\n1 inch piece of fresh ginger, peeled and minced\r\n\r\n3 green chillis slit lengthwise\r\n\r\n2 big onions finely sliced\r\n\r\nÂ¼ tsp turmeric pwd\r\n\r\nsalt\r\n\r\n2 tbsp oil\r\n\r\n1\/4 cup water\r\n\r\nFor tempering\/tadka\/taalimpu:\r\n\r\n1 tsp mustard seeds\r\n\r\n1 tsp cumin seeds(jeera)\r\n\r\n1 tsp  urad dal (black gram)\r\n\r\n1 tsp chana dal(Bengal gram)\r\n\r\n10 curry leaves\r\n\r\n\r\n\r\n1 Mash potatoes roughly into lumps with hand. \r\n2 Heat 2 tbsp of oil in a cooking vessel. Add the mustard seeds and let them splutter. Lower heat, add cumin seeds, urad dal, channa dal, curry leaves and fry till light brown, approx 10-15 seconds. The tempering should not burn.\r\n3 Add curry leaves, chopped green chillis and minced ginger. Mix and immediately add the sliced onions.\r\n4 Fry till transparent, add turmeric and salt. Now add the mashed potato lumps, boiled peas and carrots. Mix, sprinkle 3 tbsp of water and let it cook with lid on medium heat for 3 minutes. Turn off heat and adjust salt.\r\n\r\n\r\n\r\nStep by step picture on how to make Masala Dosa Recipe:\r\n\r\nHeat a griddle (you can use a non-stick pan). Grease the griddle with peanut oil or any other oil. Pour one ladle full of batter over the griddle.\r\n\r\n\r\n\r\nSpread the batter from the bottom of the ladle evenly making circles. Drizzle oil or butter around the edges of dosa and let it cook on medium heat. The dosa should turn light brown. The dosa generally takes 4-5 minutes to cook on medium heat. Take care not to burn it.\r\n\r\n\r\n\r\nSpread some butter over the dosa and then spread potato curry filling in the center of the dosa and fold it towards the center such that it covers the potato curry.\r\n\r\n\r\n\r\n\r\n\r\nSimilarly fold the other side also such that it covers the potato curry.\r\n\r\n\r\n\r\nMasala dosa is ready to eat. Masala Dosas can also be served with any chutney, podi or sambar. It is best to eat the dosa the moment its off the griddle..hot. I have tried to take some amateur pictures of the dosa batter spreading on the griddle....but hey, it tastes good and that's what matters:):)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/masala_dosa_curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masala_dosa_curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masala_dosa_curry-300x300.jpg","style":["easy","traditional"],"course":["meal","lunch box"],"special-diet":["eggless","nut free","dairy free","vegetarian","vegan","kid friendly","gluten\/wheat free"],"cuisine":["indian","south indian"],"cook-time":"30","prep-time":"15","main-ingredient":["rice","urad dal","potato"],"serves":"6","goes-well-with":["chutney","podi","sambar","potato curry"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Dal Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"],"tags":["dosa","dosa-batter","dosa-filling","masala dosa","potato curry"]}