{"id":2162,"permalink":"http:\/\/www.sailusfood.com\/2009\/04\/15\/bengali-cuisine-by-sandeepa-of-bong-mom-cookbook\/","title":"Bengali Cuisine - by Sandeepa of Bong Mom Cookbook","content":"The Indian food trail series travels to West Bengal, the land of maach (fish), bhaat (rice) and rasgulla. Adorable Sandeepa of Bong Mom's CookBook who delights us with her hilarious posts and Bengali culinary delights shares with us a typical home cooked Bengali meal. Thank you, Sandeepa. Dear readers, please give a warm welcome to Sandeepa. :)\r\n\r\n~ Sailaja\r\n\r\n\r\n\r\nSince Sailaja has asked me to write a guest post on Bengali Cuisine for her blog I have been in deep thought, given that she made a polite request some months back, I have been very thoughtful ever since. \r\n\r\nThere is so much to write and such a vast cuisine to encompass that I wasn't even sure I would do justice. Because you see, Bengali Cuisine has subtle nuances which varies within districts of West Bengal and not so subtle differences when you compare Bengali cuisine across borders from Bangladesh and that from West Bengal. \r\n\r\nSo I thought I would take the easy way out and stick to the kind of Bengali Food or Cuisine I am familiar with, the kind I have had for breakfast, lunch, dinner day in and day out while growing up, the kind my Ma makes everyday till date, the kind I have seen my Dida, my Grandma, my Aunts, my Husband's family make, the kind I cannot live without for more than a week and so cook for myself. \r\n\r\nMy Ma in spite of spending many of her years outside Bengal in a neighboring state, was very Bangali when it came to food. She did delve into all kinds of cuisine when it came to breakfast or tiffin items, but lunch and dinner on weekdays was strictly Bengali. Only occasionally when my Baba would be out of town would she shift from this and serve a dinner of say Aloo Paratha and Raita or maybe Noodles, such stuff was meant for tiffin or packed lunches and having them for sit down dinner or lunch on a weekday was well radical. \r\n\r\nHere I will describe a typical everyday, simple Bengali lunch which you will be served if you land up in a Bengali home in a small hamlet in Bengal on a hot afternoon. With the sun beating down on your back and the sleepy ghugoos making their call among the green shady trees if you happen to knock on the wooden doors of a Bangali home, you will be welcomed with a cool tumbler of aam-pora sherbet (green mangoes roasted and made into a sherbet) or daab er jaal (naariyal pani or coconut water) .\r\n\r\nOnce you are refreshed and sit down for your lunch, chances are this is what you will be served as was in my home many moons ago.\r\n\r\nA typical everyday lunch would begin with something bitter, definitely if it was Spring or early Summer, occasionally in other seasons. It would be either Bittergourd (Uchche) or Neem Leaves. Fried Bittergourd, bittergourd fried with eggplant, fried tender neem-begun (neem leaves with eggplant) and even boiled bittergourd with mashed potatoes were served as starter to cleanse your system and invigorate the taste bud. Shukto is another bitter veggie dish that you might get if you are lucky. \r\n\r\nNext was the Dal, this would usually be Moong or Masoor, Cholar Dal (Chana dal) with tiny coconut pieces on special days and Kalai er dal (Split White Urad Dal) when there was Aloo Posto or Aloo Seddho (Mashed Potatoes). Toor or Arhar Dal is not a very common dal in a Bengali household unless you are a Probashi bangali and have settled down up North. \r\n\r\nServed with the Dal there is typically a Bhaja -- a fried veggie. The most routine bhajas are Thin Sliced Potato Fries or Aloo Bhaja, Fried Eggplant or Begun Bhaja and Bittergroud fries or Uchche Bhaja. In summer when parwal was in season, there would be lots of patol bhaja or fried parwal. On days my Ma was feeling particularly liberal the bhaja would be some veggie dipped in a batter of gram flour and fried like the Beguni or Fulkopir Bora (Cauliflower dipped in a spicy gram flour batter and fried) \r\n\r\nNext would be a purely vegetarian dish made of any veggie that was in season. Typically most authentic Bengali vegetarian dishes are without garlic or even onion and minimum spices to retain their natural flavor. This could range from Charchari or a Labra, both of which are a medley of random veggies to a Lau Ghonto (Dry sabzi with Bottlegourd) or BandhaKopir Ghonto (a dry Cabbage & Potato Dish) or some other such stuff. There could be a Cauliflower Gravy (Phulkopir Dalna) or the much loved Aloo Posto. In fact this item could be anything with veggies that were brought back fresh from the market that day. \r\n\r\n\r\n\r\nThen of course comes the Fish without which a Bangali cannot survive. Looking back I see we had fish twice a day almost every day, except on Fridays which was a vegetarian day at our home and Sunday which was the Chicken or Mutton Day. Some days Fish was substituted with Egg Curry but there had to be a non-veg item on the menu every day if God or Nature didn't intervene. \r\n\r\nRegular Fish curries were not very spicy or rich. Fresh fish pieces were fried with salt and turmeric and then cooked into a gravy dish. The gravy could have infinite avatars from jhaal (a spicy gravy) to jhol (a very soupy kind of gravy, sometimes with vegetables). The ones that still arouse my tatsebuds are Doi-Maach (Fish in a gravy of spicy yogurt), Sosrshe Ilish (Hilsa in mustardy gravy), Chingri Malaikari (Prawns in a coconut milk based gravy), Tyangra maacher Jhaal (small fish in a spicy sauce) and many many more. Both big as well as small fishes are enjoyed and put to good use in Bengali Cooking, the small fishes are devoured whole from head to toe while the head of the bigger fishes are made into a delicious Muri Ghonto. \r\n\r\nTo wrap it all up there would be a Chaatni or a Tak, something sweet and sour made with tomatoes in winter or Green Mangoes in summer. There were variations to this of course with other fruits like pineapple, a papaya and even guess what FISH. My Dida(maternal grandma) used to make an awesome Ilish er Tak with bones and heads of Hilsa and tamarind that was to die for. \r\n\r\nThe end would be either with a Doi (yogurt) or some Mishti(a sweet dish) , which is what Bengalis are famous for outside Bengal. If it was a birthday or an occasion to celebrate there would be Paayesh (rice pudding)\r\n\r\nSince Bengalis are primary rice eaters this would be served with Plain White Rice and a wedge of lemon and Green Chillies on the side. \r\n\r\nIf you are a vegetarian and don't eat the fish you would be served with Chanar Dalna (a Paneer Gravy dish), Dhokar Dalna (chana dal steamed cakes in  a gravy) or another Vegetarian Dish which would be gravy-ish. \r\n\r\nSuch elaborate 6 course meals encompassing six tastes or raasas are no longer common in my home here in the US. There is little time for such leisurely meals in our busy life. We still have primarily Bengali food everyday but it seldom goes the full circle from bitter to the sweet. But when I am back home in India or my Ma or Ma-in-law is visiting those days are back again.\r\n\r\nThis is not a write up on Bengali Cuisine but what I am familiar with as an every day home lunch at a Bengali home\r\n\r\nFollowing are links to the recipe on my blog for some of the dishes I have mentioned in this article:\r\nKalai er dal  \r\nCharchari  \r\nAloo Posto \r\nLau Ghonto\r\nMuri Ghonto \r\nDoi Maach  \r\nDoi Sorshe Ilish \r\nChingri Malaikari or Prawn Malaikari  \r\nTomato Khejur Chaatni\r\n\r\nArticle, recipes and images - Sandeepa\r\n\r\nEarlier on Indian Food Trail \r\n Maharastra \r\nA Simple Summer Meal by Nupur of One Hot Stove\r\nTraditional Maharashtrian Thalis - Veg & Non-Veg by Meera of Enjoy Indian Food\r\nTraditional Maharastrian Sweet & Snacks by Meera of Enjoy Indian Food\r\nKonkan Region - North Canara\r\nAn Essay on Konkani Cuisine  by Shilpa of Aayis Recipes\r\nKerala \r\nMunchies from a Kerala home - Shn of Mishmash\r\nUdupi-Mangalore\r\nExploring Udupi Mangalorean Street Foods  by Sia of Monsoon Spice\r\nTamil Nadu\r\nTraditional Tamil Tiffins - Lakshmi of Veggie Cuisine","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/04\/doi-ilish1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/doi-ilish1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/doi-ilish1-300x300.jpg","main-ingredient":["fish"],"author":null,"type":"post","categories":["All Recipes","Bengali Food Recipes","Indian Curry Recipes","Indian Fry Recipes"],"tags":["Bengali Food Recipes","fish","stir_fry"]}