{"id":2360,"permalink":"http:\/\/www.sailusfood.com\/2009\/03\/08\/bangaladumpa-vepudu-potato-stir-fry-1\/","title":"Bangaladumpa Vepudu - Potato Stir Fry (1)","content":"Who doesn't love the simple potato roast, stir fried to a golden brown shade and seasoned with chilli powder? I can't think of any person who wouldn't enjoy this comfort food. I realized that I haven't blogged a potato stir fry recipe so far and am wondering how on earth I missed blogging my favorite dish. :) Its made often, at least twice a week at our home since Nehal is extremely fond of this stir fry.\r\n\r\nBangaladumpa\/Alugadda Vepudu ~ Potato Fry\r\n\r\nThis stir fry goes well as a side with rice and rasam\/sambar OR curd rice. One tip to follow (if you have some time on hand) to achieve a crisp fry with less oil ~ add the chopped potato cubes to salted water and keep aside for 20 mts or so, drain completely and prepare.\r\n\r\n\r\nBangaladumpa Vepudu Recipe\r\nPrep & Cooking: 25-30 mts\r\nServes 3 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 large potatoes, washed, peeled and cut into small cubes\r\n\r\npinch of turmeric pwd\r\n\r\n1\/2 tsp red chilli pwd (adjust)\r\n\r\nlarge pinch of coriander pwd\r\n\r\nsmall pinch cumin pwd\r\n\r\nsalt to taste\r\n\r\n1 tbsp oil\r\n\r\n\r\n\r\n1 Heat oil in a cooking vessel, add the chopped potatoes. Saute on high heat for 2-3 mts. \r\n2 Reduce to medium flame and cook for 4-5 mts, stirring inbetween and scrapping the sides and bottom. Reduce flame to low, add salt to taste, place lid and cook till the potatoes turn soft, approx 15-17 mts. Stir inbetween, scrapping the sides of the dish as the potato tends to stick to the vessel. \r\n3 Add the coriander pwd, turmeric pwd, chilli pwd and jeera pwd and combine. Stir fry without lid on high flame for 3-4 mts and combine well till the potatoes turn a golden brown. Turn off heat and serve with rice, rasam and appadam. \r\n\r\nIf you are wondering what (1) is doing next to the the post title, well, its the first variation of the numerous potato stir fry recipes that I prepare. In future I hope to blog more potato stir fries\/roasts with variations.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/03\/potato-fry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/potato-fry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/potato-fry-300x300.jpg","main-ingredient":["potato"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["potato","stir-fry"]}