{"id":2529,"permalink":"http:\/\/www.sailusfood.com\/2009\/04\/05\/savory-snack-matri\/","title":"Savory Snack ~ Matri","content":"Its not everyday that I find myself sitting in the verandah overlooking the garden, relishing deep-fried comforts over a cup of masala chai. Well, today was one such day that I treated myself to a crispy North Indian snack over a cup of hot chai. I prepared Matri that makes a great snack with tea. The recipe is from my friend's mother whose matris have a pronounced ajwain and semolina flavor. Crisp on bite and addictive! \r\n\r\n\r\n\r\nWill post a baked version of Matri, the next time I prepare them.\r\n\r\n\r\n\r\nMatri Recipe\r\nPrep & Cooking: 40 mts\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n3\/4 cup maida\/all purpose flour\r\n\r\n1\/4 cup atta\/whole wheat flour\r\n\r\n1 cup semolina\/sooji\r\n\r\nlarge pinch salt\r\n\r\n1 tsp ajwain\/waamu\r\n\r\n1 tbsp ghee\r\n\r\nwarm water for kneading\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 In a vessel, combine flour, atta, semolina, ajwain, ghee and salt and combine well. Slowly add warm water and knead into a soft dough. Keep aside covered for 15-20 mts.\r\n2 Pinch off small lemon sized balls of the dough and roll into slightly thick puris, approx 3\". Place on a cloth and prick all over with a fork. \r\n3 Heat oil for deep frying in a heavy bottomed vessel and once oil is piping hot, reduce to medium flame. Place 6-8 matris based on the size of the vessel and fry till golden brown, flipping over and cooking both the sides. Increase flame towards the end of the cooking process when the matris attain a slight golden shade, drain and place on absorbent paper. On cooling, matris attain a crisp texture.\r\n4 Store in airtight containers and serve with tea.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/04\/matri-snack.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/matri-snack-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/matri-snack-300x300.jpg","main-ingredient":["whole wheat flour"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","North Indian Recipes"],"tags":["snack"]}