{"id":2636,"permalink":"http:\/\/www.sailusfood.com\/2009\/04\/18\/masoor-dal\/","title":"Masoor Dal","content":"Masoor Dal\r\n\r\nMasoor dal is not a regular lentil in my kitchen but when I do prepare it, this dal is much loved and relished by all at home. A versatile dal that each time I prepare its a variation from the one prepared earlier. The recipe featured today is a vibrant colored dal finished with asafoetida infused cumin-red chillis leaves tadka in ghee which brightened up the dal. Loved the creamy texture of the dal with wonderful flavors, none overwhelming their counterparts. Rotis with masoor dal, yogurt and raw carrots was our lunch today. Simple foods are such a joy, aren't they? :)\r\n\r\nMasoor Dal ~ Red Lentils\r\n\r\n\r\nMasoor Dal Recipe\r\nPreparation: 25 mts\r\nServes 3-4 persons\r\nCuisine: North Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup masoor dal\r\n\r\nbig pinch turmeric pwd\r\n\r\n1 green chilli, slit lengthwise\r\n\r\n1 small onion, finely chopped\r\n\r\n1 tomato, finely chopped\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\npinch of cumin pwd\r\n\r\n1\/4 tsp red chilli pwd (adjust)\r\n\r\n1\/2 tsp grated ginger\r\n\r\nfew curry leaves\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1-2 dry red chilli, de-seed and tear\r\n\r\npinch of asafoetida\r\n\r\n2 tsps ghee\r\n\r\n\r\n\r\n1 In a pressure cooker, place a cup of masoor dal and turmeric pwd, 2 cups of water and pressure cook upto 2 whistles. If cooking over stove top, cook till the dal is soft. Mash dal, add half a cup of water and salt. You can add more water if you want a watery consistency. Keep aside.\r\n2 Heat oil in a cooking vessel, add curry leaves, green chilli, grated ginger and coriander pwd, cumin pwd and red chilli pwd and over low flame let the oil be infused with these spice pwds for a few seconds. Add the onions and saute for 4 mts. Add the chopped tomatoes and cook for another 4 mts. \r\n3 Add the cooked dal to this mixture and combine. Cook for 8 mts over low to medium flame. \r\n4 In a separate pan, heat oil for seasoning. Add cumin seeds and let them splutter. Add the red chillis and asafoetida and turn off heat. Pour this seasoning over the dal and serve with rotis or white rice.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/04\/masoor-dal2.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masoor-dal2-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masoor-dal2-300x300.jpg","main-ingredient":["masoor dal"],"author":null,"type":"post","categories":["All Recipes","Indian Dal Recipes","Indian Lentil Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["masoor-dal","pappu"]}