{"id":267,"permalink":"http:\/\/www.sailusfood.com\/2006\/06\/27\/andhra-khichdi-pulagam-lentil-rice-medley\/","title":"Andhra Khichdi - Pulagam - Lentil-Rice Medley","content":"Prepared almost on the same lines as Khichdi, Pulagam is Andhra Khichdi, made with rice and split moong dal. Very simple to prepare and is often made when one is sick or feeling tired. \r\n\r\n It is also prepared as Naivedyam (prasadam\/offering to God) during festivals like Sankranti where fresh or new rice from the harvest is used along with pesara pappu(split yellow moong dal) to prepare it. Quite a few temples, here in Vizag, offer pulagam as Naivedhayam to the presiding deity and distribute to the devotees visiting the temple for darshan.\r\n\r\nThe flavor and aroma of the naivedyam prepared in the temples is simply irresistable and cannot be compared to the one made at home and I always look forward to eating pulagam during my visit to the temple :)\r\n\r\nPulagam Recipe\r\nRecipe source: Amma\r\nPrep & Cooking: 30 mts including soaking time of rice\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups old basmati rice (any variety of rice can be used like sunnalu or sona masuri)\r\n\r\n1\/2 cup split yellow moong dal (pesara pappu) \r\n\r\n1 tbsp ghee\r\n\r\n1 tsp cumin seeds\r\n\r\n10-12 fresh curry leaves\r\n\r\n1\/4 tsp whole black pepper (optional)\r\n\r\nsalt to taste\r\n\r\n3 Â½ cups of water\r\n\r\n10-12 cashewnuts lightly fried in ghee till golden brown\r\n\r\n\r\n1 Wash the rice and dal and soak them together in water for 15-20 mts.\r\n2 Meanwhile in a heavy bottomed vessel or pot, heat ghee. Add the cumin seeds, let them splutter and turn slightly brown. Add the curry leaves and black pepper corns and fry for a few seconds.\r\n3 Add the drained rice and dal and combine with spices and fry for a few seconds.\r\n4 Add water and salt and pressure cook till the rice and dal are cooked and soft.\r\n5 Garnish with fried cashwenuts and serve with tomato chutney or avakai.\r\n\r\n\r\nNote:You can slightly dry roast the split moong dal before soaking in water along with rice. You can also add an extra glass of water if you want a more gooey texture of the lentil-rice medley.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/pulagam_andhra_khichdi.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pulagam_andhra_khichdi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pulagam_andhra_khichdi-300x300.jpg","main-ingredient":["rice","moong dal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Dal Recipes","Indian Festivals","Indian Lentil Recipes","Indian Rice recipes","Indian Vegetarian Recipes"]}