{"id":27,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/23\/pesara-attu-upma-andhra-special-tiffin-breakfast-dish\/","title":"Pesarattu Upma - Andhra Special Tiffin\/Breakfast ","content":"Pesarattu Upma ~ Andhra Breakfast dish\r\n\r\nPesarattu Upma is a traditional breakfast dish of Andhra Pradesh. Its a whole green gram lentil (moong dal) dosa stuffed with Upma. Pesarratu and Upma are two separate dishes. Each of them can be eaten individually on their own or as a combination which is called Pesarattu Upma.\r\n\r\nPesarattu Recipe\r\n\r\n1 cup  pesalu (whole moong dal\/green lentil)\r\n1 tbsp raw rice\r\n1\" ginger piece\r\n2 green chillis\r\n1 tbsp cumin seeds\r\n1 cup finely chopped onions\r\n1 tbsp finely chopped green chillis\r\n2 tbsp finely chopped ginger(optional)\r\nsalt\r\noil\r\nUpma for the filling (upma recipe follows after this recipe)\r\n\r\nSoak the moong dal and rice in water for 24 hours.\r\nDrain the water and add green chilies, 1\" ginger piece, cumin seeds and salt.\r\nGrind the mixture to a smooth paste adding water as required. It's similar to dosa batter or pancake batter..not too thin though. Keep aside.\r\nMeanwhile take a separate bowl and add the chopped onions, ginger and green chillis (you can avoid green chillis if you want less spice) and mix well.\r\nPrepare upma and keep aside.The recipe of upma is given at the end of the pesarattu recipe.\r\n\r\n\r\n\r\nHeat a griddle or hot plate to medium heat and grease it with little oil. Pour a laddle full of pesarattu batter on it and spread it with the base of the laddle into a thin round layer like a pan cake and drizzle 1 tsp oil around the edges of Pesarattu.\r\nTop the pesarattu with some of the chopped onions and ginger. Cook until the pesarattu turns brown.\r\n\r\n\r\n\r\nFlip the pesarattu over the other side and let it brown on medium heat for half a minute.\r\nFlip it over again and add a big spoonful of upma in the center of the pesarattu.\r\n\r\n\r\n\r\nFold over the sides and cover as shown in the picture.\r\n\r\n\r\n\r\nRemove from griddle and your Pesarattu-Upma is ready.\r\nSprinkle some water on the pan and use the same proceedure for making your next Pesarattu.This makes approx 7-8 pesarattus.\r\nTraditionally its served with upma and ginger chutney.You can also serve with coconut chutney or coriander chutney.\r\n\r\nUpma Recipe\r\n\r\n1 cup upma rava (fine semolina, sooji, cream of wheat)\r\nMost prefer to eat upma made of fine semolina than the coarse variety. So when buying semolina ask for the finer variety. If you make upma with the coarser kind, remember to add a little more water for it to cook well.\r\n2 cups water\r\n1 teaspoon urad dal (minappappu)\r\n1\/2 tsp spoon mustard seeds (aavalu, ria)\r\n3 green chillies slit length wise\r\n1\" ginger finely chopped\r\n10 curry leaves\r\nsalt to taste\r\n2 medium sized chopped tomatoes\r\n1\/3 tsp turmeric (pasupu, haldi)\r\n2 tbsps oil \r\n\r\nDry roast the upma rava for 3-4 minutes. Its color should'nt change. Don't burn it. Keep aside.\r\nHeat the oil in a cooking dish. Add the mustard seeds and let them splutter. Now add the urad dal and on low heat let it brown.\r\nNow add the curry leaves, ginger and green chillis.\r\nAdd the tomatoes and fry till soft.\r\nAdd coriander leaves and salt.\r\nAdd 2 cups of water and bring it to boil.\r\nNow slowly pour the upma rava and stir continuously to avoid lumps and mix well.\r\nAdd 1 tbsp ghee (optional) and cover. Cook till it becomes soft like a pudding...approx 7-8 minutes.\r\nRemove from fire and set aside for 5 minutes. You may add  1 tsp of lemon juice, if you like. It adds flavor to the Upma.\r\nServe with pesarattu.\r\n ","style":["easy","traditional"],"course":["breakfast","meal"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","healthy","pregnancy","kid friendly"],"cuisine":["andhra"],"cook-time":"30","prep-time":"15","main-ingredient":["moong dal","semolina","ginger"],"serves":"5","goes-well-with":["chutney","podi"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Dal Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["pesarattu","upma"]}