{"id":28,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/24\/gutti-vankaya-kura-stuffed-egg-plant-brinjal-curry\/","title":"Gutti Vankaya Kura ~ Stuffed Egg Plant\/Brinjal Curry","content":"\r\n\r\nGutti Vankaya Kura or Stuffed Eggplant\/Brinjal curry is Andhra traditional special curry.This dish can be made with either the small purple brinjals or the small round green eggplants. But you need to make sure that the brinjals are absolutely fresh, shiny and tender (the seeds should'nt be black) without a dry withered look. This dish tastes good only if the brinjals are fresh, young and tender. The one I am posting today is made with the small purple ones.\r\n\r\nWell stuffed brinjal curry can be made with a variety of stuffings. The one I am posting today is a family favorite and very simple to make. If the brinjals are tender you don't need to use a pressure cooker. The brinjals will cook well on steam in a cooking vessel, if tender.\r\n\r\nGutti Vankaya Kura Recipe\r\n\r\n10-12 fresh tender purple brinjals(vankaayi,aubergine)\r\n2 onions finely sliced\r\n6 flakes garlic\r\n2 tbsp tamarind paste\r\n1 tsp red chilli pwd\r\n1\/3 tsp turmeric pwd\r\n1 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1 tbsp white butter or ghee\r\n1\/2 tbsp jaggery (optional- but tastes good with sugar or jaggery)\r\n2 tbsps\r\n1 tsp cumin seeds\r\n12 curry leaves\r\nlarge pinch methi seeds (menthulu,fenugreek)\r\nsalt to taste\r\n1 tbsp chopped coriander leaves(garnish)\r\n\r\n\r\n\r\nWash and dry the purple brinjals. Keep the stalks.\r\nPrepare the stuffing first.\r\nHeat 1\/2 tbsp oil in a pan and add the garlic cloves and onions and fry on medium heat for 7-8 minutes or till transparent. Remove from fire and cool. Grind to a paste adding little water.\r\nAdd the coriander pwd, cumin pwd, chilli pwd, butter or ghee, sugar or jaggery and salt. Mix well.\r\nNow take each brinjal and cut from the base end (opposite side of stem)  and make a slit towards stem side but not all the way through i.e slit each brinjal into four sections lengthwise without cutting off the crown. The brinjals are ready for stuffing and the stuffing requires some patience...:)\r\nSeparate the brinjal quarters gently and fill the stuffing inside slowly without breaking the brinjals. \r\nStuff all the brinjals in this manner. Keep aside the remaining paste.\r\n\r\n\r\n\r\nHeat 1 1\/2 tbsp oil in a cooking dish. Add cumin seeds and let them splutter. Add the methi seeds and curry leaves and fry for few seconds.\r\nNow slowly place each of the stuffed brinjals in the dish and add the remaining paste on top and sprinkle 1\/4 cup of water. and cook for 20-30 minutes on slow heat.\r\nDo check in between to stir the brinjals without breaking them. the brinjals are three fourth cooked add the tamarind paste and one cup water. Adjust salt.\r\nCover and cook further for another 25-30 minutes or till the brinjals are well cooked and soft on touch. Garnish with chopped coriander leaves.\r\n\r\nTo serve, gently lift the stuffed brinjals with a wide spoon and place on serving plate and pour the gravy. Tastes wonderful with hot rice or roti.","style":["easy","traditional"],"course":["side"],"special-diet":["nut free","eggless","vegetarian","dairy free","gluten\/wheat free","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"40","prep-time":"20","main-ingredient":["brinjal","onion","tamarind"],"serves":"5","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["brinjal","eggplant","gutti-vankaya","stuffed-eggplant"]}