{"id":2877,"permalink":"http:\/\/www.sailusfood.com\/2009\/05\/23\/vankaya-bangaladumpa-vepudu-brinjal-potato-stir-fry\/","title":"Vankaya Bangaladumpa Vepudu - Brinjal Potato Stir fry","content":"Today we have an unassuming, simple stir fry prepared with very familiar everyday vegetables, Potato and Brinjals. In this vepudu recipe, the potatoes are cooked until fork-tender while the cubed brinjals tend to lose shape with the fleshy pulp melding with the spices to bring out sharp caramalized flavors. Isn't wonderful how two down-to-earth vegetables are combined with a few aromatic spices to incredible effect? Makes a delicious side with rice and not to mention it works as a great sandwich filling too.\r\n\r\nEggplant Potato fry, Tomato Dal and Rice ~ Meal today\r\n\r\nBangaladumpa Vankaya Vepudu Recipe\r\nPrep & Cooking: 30-35 mts\r\nServes: 3-4 \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 white brinjals, wash and cube, place in salted water\r\n\r\n2 potatoes, wash, peel and cube\r\n\r\nbig pinch turmeric pwd\r\n\r\n1 tsp chilli pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\npinch of methi pwd (menthi podi) optional\r\n\r\n1 1\/4 tbsps oil\r\n\r\nsalt to taste\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n3\/4 tsp cumin seeds\r\n\r\n3-4 garlic cloves, crushed\r\n\r\n1\" ginger finely minced\r\n\r\n10-12 curry leaves\r\n\r\n\r\n\r\n1 Heat oil in a cooking vessel. Add the mustard seeds and as they splutter, add the cumin seeds and once they crackle, add the garlic, ginger and curry leaves and stir fry for a few seconds.\r\n2 Add the cubed potatoes, salt and turmeric pwd and combine. Cook on medium flame for 3 mts (combining once or twice during this time), then place lid and reduce flame. Cook for 5-6 mts. Constantly stir fry to ensure they don't stick to the pan. \r\n2 Add the drained cubed brinjals and cook without lid for 2 mts on low to medium flame. Stir fry in between.\r\n3 Add the chilli pwd, coriander pwd and methi pwd and combine. Place lid and cook on low to medium flame till the brinjals and potatoes turn soft. Stir in between. Adjust salt. The stir fry will be close to a gooey mass (slightly mudda kura).\r\n5 Serve with hot rice or rotis. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/05\/brinjal-potato-stir-fry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/brinjal-potato-stir-fry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/brinjal-potato-stir-fry-300x300.jpg","main-ingredient":["brinjal","potato"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["brinjal","potato","stir_fry","vegan_recipe","vegetables"]}