{"id":2933,"permalink":"http:\/\/www.sailusfood.com\/2009\/05\/28\/how-to-blanch-tomatoes-onions\/","title":"How To Blanch Tomatoes & Onions","content":"Regular readers will notice that a few recipes featured here call for 'blanching' of vegetables. Many of my dear readers have left comments asking 'how to blanch onions and tomatoes'. \r\n\r\nBlanching is partially cooking vegetables in boiling water for a short period and immediately plunging them in cold water to stop the cooking process. Blanching helps soften and preserve the colors of vegetables. Learn more on the basics of blanching.\r\n\r\nFor few recipes that involve greens and vegetables like cauliflower, french beans, lima beans, amaranth leaves, spinach, tomatoes and onions, I sometimes blanch and use them. \r\n\r\nHow to blanch tomatoes & onions?\r\n\r\nOnions & Tomatoes ready for blanching\r\n\r\nTo blanch onions, peel the onions, make a cross at the root end. Bring salted water to a rolling boil in a large vessel and carefully drop the onions in the hot water. Continue to boil for 4-5 mts or till al dente. Turn off heat and immediately remove the blanched onions and place them in cold water. This process will stop the onions from overcooking. Drain from cold water once they cool completely and use as called for in the recipe. \r\n\r\n&nbsp;\r\nBlanched Tomatoes ~ Blanched Onions\r\n\r\nFollow the same procedure for tomatoes. Make a cross at the bottom end of the tomatoes and place them in a vessel of boiling water. Tomatoes require lesser time in boiling water as compared to onions. Let the tomatoes cook in boiling water for 2-3 mts. Immediately remove them and place in cold water and once they cool completely, drain the water and peel the tomatoes. You can chop or grind to a paste or as called for in the recipe.\r\n\r\nGrinding the blanched onions yields boiled onion paste which works as a great base for dishes like Butter Paneer Masala. Grind the blanched and peeled tomatoes and your tomato puree is ready.\r\n\r\n&nbsp;Tomato Puree ~ Boiled Onion Paste\r\n\r\n Note: To peel the skin of tomatoes easily, I boil the tomatoes for just a mt and then plunge into cold water. To prepare blanched tomato paste, I let the tomatoes cook in boiling water for at least 3 mts if they are firm and large and lesser time if they are soft and smaller in size. If I have time on hand, I de-seed the blanched tomatoes and puree!\r\n\r\nHow to articles:\r\nHow to make butter and ghee - photo tutorial\r\nHow to make rava dosa - photo tutorial\r\nHow to make ginger garlic paste","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/05\/onions-tomatoes-before-blanching.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/onions-tomatoes-before-blanching-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/onions-tomatoes-before-blanching-300x300.jpg","main-ingredient":["onions","tomatoes"],"author":null,"type":"post","categories":["All Recipes","How To Cook","Recipes Vegetable Dishes"],"tags":["onions","tomato","vegetables"]}