{"id":3058,"permalink":"http:\/\/www.sailusfood.com\/2009\/06\/01\/prawn-fried-rice\/","title":"Prawn Fried Rice","content":"Prawn Fried Rice\r\n\r\nAlong with Royallu Vepudu, I also made a quick, easy and flavorful Indo-Chinese style sweet and sour Prawns the other day and used the left overs to prepare Prawn Fried Rice. Fried rice is something that I make on days I am rushed for time. Fried rice being open to endless variations, I just throw together whatever few basic ingredients I have on hand for a quick, fuss-free, one pot meal. \r\n\r\nLeft over rice was exactly what I needed along with the sweet and sour prawns to whip together a quick fried rice that had the flavors melding together to create a wonderfully savory rice dish. Anyone out there looking for a satisfying meal with a lot of flavor and ease in preparation has to try this one. \r\n\r\nSweet and Sour Prawns\r\n\r\nSweet and Sour Prawns Recipe\r\nMarination: 15 mts Cooking Time: 10 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 kg cleaned and de-veined prawns\r\n\r\n1 tsp finely minced garlic\r\n\r\n1 tsp finely minced ginger\r\n\r\n1\/4 cup spring onions, finely chopped\r\n\r\n2 finely chopped green chilli (optional)\r\n\r\n1 tsp red chilli paste\r\n\r\n1 tsp light soya sauce \r\n\r\n1\/2 tbsp vinegar\r\n\r\n1\/2 tsp brown sugar\r\n\r\n1 tbsp tomato ketchup\r\n\r\nsalt to taste\r\n\r\n1 tbsp sesame oil or peanut oil\r\n\r\n\r\n\r\n1 Marinate the cleaned and de-veined prawns in tomato sauce, vinegar, soya sauce, brown sugar and red chilli paste for 15-20 mts.\r\n2 Heat oil in a wok or kadai, swirl it all over and it should be smoking hot. Add the minced garlic and ginger and saute for a few seconds. Add the chopped spring onion whites and green chillis stir for 2 mts, constantly tossing them.\r\n3 Add the marinated prawns along with any left over marination and cook on high heat for a mt without tossing. Flip the other side and cook for another mt. Combine once again and cook on medium heat for 3 mts or till done, tossing constantly. Season with salt.\r\n4 Garnish with spring onions greens and serve hot as an appetizer or stir fry.\r\n\r\nPrawn Fried Rice Recipe\r\nPrep & Cooking Time: 30 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n4 cups of cooked (cold) rice (long grain variety) \r\n\r\n1\/4 cup spring onions, finely chopped\r\n\r\n1 cup finely chopped vegetables (carrots, beans and capsicum)\r\n\r\n1 cup sweet and sour prawn stir fry (recipe above)\r\n\r\n1 tsp vinegar\r\n\r\npepper pwd as required\r\n\r\nsalt as required\r\n\r\n1 1\/2 tbsps sesame oil or peanut oil\r\n\r\n\r\n\r\n1 Heat sesame oil in a large wok and once the oil is piping hot, add the spring onions and stir fry for 1 mt on high.\r\n2 Add the rest of the vegetables and toss them on high heat for 3-4 mts.\r\n3 Add salt and pepper pwd combine. Add the cooked prawns and toss. Cook on high for a mt. Add the cooked cold rice and combine well. Spread it all over the pan and leave on medium high for a mt. Combine again, spread out and leave on medium high for another mt. \r\n4 Add vinegar and toss all the contents on high heat for a few seconds. Turn off flame. Garnish with chopped spring onion greens and serve hot.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/05\/shrimp-fried-rice.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/shrimp-fried-rice-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/shrimp-fried-rice-300x300.jpg","main-ingredient":["prawns"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Non-Vegetarian Recipes","Indian Rice recipes","Indian Snacks and Starter Recipes"],"tags":["prawns","rice"]}