{"id":308,"permalink":"http:\/\/www.sailusfood.com\/2006\/08\/27\/paala-undrallu-kudumulu-vinayaka-chavathi-naivedyam\/","title":"Paala Undrallu & Kudumulu - Vinayaka Chavathi Naivedyam","content":"Today is Vinayaka Chavithi aka Ganesh Chaturthi festival, dedicated to Lord Ganesha, God of Wisdom and Prosperity. It is celebrated on the Suddha Chavithi day (the fourth day after the no-moon day) of the lunar month Bhadrapada maasam (August\/September). \r\n\r\nThis is a special festival which evokes memories that are very dear to me. Vinayaka Chavithi is one festival I always looked forward to during my childhood. We siblings, my younger brother and sister would go shopping the earlier day with our parents and buy all the pooja saman (material), a cute clay idol of Lord Ganesha and a book narrating the story of the Lord and the significance of conducting this auspicious puja. \r\n\r\nWe would wake up very early and get prepared to adorn the Paalavalli (which is made from bamboo and is tied with strings to make a roof over the idol) with fruits and flowers and place the clay idol of Lord Ganesha below it and place our school books before the idol, along with fruits and naivedyam as its believed that the Lord would help us do well in our studies and overcome all obstacles in life and bless us. \r\n\r\n\r\nAmma would prepare the naivedyam and Naana would read the life story of Lord Ganesha (which explains the significance of performing the pooja) and chant the mantras while we would sprinkle akshatalu (raw rice mixed in turmeric pwd), patri (leaves) and flowers. We used to be impatient for the pooja to finish so that we could eat all the different varieties of undrallu and festives foods prepared especially for Vinayaka Chavithi..:)\r\n\r\n\r\n\r\nLord Vinayaka is said to be fond of \"Undrallu\" which is mainly prepared from rice flour. Hardly any ghee\/oil is used to prepare undrallu as they are prepared by way of steaming which makes them low fat unlike most festive foods which are high in calories. Different varieties of undrallu both savory (kudumulu) and sweet ones are prepared and offered as naivedyam\/prasadam to Lord Vinayaka. \r\n\r\nPaala Undrallu are sweet flavored and prepared from rice flour, milk, grated coconut, seasame seeds and sugar. Very simple to prepare with a subtle sweet flavor.\r\n\r\n\r\nPaala Undrallu Recipe\r\nRecipe source: Amma\r\n Cooking Time: 30 mts \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup rice flour\r\n\r\n2 1\/2 cups water\r\n\r\n1 cup sugar (you can reduce the quantity)\r\n\r\n1 cup grated coconut\r\n\r\n1 cup milk\r\n\r\n1\/2 cup seasame seeds (dry roast for a mt and grind to a coarse pwd)\r\n\r\nÂ¼ tsp elachi pwd (cardamom)\r\n\r\n1 Bring 2 cups of water to boil and add the rice flour and immediately cover it with a lid without stirring and reduce heat. Let it cook for 4-5 mts. Turn off heat and cool. Make small balls and keep aside.\r\n2 In another vessel add the sugar and water and bring it boil. Reduce heat and add the grated coconut and stir for a few seconds. Add the rice flour balls and mix.\r\n3 Add the milk and let the balls cook in this syrup for 3-4 mts. Now add the ground seasame seeds pwd and combine well. The consistency should be a slightly thick syrup. Turn off heat. Sprinkle ground elaichi pwd.\r\n\r\nKudumulu or Undrallu are savory rice balls made from rice ravva and bengal gram  dal. Very simple to prepare and absolutely healthy as its steamed.\r\n\r\n\r\nUndrallu\/Kudumulu Recipe\r\nRecipe source: Amma\r\n Cooking Time: 15-20 mts other than soaking rice and grinding to a coarse pwd \r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups raw rice, washed, dried completely and ground to a coarse pwd similar to sooji\r\n\r\n4 cups water \r\n\r\n1\/4 cup Bengal gram \/ chana dal (soak in water for 5-10 mts and drain) \r\n\r\nÂ½ tsp cumin seeds (optional)\r\n\r\n1 tsp ghee\r\n1 Heat ghee in a pan and add the soaked channa dal and fry the dal for a second or two.\r\n2 Immediately add water and salt, bring to a boil. Once it reaches boiling point, immediately add the ground rice ravva and stir continuously ensuring that no lumps are formed and once all the water is absorbed and appears like a big lump, cover and cook for 4-5 mts. Turn off heat and cool.\r\n3 Once cool, make big lemon sized balls of the cooked mixture. Undrallu are ready to be offered to Lord Ganesha as naivedyam.\r\n\r\nNote: These days rice ravva is available in most stores and all you need is to add this ravva to boiling water instead of the tedious process of soaking and grinding the dried rice.\r\n\r\nVinayaka Chavithi Subhakankshalu!!\r\nWishing all my readers and visitors a very happy Ganesh Chaturthi.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/08\/vinayaka_chaturthi_naivedyam-1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vinayaka_chaturthi_naivedyam-1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vinayaka_chaturthi_naivedyam-1-300x300.jpg","main-ingredient":["rice flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Flour Recipes","Indian Festivals","Indian Vegetarian Recipes"],"tags":["ganesh","kudumulu","undrallu"]}