{"id":3115,"permalink":"http:\/\/www.sailusfood.com\/2009\/06\/03\/4-summer-salads\/","title":"4 Summer Salads","content":"Past few days had the mercury soaring with me spending as less time as possible in the kitchen. Such days call for cool, refreshing salads. Usually along with salad we drink home grown tender coconut water or buttermilk or fresh mango juice. These extremely easy, cool salads make for a light and filling meal.\r\n\r\n&nbsp;Simple Kachumbar ~ Sprouts Apple Salad\r\n\r\n&nbsp;Fruit Salad ~ Chicken Salad\r\n\r\nKachumbar  ~  Finely slice onions. Julienne capsicum, cucumber, carrot and beetroot. Place in a bowl, combine and chill. Just before serving, combine olive oil, salt, pinch of chilli pwd, pinch of sugar and lemon juice. Mix well and garnish with fresh coriander leaves and serve.\r\n\r\nSprouts & Apple Salad ~ Finely chop an apple and cucumber. Combine with a cup of moong sprouts. Just before serving, combine salt, pepper pwd, pinch of sugar and lemon juice and combine well. \r\n\r\nFruit Salad ~ Peel and cube ripe papaya and musk melon. Drizzle 1-2 tsp of honey and combine. Chill and serve.\r\n\r\nChicken Salad  ~ Boil chicken adding some salt and pepper. Drain the stock and de-bone the chicken and chop into small pieces. Julienne capsicums, slice onions, cumcumber and tomatoes (de-seed). Combine all the above ingredients and chill. In a bowl, combine 1 tbsp mayonnaise, 1 tbsp mustard sauce, 1 tbsp honey, 1\/2 tbsp lemon juice, 2 tbsps roasted and peeled peanuts, pepper and salt to taste. Whisk well. Just before serving tear iceburg lettuce roughly and add to the chilled chicken and vegetables. Pour the dressing over the salad and toss to combine. Serve.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/06\/apple-sprouts-salad.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/apple-sprouts-salad-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/apple-sprouts-salad-300x300.jpg","main-ingredient":["sprouts","fruits"],"author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Salad Recipes"],"tags":["salad"]}