{"id":32,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/27\/sambhar-thick-lentil-soup-with-mixed-vegetables\/","title":"Sambhar - Thick Lentil Soup with Mixed Vegetables","content":"\r\n\r\nDr.Gurusamy of Gluttony is no Sin got me on his Capsicum Sambhar. Its a typical South Indian thick lentil soup and is a delight to have steaming hot sambhar on a cold winter day. Thank you, Doc, for sharing your recipe. I have added carrots, tomatoes, baby onions and a dash of jaggery in addition to the ingredients provided in Doc's recipe. Tastes good.\r\n\r\nThe lentil used is split red gram (called kandi pappu in telugu, tur dal in hindi) and the vegetables used are carrot, baby onions, tomato and capsicum.\r\n\r\nIngredients:\r\n1 cup tur dal (split red gram, kandi pappu) - washed and boiled till soft or pressure cooked\r\n1 chopped large tomato\r\n5-6 baby onions (peeled)\r\n1 big capsicum( chopped into 2\" pieces)\r\n1 carrot (chopped into 2\" pieces)\r\n3-4 slit green chillis\r\n2 tsp sambhar pwd\r\n1 tsp curry masala pwd (2 tbsp corainder seeds, 1 tbsp channa dal, 6-8 whole dry red chillis, 1 tbsp poppy seeds and 2 tbsps grated coconut - dry roast and grind to a coarse pwd) - store the left over curry masala pwd in the fridge\r\n2 tbsp tamarind paste (or big lemon sized tamarind pulp soaked in warm water to remove the extract)\r\n1 tsp grated jaggery or sugar (optional and not mentioned in Doc's recipe)\r\nsalt\r\n\r\n\r\n\r\nFor tempering\/popu\/talimpu\/tadka:\r\n\r\n1\/2 tsp mustard seeds (aavalu, ria)\r\n10 curry leaves\r\n1\/2 tsp fenugreek seeds (methi seeds, menthulu)\r\n1\/4 tsp asafoetida (inguva, hing)\r\n1 whole dry red chilli (de-seed and tear into pieces)\r\n\r\nMethod:\r\nHeat 1 tbsp oil in a wok or cooking dish.Add mustard seeds and let them splutter.\r\nNow add the fenugreek seeds,curry leaves,dry red chilli and asafoetida and fry for 10-15 seconds or till fenugreek seeds brown.Dont burn it.\r\nNow add all the veggies (baby onions,capsicums,carrots and tomatoes) and green chillis and stir fry for 3 minutes.\r\n\r\n\r\n\r\nNow add the pressure cooked tur dal along with 2 cups of water and mix well till it blends with the veggies. Bring it to boil and let it cook for 7-8 minutes.\r\nNow add the tamarind paste along with one cup of water and mix well.Cook till rawness of tamarind disappears.\r\n\r\n\r\n\r\nAdd salt, sambhar pwd and curry masala pwd and mix well. Let it cook for 10-12 minutes.\r\nI like to add some jaggery or sugar. But its according to individual taste and optional.\r\nGarnish with chopped coriander leaves and sambhar is ready.\r\n\r\nSambhar can be had as a steaming hot thick soup. Generally served with idlis\/dosas\/vadas and rice. Tonight we are having sambhar with idlis (steamed rice cakes).\r\n\r\nThank you Doc for sharing your recipe..:)","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2005\/11\/sambar.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sambar-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sambar-300x300.jpg","style":["easy","traditional"],"course":["side","soup"],"special-diet":["nut free","eggless","vegetarian","vegan","healthy","kid friendly","pregnancy","dairy free"],"cuisine":["south indian"],"cook-time":"45","prep-time":"15","main-ingredient":["tur dal","tamarind","vegetables","capsicum"],"goes-well-with":["rice","idli","dosa","tiffin"],"author":null,"type":"post","categories":["All Recipes","Indian Dal Recipes","Indian Soup Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"],"tags":["sambar","vegetables"]}