{"id":331,"permalink":"http:\/\/www.sailusfood.com\/2006\/11\/04\/pepper-chicken-curry\/","title":"Pepper Chicken Curry ","content":"Another one of our family favorite chicken curry that I regularly prepare is a pepper chicken curry which is a simple, straight forward recipe with all the basic ingredients that go into making a normal chicken curry and yet tastes quite different from the routine simple chicken curry flavor.\r\n\r\n \r\n\r\nThis recipe calls for freshly ground pepper powder and fennel seeds (saunf) powder which enhances the flavor of the curry tremendously. The spice of the pepper chicken curry comes from fresh green chillis and freshly ground pepper powder. This curry goes well with both white rice, biryani and rotis. It makes a great curry with dosas\/vadas too.\r\n\r\n\r\nPepper Chicken Curry Recipe\r\nRecipe source: From my recipe files\r\nPrep & Cooking Time: 35-40 mts\r\nServes 5-6 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg chicken, washed and cut into medium sized pieces\r\n\r\n2 large onions finely chopped\r\n\r\n1 tbsp ginger-garlic paste \r\n\r\n3-4 green chillis slit length wise\r\n\r\n1 large tomato finely chopped \r\n\r\n1\/2 tsp turmeric powder \r\n\r\n1 tbsp coriander powder \r\n\r\n1 tsp freshly ground fennel seeds pwd (saunf)\r\n\r\n3\/4 tsp to 1 tsp freshly ground pepper pwd (add according to your spice level)\r\n\r\n1 tsp garam masala (1\" dalchini, 1 green cardamom, 4 cloves finely ground)\r\n\r\nfresh coriander leaves for garnish\r\n\r\nsalt \r\n\r\n1 1\/2 tbsp-2 tbsp oil \r\n\r\n1 Heat oil in a cooking vessel, add the onions and saute till pink. Add the green chillis, ginger-garlic paste and saute further for another 4-5 mts on medium heat.\r\n2 Add the cleaned chicken pieces and cook on high heat for 4-5  mts, combining once in a while.\r\n3 Add the turmeric pwd, coriander pwd, fennel seed pwd, pepper pwd and salt, combine well. \r\n 4 Reduce heat to medium, cook covered for another 4-5 mts.\r\n5 Add the chopped tomatoes and let it cook for 3-4 minutes without cover. Combine well and cook till oil separates. \r\n6 Let the chicken cook in its own water, covered for 4-5 mts. Add half a cup of water and cook covered for another 4-5 mts or till you get the desired gravy consistency.\r\n7 Finally add the garam masala pwd, combine well and garnish with fresh coriander leaves.\r\n8 Serve hot with white steamed rice or chapatis.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/chicken_curry_chapati.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken_curry_chapati-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken_curry_chapati-300x300.jpg","main-ingredient":["chicken"],"author":null,"type":"post","categories":["All Recipes","Indian Chicken Recipes","Indian Curry Recipes","Indian Non-Vegetarian Recipes","South Indian Recipes"]}