{"id":334,"permalink":"http:\/\/www.sailusfood.com\/2006\/12\/05\/rice-ravva-upma\/","title":"Rice Ravva Upma ","content":"I have been experiencing some serious server issues with regard to my blog these past few days. Much to my relief, it has been resolved and the site is up and running. I thank my visitors and blog friends for the concerned enquiries and patience. \r\n\r\n\r\n\r\nToday I'm blogging a very simple, wholesome, healthy tiffin recipe which can be made in a jiffy and can be eaten for breakfast, brunch or dinner as it makes a complete meal by itself. Made from coarsely ground rice, rice ravva (biyyam ravva\/uppudu pindi), this recipe can be prepared with vegetables like carrots, potatoes, beans, green peas, onions and even chick peas. The traditional tiffin, upma, is usually prepared from semolina or cream of wheat but then upma is so versatile that it  can be prepared with broken wheat, coarsely ground rice ravva, bread, vermicilli, sago, beaten rice flakes, oats, couscous and even pasta. \r\n\r\nNeed to prepare dinner in less than 30 minutes? Don't have any veggies in your refrigerator, don't worry. Rice ravva upma can be prepared without vegetables too. All you need are spices like mustard seeds, cumin, bengal gram, black gram dal, green chillis, ginger, rice, salt and water to prepare it.  \r\n\r\nLoaded with vegetables or without them, upma tastes great with just the seasoning of spices and its flavor is greatly enhanced with the use of curry leaves and ghee (clarified butter). What I love about ravva upma is its simplicity and great taste. I'm surprised that many fringe at the thought of eating upma. I, for one enjoy a hearty tiffin like upma which can be served with pickle\/chutney of your choice or with just a dash of lime.\r\n\r\n\r\n\r\nRice Ravva Upma Recipe\r\nPrep & Cooking Time: 20-30 mts\r\nServes 6-8 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups rice ravva\r\n\r\n1 finely sliced onion\r\n\r\n3-4 slit green chillis\r\n\r\n1\" ginger finely chopped\r\n\r\n1 cup chopped vegetables (carrots, beans, peas, cauliflower and potatoes)\r\n\r\n1 1\/2 tbsp ghee\r\n\r\n8-10 cashewnuts or roasted peanuts(optional)\r\n\r\n5 cups water\r\n\r\nsalt \r\n\r\n1 tbsp lemon juice (optional)\r\n\r\nFor seasoning:\r\n\r\n1 tsp mustard seeds\r\n\r\n1 tsp cumin seeds\r\n\r\n1 tbsp bengal gram\r\n\r\n1 tbsp black gram dal\r\n\r\n2 dry red chillies (optional)\r\n\r\n1 sprig curry leaves\r\n\r\n\r\n\r\n1 Heat oil or ghee in a cooking vessel, add the mustard seeds and let them splutter. Add the cumin, bengal gram, black gram, cashewnuts and curry leaves and saute them till the dals turn slightly brown and a nice aroma emanates the kitchen.\r\n2 Add the sliced onions, green chillis and ginger and saute for 2 mts.\r\n3 Add the chopped vegetables and saute on medium heat for 2-3 mts. Add salt and water and bring to a boil and let the vegetables cook in the water for 3-4 mts before adding the rice ravva. \r\n4 Now, reduce heat and slowly add the rice ravva to the water and mix it continuously so that lumps don't form and it combines well with the water.\r\n5 Combine well till it forms a gooey paste.\r\n6 Reduce heat and cover with lid and let it cook for 10-12 mts. Turn off heat and mix in the lemon juice.\r\n7 Serve hot with chutney or pickle of your choice\r\nNote: You can use oil instead of ghee. Rice ravva upma requires more water to cook than semolina upma and the ratio is 1:2 1\/2, i.e 1 cup rice ravva requires 2 1\/2 cups of water to cook. For a more gooey paste add more water. You need to use some pressure while mixing the upma as it forms a hard lump unlike semolina upma which is more soft and easy to combine. Traditional semolina upma doesnt call for the use of cumin seeds but rice ravva upma tastes good with cumin, so don't omit cumin. You can also use asafoetida (hing\/inguva) during tempering process. For more variation, garnish with grated coconut and coriander leaves. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/biyam_ravva_upma_ingredients.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/biyam_ravva_upma_ingredients-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/biyam_ravva_upma_ingredients-300x300.jpg","main-ingredient":["rice rava"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"]}