{"id":3355,"permalink":"http:\/\/www.sailusfood.com\/2009\/06\/27\/vegetable-fried-rice\/","title":"Vegetable Fried Rice","content":"One of the loveliest pleasures of life is vegetable shopping especially at the farmer's market. I enjoy it immensely. I needed to use up a few vegetables before I made my trip to the rythu bazaar, so I decided to put them to good use for an Indo Chinese inspired vegetarian meal. Does involve a bit of knife work but its worth the effort to savor the beautiful combination of flavors especially when you have good company to enjoy the meal with. Satish's friends had joined us for a fun filled afternoon ~ it was food and laughter all the way. :)  \r\n\r\nBelow are the images of the four dishes that I prepared. I had blogged Vegetable Noodles recipe earlier. Today, I'm blogging Vegetable fried rice recipe. The other two recipes will follow soon. \r\n\r\n&nbsp;Vegetable Fried Rice & Vegetable Noodles\r\n&nbsp;Paneer Vegetables & Vegetables in ginger garlic sauce and sesame seeds\r\n\r\n\r\nThe vegetable fried rice I prepare is simple with minimal ingredients. I do not add soy sauce which imparts a dark color to the rice. Do use capsicums as it enhances the over all flavor.\r\n\r\nVegetable Fried Rice Recipe\r\nPrep & Cooking Time: 30 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n4 cups of cooked (cold) rice \r\n\r\n2 spring onions, finely chopped\r\n\r\nfistful of chopped capsicum\r\n\r\n1 cup finely chopped vegetables (carrots, cabbage and beans) par boiled for 2 mts\r\n\r\n3\/4 tbsp vinegar\r\n\r\nfine black pepper pwd as required\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsps sesame oil or peanut oil\r\n\r\n\r\n\r\n1 Heat sesame oil in a large wok and once the oil is piping hot, add the spring onion whites and stir fry for 1 mt on high.\r\n2 Add the rest of the vegetables and toss them on high heat for 3-4 mts.\r\n3 Add salt and pepper pwd combine. Cook on high for a mt. Add the cooked cold rice and combine well. Spread it all over the pan and leave on medium high for a mt. Combine again, spread out and leave on medium high for another mt. \r\n4 Add vinegar and toss all the contents on high heat for a 30 secs. Turn off flame. Garnish with chopped spring onion greens and serve hot.\r\n\r\nVegetable Fried Rice\r\n\r\nNote: Finely minced garlic is an optional ingredient. Fry the garlic till well toasted followed by spring onions and follow the rest of the recipe. Try to use freshly ground black pepper. Always use cold rice or rice that has been cooked the previous night.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/06\/vegetable-fried-rice1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable-fried-rice1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable-fried-rice1-300x300.jpg","main-ingredient":["carrots","beans"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Rice recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["fried-rice","vegan_recipe","vegetables"]}