{"id":338,"permalink":"http:\/\/www.sailusfood.com\/2006\/12\/12\/gutti-beerakaaya-kura-stuffed-ridge-gourd-curry\/","title":"Gutti Beerakaaya Kura - Stuffed Ridge Gourd Curry","content":"Dishes made with stuffed vegetables like brinjals, bitter gourd, lady's finger, ivy gourd and ridge gourd, tomatoes, bell peppers are common in Indian cuisine, especially down South and in particular Andhra. Gutti Vankaya Kura (stuffed egg-plants curry) is a classic example of a stuffed vegetable curry that is an Andhra speciality. Today, I prepared a stuffed curry using ridge gourd, a recipe which I first tasted at a friend's place which had a wonderful lightly sweet, mildly spiced, tangy flavor. \r\n\r\n\r\nRidge gourd is a vegetable which is cooked by us Andhras usually as a pachadi, stir fry (vepudu), cooked in milk (Beerakaya Paalu Posina Kura), with lentils (Beerakaya Pappu, another classic Andhra dish) or cooked with prawns\/eggs. \r\n\r\nBeerakaya when prepared as a stuffed vegetable with a zesty filling made from spices like sesame seeds, coriander seeds, cumin seeds and red chillis that are roasted and ground to a fine paste along with ginger, garlic, onions and tamarind, has a mingling of flavors :- sweet-spicy-tangy. A delicious stuffed curry that goes well with both rice and rotis!\r\n \r\n\r\n\r\nGutti Beerakaya Kura Recipe\r\nRecipe Source: Subha, a close friend\r\nPrep & Cooking: 45 mts \r\nServes: 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 kg ridge gourds (beerakaaya), peeled, cut into 2 inch pieces and make a + slit on top for stuffing\r\n\r\n2 medium onions, sliced\r\n\r\n4-5 dry red chillis, de-seeded\r\n\r\n1 tbsp ginger-garlic paste\r\n\r\n1 tbsp coriander seeds\r\n\r\n1 tsp cumin seeds\r\n\r\n3 tbsps sesame seeds (nuvvulu)\r\n\r\n1 tbsp grated jaggery (optional)\r\n\r\nsalt to taste \r\n\r\nsmall lemon sized tamarind ball\r\n\r\n1 tbsp oil \r\n\r\n\r\n\r\n1 Heat a tsp of oil in a frying pan and add the coriander seeds, cumin seeds, red chillis and sesame seeds and fry on medium heat till you get a nice aroma. Dont burn the spices. Just fry for 3-4 mts stirring continously. Remove and cool.\r\n2 Once cool, make a paste of the above spices along with ginger garlic paste, jaggery, tamarind, salt and onions. \r\n3 Take a tbsp of the paste and stuff each of the slit ridge gourd pieces. \r\n4 Heat oil in a pan and add some curry leaves and stir fry for a 3-4 seconds. Place the stuffed ridge gourds in the pan and let it cook covered on medium heat. \r\n5 After 4-5 mts, uncover the lid and turn the pieces so that they cook all over.\r\n6 Cover and cook on low heat till the ridge gourds become soft. This could take about 20 minutes. \r\n7 Turn off heat once cooked and serve with hot white steamed rice.\r\n\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/masala_paste_ingredients.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masala_paste_ingredients-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masala_paste_ingredients-300x300.jpg","main-ingredient":["ridge gourd"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["curry","gutti-beerakaya","stuffed-ridgegourd"]}