{"id":34,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/29\/gulab-jamuns-traditional-indian-milk-mithai\/","title":"Gulab Jamun - Traditional Indian Milk Based Mithai","content":"\r\n\r\nToday's sweet is the delicious Gulab Jamun, an absolutely melt-in-the-mouth favorite Indian dessert and is a living embodiment of Indian methai (sweet) tradition. Gulab Jamuns are golden brown balls in flavored sugar syrup. They are served warm or at room temperature.\r\n\r\nThe main ingredient in most Indian sweets is 'khoya' (hindi)\/koova (telugu) which is a thickened form of milk and forms a base in most creamy sweets like Gulab Jamun. Gulab Jamoonn is basically a sweet from North India and is a sweet that one enjoys relishing hot during winters.\r\n\r\nHow to make the gulab jamun:\r\n\r\n1 cup khoya (kovva) can be prepared by boiling and continuously stirring one liter of milk on medium heat till it form a thick paste\r\n3\/4 cup maida (all purpose flour)\r\n1\/4 tsp cooking soda (soda bi carbonate)\r\nenough ghee (clarified butter) for deep frying the jamuns\r\n3 tbsps prepared sugar syrup (warm)\r\n1-2 tbsps of warm milk (not hot)\r\n\r\n\r\n\r\nIngredients to prepare Gulab Jamun sugar syrup:\r\n\r\n2 cups water\r\n2 cups sugar\r\n3-4 crushed cardomoms (optional)\r\n\r\nPreparation of Sugar Syrup\r\n\r\nThe syrup should be made earlier and kept warm.To make the sugar syrup, mix 2 cups of sugar with 2 cups of water in a deep cooking dish. Add 3-4 cardamom pods, slightly crushed. Stir constantly with a spoon on medium heat for 15-18 minutes until sugar is all dissolved in water. Do not overheat..as the sugar might caramelize. Transfer this hot syrup into a serving dish. Keep warm on stove.\r\n\r\n\r\n\r\nSieve the flour (maida). Add the khoya and baking powder to the flour (maida) and mix well. It should appear like bread crumbs.\r\n\r\n\r\n\r\nNow add 3 tbsps sugar syrup and 1-2 tbsps of milk (warm but not hot milk) to make a soft dough. The milk can be adjusted to form a soft dough. Keep aside for half an hour. After half an hour knead it again and make balls by gently rolling each portion between your palms into a smooth ball. You can shape into small balls or longitudinal shapes. Place the balls on a plate and keep aside.\r\n\r\n\r\n\r\nHeat the ghee in a deep frying dish to medium heat. Drop a small piece of dough in the ghee and if it sizzles and surfaces to the top of the ghee, the ghee is ready for deep frying. TURN OFF FLAME. Slowly slip in the gulab jamuns into the hot ghee and allow them to surface to the top of the ghee. Once they surface to the top, turn on flame to low and deep fry stirring constantly. Do not increase the flame.  \r\n\r\n\r\n\r\nThe Jamuns must be gently and constantly stirred to ensure even browning on all sides. Keep turning the Jamuns until they are a golden brown all over.\r\n\r\nIf the temperature of the ghee is too high then the Gulab Jamuns might break. The temperature should be adjusted to ensure that the Gulab Jamuns do not break or cook too quickly. The balls must be fried slowly under low temperature. This will ensure complete cooking from inside and even browning.\r\n\r\n\r\n\r\nAdd the fried Gulab Jamuns directly into the warm syrup. They can be served warm or at room temperature.\r\n\r\n\r\n\r\nGulab jamuns can also be served with ice cream or kulfi.","style":["traditional"],"course":["dessert"],"special-diet":["nut free","eggless","dairy","vegetarian","kid friendly"],"cuisine":["north indian"],"cook-time":"90","prep-time":"30","main-ingredient":["maida","all purpose flour","sugar","khoya","milk"],"serves":"10","goes-well-with":["ice cream","kulfi","fresh cream"],"author":null,"type":"post","categories":["All Recipes","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["gulab-jamun","khoya","kova"]}