{"id":340,"permalink":"http:\/\/www.sailusfood.com\/2006\/12\/22\/tiffin-treats-chicken-noodles-with-peanuts\/","title":"Tiffin Treats - Chicken Noodles with Peanuts","content":"A few of my blog visitors have sent me e-mails requesting me to blog some tiffin recipes for children that are healthy and quick to prepare. I am always on the look out for tiffin recipes\/ideas and keep trying new recipes, as I have a 4 year old and need to pack his tiffin box to school and also prepare a tiffin for his evening snack. It's quite challenging to come up with different recipes each day that are quick-to-fix, filling and provide good nutrition and I try my best to get him to eat different kinds of foods which include vegetables. Its not an easy task, believe me.  \r\n\r\n\r\n\r\nMy son, Nehal, is very fond of noodles and wants to have them almost every other day as his evening tiffin. I try out different variations so that he doesnt get too bored of the mundane every day noodles. And its a way for me to get him to eat his portion of vegetables, chicken and eggs. Of course not to forget that its easy to prepare, filling and nutritious, as chicken\/eggs and veggies are packed into it.\r\n\r\nI tried out a chicken noodles recipe, a pleasant change from the usual, marinating chicken juliennes in a dressing of honey, lemon juice, peanut butter and soya sauce. My son just loved the flavor and I was only too happy to serve him more..:). Peanuts gave that crunch, tangy flavor from the lemon juice, a slight hint of sweetness from honey and garlic gave that extra zest to this otherwise standard chicken noodle recipe. \r\nChicken Noodles With Peanuts Recipe\r\nPrep & Cooking Time: 20 mts Marination - 40 mts\r\nServes 5-6 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1 packet egg noodles (boiled, drained in cold water and tossed in a tsp of oil)\r\n\r\n1 tbsp finely chopped garlic cloves\r\n\r\n2-3 green chillis slit length wise\r\n\r\n1\/2 cup spring onions finely sliced\r\n\r\n1 large capsicum juliennes (cut into thin strips)\r\n\r\n1 tbsp soya sauce\r\n\r\n2-3 tbsps coarsely powdered roasted peanuts\r\n\r\nsalt as required\r\n\r\n2-3 tbsps sesame oil or peanut oil\r\n\r\nDressing to marinate chicken:\r\n\r\n150-200 gms boneless chicken, julienne\r\n\r\n1\/2 tbsp soya sauce\r\n\r\n2 tbsps crunchy peanut butter\r\n\r\n1 tbsp honey \r\n\r\n2 tbsp lemon juice (or vinegar)\r\n\r\n1 tsp cornflour\r\n\r\n\r\n\r\n1 Marinate the chicken juliennes in the dressing, cover and refrigerate for a minimum of 40 mts to an hour.\r\n2 Heat a tbsp of sesame oil in a large wok and once the oil is piping hot, add the marinated chicken and stir fry for two minutes.\r\n3 Reduce to medium heat and cook the chicken for another 10-12 mts or till the chicken juliennes are cooked. Remove and keep aside.\r\n4 Clean the wok and add another tbsp of oil and once it piping hot, add garlic pieces and stir fry for a few seconds. Add the green chillis and onions and stir fry till the oil coats the pieces well for about a minute or two. Keep stirring constantly lest it burns.\r\n5 Add the capsicum juliennes and fry for another mt.\r\n6 Next add the soya sauce and the cooked chicken and combine. Stir fry for a minute.\r\n7 Now add the drained noodles and combine well. Finally add the powdered roasted peanuts and toss to coat. Serve hot.\r\n\r\nNote: You can add carrots, beans, green peas and scrambled eggs for variation.\r\n\r\nYou can also check the following sites for more wonderful and interesting tiffin and lunch box meals\/ideas.\r\n\r\nhttp:\/\/dailytiffin.blogspot.com\r\nhttp:\/\/saffrontrail.blogspot.com\r\nhttp:\/\/aayisrecipes.com\r\nhttp:\/\/laptoplunches.com\r\nhttp:\/\/tiffintin.net\r\n\r\nDo you have any tiffin\/snack recipes or lunch box ideas  that you would like to share for the benefit of those looking out for simple, filling and nutritious recipes? Those of you who don't blog but would love to share your lunch box ideas\/recipes, it would be nice if you can send your recipes to sailusfood@gmail.com (try to send pictures too). I want to dedicate a page to tiffins, snacks, lunch-box meals for children that will serve as a helpful resource. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/chicken_noodles_garlic_peanuts.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken_noodles_garlic_peanuts-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken_noodles_garlic_peanuts-300x300.jpg","main-ingredient":["noodles","chicken"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Chinese Recipes","Indian Non-Vegetarian Recipes","Lunch Box Recipes"]}