{"id":3405,"permalink":"http:\/\/www.sailusfood.com\/2009\/07\/27\/pressure-cooker-mutton-biryani\/","title":"Pressure Cooker Mutton Biryani","content":"If I've been MIA, its because I am delighting myself with my 22 month old nephew (visiting India) and reliving Nehal's toddlerhood days. Busy fun days. :)\r\n\r\nQuick Mutton Biryani\r\n\r\nA quick special one pot meal for one of those busy days is this particular biryani. Simple preparation, not at all complicated and can be made in less than an hour. I would frown upon any biryani recipe that didn't call for 'dum'. Even more so on 'pressure cooker' biryani. I would refuse to try any other method thinking it was blasphemous. How wrong I was? This particular biryani which is cooked in a pressure cooker is not an authentic style Hyderabadi biryani. It tastes good the day you prepare it and even better the next day. \r\n\r\nPressure Cooker Mutton Biryani\r\n\r\nPressure Cooker Mutton Biryani Recipe\r\nPrep & Cooking: 50 mts to 1 hr\r\nServes 4-5 persons\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups Basmati rice\r\n\r\n1\/2 kg mutton, washed and drained\r\n\r\n1 cup thick buttermilk\r\n\r\n3 cups water\r\n\r\n2 cloves, 1 elachi, 1\/2\" cinnamon stick, 1 marathi moggu\r\n\r\n1-2 bay leaves\r\n\r\n2 onions, finely sliced\r\n\r\n3\/4 tsp ginger garlic paste\r\n\r\n1 large tomato finely chopped\r\n\r\n1 tsp red chilli pwd (adjust)\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1 tsp coriander pwd\r\n\r\nvery small pinch of nutmeg pwd\r\n\r\nlittle less than 1\/4 cup chopped coriander leaves\r\n\r\n1\/4 cup pudina leaves\r\n\r\nsalt to taste\r\n\r\n3 tbsps ghee + 1 tbsp oil\r\n\r\nBiryani masala, make pwd:\r\n\r\n3 cloves\r\n\r\n1\" cinnamon stick\r\n\r\n1 elaichi\r\n\r\npinch of shah jeera\r\n\r\npinch of jeera\/cumin seeds\r\n\r\nsmall piece of japathri\/mace\r\n\r\n1\/2 anaasa puvvu\/star anise\r\n\r\nFor marinade:\r\n\r\njuice of half lemon\r\n\r\n1 1\/2 tbsps curd\r\n\r\n1\/2 tsp salt\r\n\r\n1\/2 tsp ginger garlic paste\r\n\r\n3-4 whole green chillis without stalks\r\n\r\n1\/4 tsp red chilli pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\nfew mint leaves\r\n\r\n\r\n\r\n1 Marinate the mutton with the ingredients called for 'marinade'. Keep aside for 20 mts. While the mutton is marinating, work on the rest of the preparation.\r\n\r\n1. Wash Basmati rice. No need to soak in water\r\n2. Slice onions\r\n3. Chop tomato\r\n4. Pick pudina leaves and chop the coriander leaves\r\n5. Prepare biryani masala pwd\r\n6. Beat curd to form thick buttermilk\r\n\r\n2 Heat 1 tbsp oil + 2 tbsps ghee in a pressure cooker vessel, add the bay leaves, cloves, cinnamon, marathi mogga, elaichi and saute for a few secs. Add sliced onions, saute for 7-8 mts. Add the ginger garlic paste and coriander-pudina leaves and saute further for another 5 mts. \r\n2 Add turmeric pwd and red chilli pwd, saute for another 2 mts. Add the chopped tomatoes and saute for 3-4 mts. Add the marinated mutton along with 1 cup of water and bring to a boil. Pressure cook mutton till it is almost cooked, upto 3 whistles. Turn off heat and cool. Remove lid and you will find that it will appear like a thick gravy. If the gravy appears very watery, cook further without lid till it forms a thick gravy.\r\n3 Turn on the heat again, add 3 cups of water and 1 cup of thick buttermilk. Add the biryani masala and nutmeg pwd. Add salt (remember we have added 1\/2 tsp of salt to the mutton marinade, so add salt accordingly). Add the drained basmati rice and combine. Pressure cook upto 2 whistles and turn off heat. Once pressure is off, remove lid, pour a tbsp of ghee and combine carefully. Serve hot with raita.\r\n\r\n\r\n\r\nNote: You can alternately cook the biryani in a rice cooker. After the mutton is cooked in a pressure cooker, remove the contents to a rice cooker and follow the rest of the above procedure. You can follow the same recipe using chicken instead of mutton. If using chicken, add 1\/2 cup water instead of 1 cup and cook up to 2 whistles while preparing the gravy otherwise the chicken will become mushy.\r\n\r\nUpdate on Taste of India: TOI is going through a testing phase and is not up officially. We are testing few feeds at a time. Once we are through with the testing, I will announce the re-launch date of TOI. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/07\/pressure-cooker-biryani.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pressure-cooker-biryani-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pressure-cooker-biryani-300x300.jpg","main-ingredient":["mutton"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes","Indian Rice recipes"],"tags":["biryani","mutton"]}