{"id":3406,"permalink":"http:\/\/www.sailusfood.com\/2009\/07\/06\/gutti-vankaya-stuffed-eggplant-roast\/","title":"Gutti Vankaya ~ Stuffed Eggplant Roast","content":"Its July and its raining. Overcast skies and drizzles have made their appearance in Vizag. Monsoon that has been long overdue has finally arrived and hopefully we will have good rains this year. On many a rain-filled day you will find me serving hot chocolate to Nehal while we adults enjoy a hot cuppa of coffee, sitting by our verandah, enjoying the cool breeze, smelling the scent of wet earth and watch our garden welcome the shower of pitter patter rain drops. In other words, enjoying the monsoon season.:)\r\n\r\nStuffed Eggplant Roast\r\n\r\nLast week, I made this perfect 'changing season' dish, a dry saute version of the classic Gutti Vankaya Kura. I adore this stuffed eggplant roast. As you bite into the stuffed brinjal, you taste a burst of sweet, spicy and sweet flavors. Simply irresistible! \r\n\r\nGutti Vankaya Recipe\r\nPrep & Cooking: 1 hr\r\nServes: 3-4\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg purple brinjals, wash, make + quarters with stalk intact\r\n\r\nsmall lemon sized tamarind, extract pulp\r\n\r\n1 1\/4 tbsps oil\r\n\r\nFor stuffing:\r\n\r\n1 large onion, sliced\r\n\r\n4-5 garlic cloves\r\n\r\n1\" cinnamon stick\r\n\r\n1 tsp red chilli pwd\r\n\r\n1 tsp coriander pwd\r\n\r\n1 1\/2 tsps ghee or soft butter\r\n\r\n1\/2 - 1 tbsp grated jaggery or sugar (adjust)\r\n\r\nsalt to taste\r\n\r\nFor poppu\/tadka\/seasoning:\r\n\r\n1\/4 tsp methi seeds\r\n\r\na sprig of curry leaves\r\n\r\n\r\n\r\n1 Add 1 tsp oil in a cooking vessel, add garlic and cinnamon stick and saute for a few seconds. Add the sliced onions and saute till rawness disappears. Approx 4-5 mts. Keep aside to cool.\r\n2 Once cool, make a coarse paste. Remove the paste into bowl, add salt to taste, red chilli pwd, jaggery, coriander pwd and ghee. Combine well and stuff the brinjals with this paste. \r\n2 Add the remaining oil in a vessel, add curry leaves and toss them for a few seconds. Add the methi seeds and let them turn brown. Place the stuffed brinjals in the oil and cook on medium high flame for 2 mts. Now, cover with lid and let them cook on medium low flame for 12-14 mts. Keep checking in between and stir fry to ensure they don't burn or stick to the pan. \r\n3 Add the tamarind extract along with a cup of water. Bring to a boil and reduce flame and place lid and cook over low flame for 13-15 mts. The water content should reduce. \r\nRemove lid and cook over low flame and let the brinjals roast well and it appears like a dry saute (mudda kura). It should take about 8-10 mts for the brinjals to be well roasted. Turn off heat.\r\n4 Serve with rice, pappu pulusu or sambar.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/06\/stuffed-brinjal-roast.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/stuffed-brinjal-roast-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/stuffed-brinjal-roast-300x300.jpg","main-ingredient":["eggplant"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["brinjal","stir_fry","vankaya","vegan_recipe","vegetables"]}