{"id":341,"permalink":"http:\/\/www.sailusfood.com\/2007\/01\/05\/bobbarlu-vadalu-black-eyed-peas-lobia-fritters\/","title":"Bobbarlu Vadalu - Black eyed Peas (Lobia) Fritters","content":"I had bought some bobbarlu from the rythu bazaar last week and prepared a snack with these black eyed peas, today. Bobbarlu, alasandalu, lobia, vella payuru, karamani - the names by which cow pea\/white kidney bean\/black eyed pea is known in different parts of India is packed with a lot of protein, dietary fibre and nutrition.\r\n\r\nbobbarlu, lobia, blackeye peas\r\n\r\nBobbarlu vadalu are a savory deep fried snack popular in Andhra. It's a very down-to-earth recipe, that is appetising at sight, tasty and simple to prepare. Its prepared as a evening tiffin\/snack at our home, for my 4 year old. Usually chopped onions, ginger, green chillis and coriander leaves are used to prepare the traditional bobbarlu vadalu, but today I added some grated coconut and carrots for variation and to provide more nutrition. Serve hot to savor the crunchy vadalu.\r\n\r\nBobbarlu Vadalu Recipe\r\nPrep & Cooking: 20-30 mts, soaking: 4-6 hours\r\nMakes 25-30 vadalu\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup bobbarlu (soaked in water for 4-6 hours,drained\r\n\r\n2-3 tbsps cup grated coconut (optional)\r\n\r\n1\/4 cup grated carrots (optional)\r\n\r\n3\/4 cup finely chopped onions\r\n\r\n3-4 green chillis finely chopped\r\n\r\n2\" ginger finely minced\r\n\r\n1 tsp cumin seeds (optional)\r\n\r\n1 small bunch coriander leaves finely chopped\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Grind the soaked and drained black eyed peas to a coarse paste adding very little water. Add the chopped onions, grated carrot, coconut, green chillis, ginger, coriander leaves, cumin seeds and salt and mix well.\r\n\r\n2 Take some of this mixture to form a lemon sized ball. Flatten it on your palm to make a patti shape. Prepare patties with the rest of the mixture.\r\n\r\n3 Heat oil for deep frying. Once its piping hot, reduce flame to medium and place these patties in the oil and fry them to a golden brown color.\r\n\r\n4Serve hot with tomato sauce or any chutney of your choice. \r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/bobbarlu_vadalu1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bobbarlu_vadalu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bobbarlu_vadalu1-300x300.jpg","main-ingredient":["black eyed peas"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Dal Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes"]}