{"id":3535,"permalink":"http:\/\/www.sailusfood.com\/2009\/08\/11\/vegetables-in-ginger-garlic-with-sesame-seeds\/","title":"Vegetables in Ginger-Garlic with Sesame seeds","content":"I have been wanting to blog this recipe ever since I posted the image of Vegetables in ginger garlic with sesame seeds in the previous Vegetable Fried Rice post. I somehow overlooked until a reader politely informed me that the recipe was long due.\r\n\r\nVegetables in ginger garlic with sesame seeds\r\n\r\nI followed Nita Mehta's recipe with few changes. A nutrition-rich, colorful mixed vegetable dish with a wonderful combination of flavors and amazing texture. The addition of sesame seeds gives it a delicious nutty taste and goes great with noodles or fried rice.\r\n\r\nVegetables in Ginger-Garlic with Sesame seeds Recipe\r\nPrep & Cooking Time: 35-40 mts\r\nServes 4 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1 tbsp crushed garlic\r\n\r\n1 tbsp ginger paste\r\n\r\n1\/4 cup spring onions, finely chopped\r\n\r\n1 onion, quartered\r\n\r\n2 1\/2 cups vegetables (baby corn, capsicum, beans, carrot, cabbage), chopped into bite sized pieces\r\n\r\n1 tsp light soya sauce \r\n\r\n2 tsps vinegar\r\n\r\n1\/2 tsp brown sugar\r\n\r\n2 tbsps tomato ketchup\r\n\r\n1\/2 tsp white pepper pwd\r\n\r\n1 1\/2 tbsp cornflour (mixed in 1 cup water)\r\n\r\nsalt to taste\r\n\r\n1 tbsp toasted sesame seeds\/til\r\n\r\n1 1\/2 tbsps sesame oil or peanut oil\r\n\r\n\r\n\r\n1 Par boil carrots, beans, baby corn in 3 cups of boiling water and pinch of salt for 3 mts. Turn off heat, strain and cool.\r\n2 Heat a tbsp of sesame oil in a large wok, once the oil is piping hot, add half of the crushed garlic and ginger paste and stir fry for a few secs.\r\n3 Add the chopped spring onion whites and stir for half a mt. Add the par boiled as well as the rest of the other vegetables and stir fry on high for 4-5 mts, constantly tossing them. Add salt and pepper to taste. Remove and keep aside.\r\n4 In the same wok, add 2 tsps of oil, add remaining crushed garlic and stir for a few secs. Add brown sugar, soy sauce, tomato ketchup and vinegar. Combine well.\r\n5 Add the cornflour mixture and cook stirring continuously till the sauce turns thick and turn off heat.\r\n6 At the time of serving, mix in the stir fried vegetables and garnish with toasted sesame seeds and spring onion greens. Serve hot with noodles or fried rice.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/07\/vegetables-ginger-garlic-sesame-seeds.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetables-ginger-garlic-sesame-seeds-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetables-ginger-garlic-sesame-seeds-300x300.jpg","main-ingredient":["carrots","beans"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["vegetables"]}