{"id":36,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/30\/kothimiri-annam-coriander-cilantro-rice\/","title":"Kothimira Annam - Coriander\/Cilantro Rice","content":"Kothimira Annam\r\n\r\nFresh coriander leaves are available in abundance especially during winters here in India. I am very fond of coriander (kothimera) and consider it as one of the versatile herbs and use it liberally in my cooking. Posting a healthy, tasty, Kothimeera Annam recipe which I make often during winters.\r\n\r\nHow to make Coriander\/Cilantro Rice\r\n\r\n2 cups rice, washed and soaked in water for half an hour and drained\r\nbig bunch of coriander leaves, washed and chopped\r\n4 green chillis\r\n4 tbsp grated fresh coconut\r\n1\" ginger piece\r\n6 garlic flakes\r\n2 chopped tomatoes\r\nwhole spices (6 cloves, 3 green cardamoms, 1\" pieces cinnamon-2, bay leaf)\r\nsalt\r\n2 tbsp ghee (clarified butter)\r\n\r\n\r\n\r\nHeat 2 tsps of oil in a cooking vessel, add the chopped coriander (kothimira) and green chillis and fry till rawness disappears approx 2-2 minutes. Remove from heat and cool.\r\nGrind the fried coriander and green chillis along with coconut, ginger and garlic to a  paste adding little water.\r\nHeat 2 tbsp of ghee (clarified butter) in a kadia or cooking vessel, add the whole spices and fry for a few seconds.\r\nAdd the ground coriander paste and fry for 3-4 minutes and then add the chopped tomatoes. Fry for 3-4 minutes.\r\n\r\n\r\n\r\nAdd the drained rice and mix well and fry for 2 minutes. Add salt.\r\n\r\n\r\n\r\nAdd 3 1\/2 cups of water and cook with lid on low to medium flame till rice turns soft. Garnish with fried cashew nuts (optional) and chopped coriander.\r\n\r\nServe Kothimeera annam hot with raita - perugu pachadi. Raita is a yogurt based salad made with chopped onions or cucumber, tomatoes,green chillis, salt and coriander leaves. It is generally served with all flavored rice dishes like biryani and pulao.","style":["easy","quick","modern"],"course":["meal"],"special-diet":["eggless","vegetarian","kid friendly","pregnancy","gluten\/wheat free","dairy"],"cuisine":["andhra"],"cook-time":"30","prep-time":"10","main-ingredient":["coriander leaves","rice"],"serves":"5","goes-well-with":["raita","curry"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Rice recipes","Indian Vegetarian Recipes"],"tags":["coriander","coriander-leaves","rice"]}