{"id":362,"permalink":"http:\/\/www.sailusfood.com\/2007\/01\/13\/chandra-kaantalu\/","title":"Chandra Kaantalu","content":"A treasured sweet dish, very dear to us Andhras, are these golden bewitching treats, Chandrakaantalu. Classified as pindivantalu (festive foods), these classic favorites are absolutely delicious making you crave for more even after you have had your fair share. I actually have to remove the serving plate from the table to keep us from finishing the whole batch of chandrakaantulu at one go..:)\r\n\r\nAlthough the ingredients are few and recipe sounds easy and simple, it does take some experience to prepare these melt-in-the-mouth temptations. It's here that Chandralekha Aunty came to my rescue and has been very kind to share this recipe and Chicken Masala Balls recipe and here I am blogging this fragrant tender sweetmeat.\r\n\r\nSplit yellow moong dal is ground to a fine paste and cooked along with sugar and fresh grated coconut to form a thick paste and mixed with cardamom powder, the flavor enhancer. The cooked thick lentil batter is quickly spread out on a wet cloth and cooled before being cut into the desired shape, diamond and square being the favorite. With a subtle cardamom flavor and a soft, tender chew, the raw squares taste good even before being deep fried and don't be surprised if you find that a few disappear even before they get to the deep-frying skillet..:)\r\n\r\nThese square delights while being deep-fried give the kitchen a really warm, sweet wholesome fragrance and emerge completely tender on the inside with a golden crisp crust. Those of you, new to this sweet, try them and you feel compelled to prepare them again and again.\r\n\r\n\r\n\r\nChandra Kaantalu Recipe\r\nRecipe Source: Chandralekha Aunty\r\nPrep & Cooking: 45 mts, Soaking: 1 hour\r\nMakes approx 25-30\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup split yellow moong dal\/pesara pappu\r\n\r\n1 1\/2 cup sugar\r\n\r\n1\/2 cup fresh grated coconut\r\n\r\n1\/4 cup chopped cashewnuts\r\n\r\n1 tsp cardamom powder\r\n\r\npinch of salt (optional)\r\n\r\noil for deep frying\r\n\r\n\r\n1 Soak moong dal for an hour, drain and grind to a fine paste adding a 3-4 tbsps of water. You can even grind it without adding any water.\r\n2 Heat a heavy bottomed vessel and add the sugar, the ground dal paste, grated coconut, cashewnuts and mix well. You will find that the sugar melts and the mixture begins to form bubbles while cooking. \r\n3 Cook this mixture on low heat, stirring continuously till it forms into a thick lump. Remove from heat and mix cardamom powder and pinch of salt.\r\n4 Immediately transfer the mixture on to a wet cloth and spread the  cooked mixture over it (like shown in the picture above). Using a flat laddle which has been oiled and gently spread the mixture to form 1\/2\" layer and cool.\r\n5 Cut into desired shape and separate the pieces very carefully lest they break and keep aside.\r\n6Heat oil in a wide heavy bottomed vessel and deep fry the squares  till golden brown. You can deep fry a batch of six to eight depending on the size of the vessel.   \r\n6Serve warm or cold. Store in an air tight container as they last for at least 4-5 days.\r\n\r\nNote:Ensure that you keep stirring the mixture as it cooks. Gently remove the raw squares from the wet cloth only when the spread out mixture has completely cooled down. \r\nWishing you all a very Happy Pongal!. May this festive season be filled with lots of traditional festive foods and the people dear to you! \r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/chandrakaantalu_before_deep_frying.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chandrakaantalu_before_deep_frying-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chandrakaantalu_before_deep_frying-300x300.jpg","main-ingredient":["moong dal","sugar"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Dal Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"]}