{"id":376,"permalink":"http:\/\/www.sailusfood.com\/2007\/01\/18\/vankaya-bataani-kura-brinjal-green-peas-curry\/","title":"Vankaya Bataani Kura - Brinjal-Green Peas Curry","content":"Each time I buy brinjals, I want to spin off a new dish, be it a variation of the classic stuffed brinjal, gutti vankaya kura or a basic stir fry. Come winter, when fresh green peas are abundantly available, I invariably prepare a simple delicious curry, Vankaya (brinjal) bataani (green peas). \r\n\r\nServed as a special dish in most marriage feasts, especially during the winter months, even the brinjal-hating folks will savor this universally appealing, subtly sweet-flavored gingery curry. Perfect for a warm winter meal, I have made this dish no less than half a dozen times this past month. Its versatility and flavor makes one wants to prepare it again and again as it goes with steamed rice and rotis or as a spread for sandwiches.\r\n\r\n\r\n\r\nUltimate in simplicity, this recipe calls for a few every day ingredients, with a liberal use of grated ginger and fresh coriander leaves for garnish. If you don't have ginger on hand, don't even venture to prepare this dish. Ginger is the main element here and remember that only white\/green brinjals work best for this recipe, with the freshest ingredients bringing out the best of this delicious everyday curry.\r\nVankaya Bataani Kura Recipe\r\nPrep & Cooking: 30-40 mts \r\nServes:5-6 persons \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 kg white brinjals, washed, cubed and soaked in water\r\n\r\n1 cup green peas\r\n\r\npinch of turmeric\r\n\r\nsalt to taste \r\n\r\n1 tsp mustard seeds\r\n\r\n1 tsp cumin seeds\r\n\r\n1 1\/2 tbsp finely grated ginger\r\n\r\n6-8 garlic cloves, slightly crushed\r\n\r\n2-3 dry red chillis, tear\r\n\r\n12-15 curry leaves\r\n\r\n3 medium onions, grated\r\n\r\n3-4 green chillis, crushed\r\n\r\n1 1\/2 tbsp oil \r\n\r\n\r\n\r\n1 Par-boil the cubed brinjals and green peas adding a little salt, turmeric powder and about a big cup of water. Strain any left over water once the vegetables are par-boiled. Discard the strained water if you feel the brinjals might be bitter.\r\n2 Heat oil in a cooking vessel and add the mustard seeds and let them splutter. Next add the cumin seeds, dry red chillis, curry leaves, garlic and ginger and toss them about for a few seconds.\r\n3 Now add the green chillis and onions and saute them till transparent.\r\n4 Add the par-boiled vegetables and salt, combine and cook uncovered for 5-7 mts on medium heat. Add a few tbsps of water, reduce heat and cook covered for another 12-15 mts or till the curry is done.\r\n6 Garnish with fresh coriander leaves and serve with hot chapatis or white steamed rice.\r\n\r\nNote: If you feel the brinjals might be bitter, discard the strained water in which the veggies are boiled.  ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/annam_vankaaya_battani_kura.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/annam_vankaaya_battani_kura-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/annam_vankaaya_battani_kura-300x300.jpg","main-ingredient":["brinjal","green peas"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}