{"id":379,"permalink":"http:\/\/www.sailusfood.com\/2007\/01\/22\/coconut-chicken-masala\/","title":"Coconut Chicken Masala","content":"The much awaited part of Sankranti is Kanuma, the third day of the festival, celebrated with a culinary feast replete with non-vegetarian favorites. On that day, recalling a recipe of my friend's mother, I whipped up a chicken dish  using coconut. I'm glad I prepared it, as it turned out beyond my expectations.\r\n\r\n\r\nThe only ingredient to be careful is with the use of fresh coconut, which can easily overwhelm the other flavors (if used more than the required quantity). This subtly sweet based chicken curry is quick to prepare, once you have all the ingredients on hand and makes a great curry with chapatis, steamed white rice or biryani. Try it and it sure will enthrall the palates of your family and friends.\r\nCoconut Chicken Masala Recipe\r\nRecipe source: Nirmala Aunty\r\nPrep: 15 mts, Cooking Time: 25 mts\r\nServes 5-6 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg chicken, washed and cut into medium sized pieces\r\n\r\n1 large onion finely chopped\r\n\r\n1 tbsp ginger-garlic paste \r\n\r\n1 tbsp coriander powder\r\n\r\n2-3 green chillis slit length wise\r\n\r\n1 1\/2 tsp garam masala pwd (2\" dalchini, 2 green cardamom, 6 cloves finely ground)\r\n\r\nfresh coriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsp-2 tbsp oil\r\n\r\nMake a paste:\r\n\r\n1 large onion\r\n\r\n3-4 green chillis\r\n\r\n1\/2 cup fresh grated coconut\r\n\r\n1 small bunch fresh coriander leaves\r\n\r\n10-12 mint leaves\r\n\r\n10-12 cashewnuts, soaked in 2-3 tbsps milk for 15 mts\r\n\r\n\r\n\r\n1 Marinate the chicken in coriander pwd, turmeric pwd, ginger garlic paste, 2 slit green chillis and few mint leaves for 10-15 mts. Soak the cashewnuts in 2-3 tbsps milk for 10-15 mts.\r\n2 Make a paste of onion, green chillis, grated coconut, coriander leaves, mint leaves and cashewnuts. Keep aside.\r\n3 Heat oil in a cooking vessel, add the green chillis and chopped onions and saute till transparent.\r\n 4 Add the marinated chicken and cook on high heat for 4-5 mts, combining the ingredients once in a while. \r\n5 Reduce to medium heat, add the ground paste and salt and combine well. Let the chicken cook in this paste for 8-10 mts, uncovered. Cook till oil separates. There is no need to add water as the chicken cooks in its own water.\r\n6 Finally add the garam masala pwd, combine well and remove the contents to a pressure cooker. Pressure cook the chicken for 3-4 mts or upto one whistle. Turn off heat and garnish with fresh coriander leaves.\r\n7 Serve hot with white steamed rice, biryani or chapatis.\r\n\r\nNote:Use only fresh coconut and not the dry variety. Adjust the green chillis according to your spice level. Ensure that the chicken doesnt pressure cook for more than one whistle, you wouldn't want a mushy chicken curry.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/chicken_cooked_in_coconut.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken_cooked_in_coconut-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken_cooked_in_coconut-300x300.jpg","main-ingredient":["chicken"],"author":null,"type":"post","categories":["All Recipes","Indian Chicken Recipes","Indian Curry Recipes","Indian Non-Vegetarian Recipes","South Indian Recipes"]}