{"id":3822,"permalink":"http:\/\/www.sailusfood.com\/2009\/08\/24\/uppu-kudumulu-undrallu\/","title":"Uppu Kudumulu & Undrallu","content":"Isn't it fun having close family and friends come together for a festive occasion? Women folk working in the kitchen preparing delicacies - mixing, stuffing, steaming, cooking and of course, gossiping. :) Hope you enjoyed the weekend celebrating Ganesh Chaturthi.\r\n\r\nUndrallu & Uppu Kudumulu\r\n\r\nLast year, I blogged Paala Undrallu. This Vinayaka Chavithi we prepared a different type of modak aka undrallu recipe. The filling for this particular undrallu is lightly sweetened with jaggery and grated coconut and makes for a healthy sweet. \r\n\r\nUndrallu Recipe\r\nRecipe source: Amma\r\n Cooking Time: 30 mts \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 cup rice flour\r\n\r\n1 cup water\r\n\r\npinch of salt\r\n\r\n1\/4 cup grated jaggery\r\n\r\n3 tbsps grated coconut\r\n\r\npinch of elachi pwd (cardamom)\r\n\r\n\r\n\r\n1 Add salt and bring water to boil, add the rice flour and immediately cover it with a lid without stirring and reduce heat. Let it cook for a mt. Turn off heat and cool. Make small balls and keep aside.\r\n2 In another vessel add the grated jaggery and grated coconut and stir for few mts. Add the elaichi pwd. The jaggery will begin to melt. Let it cook on low flame till it forms a thick mass. Turn off heat and cool. Make small gooseberry sized balls and keep aside. \r\n3 Make a thin layer of the rolled rice flour balls and stuff with the jaggery-coconut balls and seal. You can shape it like a ball or modak.\r\n4 Place in a vessel and steam for 10-11 mts like you would steam idlis. Cool.\r\n\r\nUppu Kudumulu\r\n\r\nLast year, I blogged Kudumulu prepared with broken rice aka biyyam rava. Uppu Kudumulu are savory steamed balls made from semolina aka sooji and yellow moong dal aka pesara pappu. Very simple to prepare and healthy.\r\n\r\nUppu Kudumulu Recipe\r\nRecipe source: Amma\r\n Cooking Time: 30 mts \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 cup sooji\/godhuma rava\/semolina, dry roast for 4 mts\r\n\r\n1 cup water \r\n\r\npinch of salt\r\n\r\n2 tbsps pesara pappu\/yellow moong (soak in water for 15 mts and drain) \r\n\r\n1 1\/2 tbsps grated coconut\r\n\r\nÂ½ tsp cumin seeds \r\n\r\n2 tsps ghee\r\n\r\n\r\n\r\n1 Add salt to water and bring to a boil. Immediately add the roasted sooji and stir continuously ensuring that no lumps are formed and once all the water is absorbed and appears like a big lump, cover and turn off heat. Cool. \r\n2 Once cool, add the rest of the ingredients and make lemon sized balls and steam for 10-11 mts like you wouild steam idlis. Cool.\r\n\r\nUndrallu and Uppu Kudumulu are ready to be offered to Lord Ganesha as neivedyam.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/08\/undrallu-uppu-kudumulu1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/undrallu-uppu-kudumulu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/undrallu-uppu-kudumulu1-300x300.jpg","main-ingredient":["rice flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Festival Foods","Indian Festivals","Indian Vegan Recipes"],"tags":["godhuma_rava","neivedyam","vegan_recipe"]}