{"id":385,"permalink":"http:\/\/www.sailusfood.com\/2007\/01\/26\/tomato-dosa\/","title":"Tomato Dosa","content":"Preparing different varieties of tiffin recipes for my 4 yr old is a daunting task, sometimes. Yes, after trying out a new recipe, I'm not sure if he is going to eat it at all. I guess, there are some of you out there who would relate to that. But then, it doesn't stop us from preparing a tried and tested recipe with a twist\/variation or an absolutely new tiffin recipe with the hope that our little ones might enjoy it after all.  \r\n\r\nTomato dosa, pandumirapakaya pachadi, cabbage pachadi, karivepaku podi\r\nI tried out a new recipe, tomato dosa, from recipe files this week which, fortunately, turned out to be a keeper. The tomatoes gave that kick to the rice+dal batter by lifting the earthy flavor to something tangy, jaggery lent it a sweet touch, and red chillis provided the spice factor. These dosas can be served with any chutney or podi of your choice. My son enjoyed it with white sugar, though.:)\r\nTomato Dosa Recipe\r\nRecipe Source: From my recipe files\r\nPrep & Cooking: 20-30 mts, Soaking: 2-3 hrs\r\nServes 5-6 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup raw rice and 2 tbsps of tur dal, soaked in water for 2-3 hrs\r\n\r\n2 tomatoes chopped\r\n\r\n2 tbsp grated fresh coconut (optional)\r\n\r\n2-3 dried red chillis, de-seed and tear\r\n\r\n1-2 tbsp grated jaggery \r\n\r\n1 tbsp chopped coriander leaves (optional)\r\n\r\nsalt to taste\r\n\r\noil as required\r\n\r\n\r\n\r\n1 Drain and grind smoothly the rice and tur dal with chopped tomatoes, dried red chillies (de-seed), grated fresh coconut, jaggery, coriander leaves, salt and little water to form a dosa-like batter. \r\n\r\n2 Heat griddle on high flame till hot, reduce heat, pour a laddle full of dosa batter, spread the batter with the bottom of the ladle evenly making circles to form a dosa and drizzle with some oil along the edges. Cook on medium heat for 1-2 mts and increase to high flame for a few seconds and flip the other side and cook for 20-30 seconds or till done.\r\n\r\n3 Serve hot with any podi or chutney of your choice like karivepaku podi or coconut chutney.\r\nHappy Republic Day!","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/tomato_dosa_chutney.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tomato_dosa_chutney-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tomato_dosa_chutney-300x300.jpg","main-ingredient":["tomatoes"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Recipes Vegetable Dishes","South Indian Recipes"]}