{"id":3858,"permalink":"http:\/\/www.sailusfood.com\/2009\/08\/26\/atukulu-payasam-rice-flakes-kheer\/","title":"Atukulu Payasam ~ Rice flakes Kheer","content":"Atukulu Payasam ~ Rice flakes aka Poha Kheer\r\n\r\nAtukulu (Aval) Payasam is prepared with rice flakes aka poha that is roasted in ghee, slowly simmered in a poppy seeds-coconut milk-jaggery base, flavored with cardamom and garnished with toasted cashew nuts and raisins.\r\n\r\nAtukulu Payasam Recipe\r\nCooking Time: 45 mts\r\nCuisine: Andhra\r\nServes 5-6 persons\r\n. \r\n\r\nIngredients:\r\n\r\n2 1\/2 cups coconut milk\r\n\r\n1\/2 cup roast rice flakes\/aval\/atukulu\/poha (in a tsp of ghee)\r\n\r\n1\/2 cup grated jaggery (keep in 1 cup warm water)\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n6-7 cashew nuts \r\n\r\nfew raisins\r\n\r\n1 tbsp ghee\r\n\r\nSoak in 5 tbsps milk and make a smooth paste:\r\n\r\n1\/2 tbsp dry roasted poppy seeds\/khus-khus\/gasagasalu\r\n\r\n1 1\/2 tbsps grated coconut\r\n\r\n5-6 cashewnuts\r\n\r\n1 Heat a pan, add a tbsp of ghee and toast the cashew nuts and raisins till golden brown. Remove from pan, keep aside.\r\n2 In the same pan, add the ground paste and few tbsps water and cook for approx 4-5 mts. Add the jaggery water and let it cook along with the paste for 5-6 mts.\r\n3 Add roasted rice flakes and coconut milk and let it slowly simmer for 10-12 mts, stirring it once in a while.\r\n5 Add the cardamom pwd and toasted cashews and raisins. Serve warm or refrigerate until chilled. It tastes good both warm and chilled. \r\n\r\nKitchen Notes - You will find that once you turn off the flame and the payasam sits, the rice flakes absorb the coconut milk and the payasam will thicken. The payasam thickens even when refrigerated. So at the time of serving, add some warm milk and combine well and serve. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/08\/atukulu-payasam.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/atukulu-payasam-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/atukulu-payasam-300x300.jpg","main-ingredient":["rice flakes"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["kheer","payasam","poha"]}