{"id":391,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/08\/gutti-dondakaya-masala-kura-stuffed-tindora\/","title":"Gutti Dondakaya Masala Kura - Stuffed Tindora ","content":"Dondakaya happens to be one of my favorite vegetables and I just realised that I have blogged only one recipe of Tendli\/Ivy Gourd, a stir-fry (vepudu). In Andhra, dondakaya being available all year round, this humble, rough vegetable is a regular with most kitchens concoting some wonderful recipes and transforming it into something exotic and delicious. \r\n\r\nStuffed tindora is one such classic recipe with each home having it own signature stuffing. Gutti dondakaya masala kura is a curry which calls for some S.Indian spices & ingredients like grated coconut, jaggery, sesame seeds, curry leaves and dashes cloves and cinnamom which blend so well creating a stuffed curry that brings together the sweet flavor of tindora and jaggery, nutty flavor of seasame with a tangy edge of tamarind. And with some hot white steamed rice, it makes a warm and satisfying meal.\r\n\r\n\r\nGutti Dondakaya Masala Kura Recipe\r\nPrep & Cooking: 45 mts \r\nServes: 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 kg dondakayalu\/tindora, chop ends, make a + slit length wise for stuffing and boil in salted water till half cooked and strain\r\n\r\n2 medium onions, sliced\r\n\r\n3 green chillis\r\n\r\n1 tsp ginger-garlic paste\r\n\r\n1 tbsp coriander seeds\r\n\r\n2 tbsps grated coconut\r\n\r\n1 1\/2 tbsps sesame seeds (nuvvulu)\r\n\r\n1 1\/2 tbsp grated jaggery (adjust according to your choice)\r\n\r\n1\" cinnamon stick\r\n\r\n3-4 cloves\r\n\r\nsmall lemon sized tamarind ball\r\n\r\nsalt to taste\r\n\r\nfew curry leaves\r\n\r\n1 dry red chilli \r\n\r\n2-3 tbsp oil \r\n\r\n\r\n\r\n1 Heat a tsp of oil in a frying pan and add the coriander seeds, cloves, cinnamon and sesame seeds and fry on medium heat till you get a nice aroma. Dont burn the spices. Just fry for 3-4 mts stirring continuously. Remove and cool.\r\n2 In the same pan, add about a tbsp of oil and add the onions and green chillis and saute for 4-5 mts. Finally add the grated coconut and toss for a few seconds. Turn off heat.\r\n3 Once cool, make a paste of the above spices along with ginger-garlic paste, jaggery, tamarind, sauted onions, green chillis, grated coconut and salt. \r\n4 Take a tbsp of this paste and stuff each of the slit half-boiled ivy gourds. \r\n5 Heat the remaining oil in a cooking vessel and add some curry leaves, dry red chillis and stir fry for 5-6 seconds. Place the stuffed gourds in the pan and let it cook covered on medium heat. \r\n6 After 4-5 mts, uncover the lid and turn the pieces so that they cook all over.\r\n7 Cover and cook on low heat till the tendlis become soft. This could take about 15-20 minutes. Adjust salt.\r\n8 Turn off heat once cooked and serve with hot white steamed rice.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/stuffed_tendli_masala_curry.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/stuffed_tendli_masala_curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/stuffed_tendli_masala_curry-300x300.jpg","main-ingredient":["tindora"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}