{"id":393,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/01\/adraki-palak-tawa-kebab-gingery-spinach-kabab\/","title":"Adraki Palak Tawa Kebab - Gingery Spinach Kabab","content":"A twist on the classic palak kebabs, these adraki palak kebabs as the name suggests are prepared with a generous amount of ginger and spinach and get their body and flavor from  potato, white bread, dry mango powder and pounded coriander seeds. I usually prepare these kebabs as a evening snack and serve with some date and tamarind chutney.\r\n\r\nAdraki Palak Tawa Kebab\r\nHardly any spices go into the preparation of these starters and the addition of amchur (dry mango pwd) brightens the rest of the ingredients, lifting their flavor to something tangy, while the bread gives them a sweet, rich flavor and coarsely pounded coriander seeds and garam masala powder makes them more savory. Shallow fry these low fat healthy kebabs on a tawa till golden brown and serve with tomato sauce or date chutney. \r\n\r\nAdraki Palak Tava Kebab Recipe\r\nRecipe Source: My recipe files\r\nPrep & Cooking: 20-30 mts, sitting time 30 mts \r\nMakes approx 30 kebabs\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 bunches of spinach, cleaned and finely chopped  \r\n\r\n2 potatoes, boiled, peeled and mashed\r\n\r\n1 large onion finely chopped\r\n\r\n2-3 fresh green chillis finely chopped\r\n\r\n1 1\/2 tbsps grated ginger\r\n\r\nsmall bunch coriander leaves, chopped\r\n\r\n4-5 bread slices crumbled\r\n\r\n1 tbsp coriander seeds coarsely pounded \r\n\r\n1 big pinch garam masala pwd\r\n\r\n1 tsp amchur pwd (dry mango pwd) or 1-2 tbsp lemon juice \r\n\r\nsalt to taste\r\n\r\noil for shallow frying\r\n\r\n\r\n\r\n1 Combine all the above ingredients (except oil) and shape into pattis. Refrigerate for 20 mts.\r\n2 Heat a non-stick tawa and drizzle some oil and place 4-5 kebabs and shallow fry on both sides till brown.\r\n2 Serve hot with tomato sauce or date and tamarind chutney.\r\n\r\nNote: Alternatively, you can charcoal grill\/oven-broil the kababs by coating the grill with some oil to prevent them from sticking.\r\n\r\nMy entry to Jihva-Ginger hosted by Rosie of What's the recipe today Jim?.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/palak_kebabs.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/palak_kebabs-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/palak_kebabs-300x300.jpg","main-ingredient":["spinach"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Green Leafy Vegetables","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","North Indian Recipes"]}