{"id":40,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/04\/mixed-vegetable-curry-yellow-gravy\/","title":"Mixed Vegetable Curry (Yellow)","content":"\r\n\r\nThis is a special mixed vegetable curry that I usually make for parties. First time tasted it at a friend's place, who is a chef by profession. I must thank him for this excellent recipe. It's got a rich taste and goes excellent with any kind of roti. I like the taste of brown onion paste and cashew nut in the veggies. Its flavor is distinctly different from the usual mixed vegetable curry cooked in our kitchen.\r\n\r\nIngredients for Mixed Vegetable Curry:\r\n\r\n2 cups onions\r\n1 cup cauliflower\r\n1 cup carrots\r\n3\/4 cup french beans\r\n1 cup potatoes\r\n1\/2 cup green peas\r\n1 cup tomatoes\r\n1 tbsp ginger garlic paste\r\n5-6 green chillis slit length wise\r\n1 tsp cumin seeds (jeera, jeelakara)\r\n3 cloves\r\n4 green cardamoms\r\n2\" cinnamon stick\r\n1 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1\/4 tsp garam masala pwd\r\nbrown onion paste (fry 2 sliced onions till brown and make a paste of it)\r\n2 tbsp curd (yogurt)\r\n3 tbsps tomato paste\r\nsalt\r\n3 tbsps oil\r\ncoriander leaves for garnishing\r\n\r\n\r\n\r\nFor cashew nut paste:\r\n2 tbsp cashewnuts\r\n1 tbsp melon seeds\r\n1 tsp poppy seeds\r\nSoak the cashewnuts, melon seeds and poppy seeds in water for 15-20 minutes and make a smooth paste. Keep aside.\r\n\r\nChop the vegetables. Parboil the vegetables except onions and tomatoes adding some salt.\r\nHeat 1 tbsp oil in a cooking vessel and add the par-boiled veggies and fry for 3-4 minutes. Remove and keep aside.\r\nHeat 2 tbsp oil in the same vessel, add the whole garam masala (spices) and jeera and let it splutter. Add chopped onions and slit green chillis and fry till the onions turn transparent.\r\nAdd ginger garlic paste and fry till oil separates. Add red chilli pwd, turmeric pwd,  coriander pwd, cumin pwd, salt. Mix well.\r\nAdd the chopped tomatoes and fry till oil separates. You need to stir fry the paste really well, for a longer period than usual.\r\nAdd the parboiled vegetables and mix well. Cover and cook for 2 minutes. i.e the vegetables need to cook in this onion-tomato masala. Add the tomato paste and mix well. Cook for 3 mts.\r\nAdd brown onion paste and curds and mix well. \r\nAdd the cashew nut paste and mix well. Cook covered for 2-3 minutes.\r\nAdd 1 1\/2 cups of water and mix well and cover and cook for 15-18 minutes.\r\nAdd garam masala pwd and garnish with fresh coriander leaves.\r\n\r\nThis curry does take some time to prepare and calls for some work..:). Do not omit any of the ingredients like brown onion paste and cashew nut paste. Its a rich dish but one with a lot of flavor.","style":["easy","traditional"],"course":["side"],"special-diet":["eggless","vegetarian","dairy","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"45","prep-time":"30","main-ingredient":["vegetables","onions","cashew nuts","carrots","beans","potato","peas","cauliflower"],"serves":"8","goes-well-with":["rice","roti","pulao","biryani"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["curry","vegetables"]}