{"id":401,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/13\/bellam-garelu-jaggery-flavored-vadas\/","title":"Bellam Garelu - Jaggery Flavored Vadas","content":"I'm not sure if many of you have heard of sweet flavored 'vada\/garelu'. Dear reader, I'm talking of bellam (jaggery) garelu where deep fried crisp vadas are sweetened with jaggery syrup, a traditional sweet in our parts. Sometimes, during festivals or special occasions, when garelu are prepared, if there is any left over urad dal or garelu batter, sweet flavored vadas are prepared and usually served during tea time. I can eat them at time of the day, though..:)\r\n\r\nNo onions or green chillis go into this vada batter - just whole urad dal soaked in water, drained, ground to a fine paste with salt, beaten till fluffy and white, shaped into vadas, deep-fried till crisp and golden brown and dropped immediately in warm jaggery syrup till they absorb the syrup. The resultant vadas are absolutely delicious with the first bite having that hint of crispiness when eaten hot and puffy off the stove. \r\n\r\nThe sweet richness of jaggery countered by the earthiness of urad dal, leaves a pleasant mouth-feel, very earthy and sweet - a fine balance of flavors. Best eaten hot when the crust still retains the crispiness and believe me, savoring these teepi (sweet) garelu is pure pleasure guaranteed!\r\nBellam (Teepi) Garelu Recipe\r\nPrep & Cooking: 45 mts, Soaking time: 2 hrs \r\nMakes: 12-14 vadas\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup whole urad dal  (black gram dal, minappappu)\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n1 cup grated jaggery, add water, cook to prepare a syrup that is sticky on touch\r\n\r\n1 1\/2 cups water \r\n\r\n\r\n\r\n1 Soak whole black gram dal in water for 2 hours.\r\n2 Strain the water, and grind the dal to a paste sprinkling little water and salt. Use small portions of dal to grind batch wise as its easier to grind into a soft paste. Beat till fluffy.\r\n3 Heat water, add the jaggery and let it melt and form a syrup which is sticky to touch. While the jaggery is forming a syrup, deep fry the vadas.\r\n4 Take a deep frying vessel, add enough oil and heat till piping hot.\r\n5 Wet your hands with water, take a lemon-sized ball of batter and flatten it into a vada on a greased sheet or banana leaf. Make a hole in the centre of the vada so that it cooks evenly all over.\r\n6 Slowly drop the vada into the hot oil carefully and fry it on both sides on medium heat to a golden brown color. Deep fry 4-5 vadas per batch depending on the size of the vessel. \r\n7 Immediately dip these fried vadas into the jaggery syrup. Let them sit in this syrup till the next batch of vadas are deep-fried. Remove them onto a serving plate and drop the next batch of vadas into the syrup. \r\n8 Drizzle some left over syrup over vadas before serving and serve hot while the crust is still crisp.\r\n\r\nNote:Add a pinch of cardamom pwd to the syrup or for a savory touch to this sweet, add a pinch of freshly ground pepper pwd to the syrup. Its your choice. Ensure that the jaggery syrup doesn't become thick, it should just melt and feel sticky. You will know when the vadas have absorbed the syrup and done as they will be heavy. Be careful they don't become too soggy. \r\nThis recipe is my contribution to VKN's group book project 'You can cook for FAHC campaign. Thank you, VKN, for providing an opportunity to contribute to a worthy cause and appreciate the efforts of the entire team of FAHC.\r\n\r\nFor more information on this project, visit Feed A Hungry Child.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/teepi_garelu1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/teepi_garelu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/teepi_garelu1-300x300.jpg","main-ingredient":["jaggery","urad dal"],"author":null,"type":"post","categories":["All Recipes","Festival Foods","Indian Dal Recipes","Indian Lentil Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"]}