{"id":404,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/17\/pesara-punukulu-moong-dal-fritters\/","title":"Pesara Punukulu - Moong Dal Fritters","content":"Both Satish and I like to snack on some tasty nibbles with our evening tea and one tea-time snack I prepare once in a while, are green moong dal fritters - full of earthy goodness, simple with few ingredients, flavorful and ones which Nehal also relishes. It hardly takes any effort to prepare them - to savor these fritters at tea time, remember to soak the moong dal atleast 5-6 hours before tea-time. \r\n\r\nBest eaten hot, off the skillet, when the crust is crisp. When eaten cold, its sort of chewy but pleasantly livens up our palate with a hot cuppa chai. \r\nPesara Punukulu Recipe\r\nPrep & Cooking: 20-30 mts, soaking: 5-6 hours\r\nMakes approx 35-40 punukulu\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup pesalu, green moong dal (soaked in water for 5-6 hrs)\r\n\r\n1 onion finely chopped (optional)\r\n\r\n3-4 green chillis (adjust according to your spice level)\r\n\r\n1\" ginger \r\n\r\n2 flakes garlic, crushed (optional)\r\n\r\n1 tsp cumin seeds \r\n\r\n1 small bunch coriander leaves finely chopped\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Grind the soaked and drained moong dal, green chillis, ginger and salt to a paste. There is no need to add water while grinding. Remove onto a dish and add the chopped onions, coriander leaves, cumin seeds and mix well.\r\n2 Heat oil in a deep frying vessel. Once its piping hot, reduce flame to medium and drop a little mixture (about a tbsp) and fry the fritters to a golden brown color. Deep fry a batch of 8-10 punukulu depending on the size of the vessel.\r\n3 Serve hot over a cup of masala chai.\r\n\r\n\r\n\r\n Note: Generally, the split husked green moong is the preferred lentil for these fritters. You need to soak these lentils for 2-3 hours unlike the whole  moong which requires more soaking time.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/moong_dal_fritters.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/moong_dal_fritters-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/moong_dal_fritters-300x300.jpg","main-ingredient":["moong dal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Dal Recipes","Indian Lentil Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes"]}