{"id":4092,"permalink":"http:\/\/www.sailusfood.com\/2009\/09\/15\/gosht-korma-mutton-curry\/","title":"Gosht Korma ~ Mutton Curry","content":"The month of Ramzan has inspired me to cook a meat dish with a Nawabi touch. On Sunday, we had a special meal - Coconut rice, Cucumber Raita and Hyderabadi Gosht (Mutton) Korma, a culinary marvel of Hyderabadi cuisine. \r\n\r\nGosht Korma, Coconut Rice and Cucumber Raita ~ Our Sunday mid day meal\r\n\r\nIts not the first time I have prepared Mutton Korma. Infact, I've blogged the recipe earlier. Each time I cook it, I tend to tweak the combination of spices that go into its making trying to replicate a flavor that I once tasted at a friends Id party. This particular recipe comes close to it and is a family favorite. Enriched with a paste of fresh coconut-poppy seeds, flavored with aromatic spices, the meat is slow cooked in yogurt till falling apart tender. The mildly spiced, creamy textured Korma has warm comforting flavors and makes a great side with biryani, pulao, coconut rice and rotis. \r\n\r\n\r\nMutton Korma Recipe\r\nMarinatation: 30 mts, Prep: 50-60 mts\r\nServes 4-5 persons\r\nCuisine: Hyderabadi\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg mutton, cubed, washed\r\n\r\n4 cloves\r\n\r\n2 elaichi\r\n\r\n1\" cinnamon stick\r\n\r\n1 bay leaf\r\n\r\n2 large onions, finely chopped\r\n\r\n5-6 green chillies, slit\r\n\r\n1 1\/2 tbsps ginger garlic paste\r\n\r\n1 large tomato, chopped\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsps oil\r\n\r\n1 1\/2 tbsps ghee\r\n\r\n3\/4 tsp garam masala pwd\r\n\r\nchopped coriander leaves for garnish\r\n\r\nFor marinade:\r\n\r\n2 tsps red chilli pwd (adjust)\r\n\r\n1 1\/4 tbsp coriander pwd\r\n\r\n3\/4 tsp cumin pwd\r\n\r\n1\/2 tsp turmeric powder\r\n\r\n1 1\/2 cups thick yogurt\/curd\r\n\r\nMake a paste\r\n\r\n1 1\/2 tbsp poppy seeds, dry roast for 4 mts, soak in water for 10 mts\r\n\r\n4 tbsps grated fresh coconut\r\n\r\n4 cashew nuts, soak in little water or milk (optional)\r\n\r\n\r\n\r\n\r\n1 Add the curd, red chilli pwd, turmeric pwd, coriander pwd, cumin pwd, half of the ginger garlic paste to the washed mutton. Keep aside the marinated mutton for 30-40 mts.\r\n2 Heat oil and ghee in a heavy bottomed vessel, add whole spices and bay leaf and fry for few secs. Add the chopped onions and fry till transparent. Add the green chillis and  remaining ginger-garlic paste and saute for 3 mts. Add the chopped tomatoes and fry for 4-5 mts.\r\n3 Add the marinated mutton and cook over medium heat with lid till the water from the meat and yogurt is almost absorbed. Check in between and stir.\r\n4 Add the poppy seeds-coconut paste and salt to the mutton and mix well. Cover and cook for 4-5 mts. Add 3 cups of water and salt. Cook with lid on simmer till the mutton is tender and the gravy thickens. Add garam masala pwd and garnish with chopped coriander leaves. Turn off heat.\r\n5 Serve with pulao, biryani, coconut rice or rotis.\r\n\r\n Note: The cooking time will depend on the quality of mutton used. If its tough meat, it takes longer to cook.\r\n\r\nMutton Kurma","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/09\/hyderabadi-mutton-korma.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/hyderabadi-mutton-korma-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/hyderabadi-mutton-korma-300x300.jpg","main-ingredient":["mutton"],"author":null,"type":"post","categories":["All Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes"],"tags":["mutton-korma"]}