{"id":42,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/06\/arati-kaaya-masala-vepudu-plantain-stir-fried-with-spices\/","title":"Aratikaya Masala Vepudu ~ Plantain Stir Fry","content":"\r\n \r\nRaw Plantain (Green) is called 'Aratikaya' in Telugu and is a popular vegetable in Southern states of Kerala and Tamil Nadu. The famous \"Banana Chips\" of Kerala are raw plantain slices deep fried in coconut oil.\r\n\r\nYou need to be sure to pick a recipe appropriate for the plantain you have on hand. When the plantain is green it is quite starchy and the flavor is more like a potato. The green fruit can be fried or boiled. When the plantain turns yellow the sugars begin to develop and imparts a slight sweetness to the fruit. At this stage the fruit may show a few freckles of black. The plantain is at it's sweetest once it turns black. One would want to use these plantains for dessert or any recipe which requires a sweet taste. So, Plantains can be used at any stage of ripeness.\r\n\r\nToday's recipe is a dry masala stir fry dish using plantains, onions, fresh coconut and spices. Tastes excellent with rice, you can eat it with rotis too.\r\n\r\n\r\n\r\n\r\nIngredients:\r\n\r\n2 raw plantains, peeled, sliced into thick rounds\r\n2 tbsp fresh grated coconut\r\n3 medium onion peeled, sliced into thick rounds\r\n2 green chillies slit length wise\r\n1 tsp red chilli pwd\r\n3\/4 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1\/2 tsp fennel seeds pwd (saunf)\r\n1\/4 tsp garam masala pwd\r\n1\/2 tsp mustard seeds\r\n1\/2 tsp cumin seeds\r\n10 curry leaves\r\n2 tbsps oil\r\nsalt\r\n1\/2 cup water\r\n\r\nTake a wide plate and combine all the dry masalas except garam masala and saunf pwd with sliced onions and plantains.\r\nHeat a cooking vessel and add oil. Add mustard seeds and let them splutter.  Now add the cumin seeds and curry leaves.Fry for few secs. Add slit green chillis and the plantains which have been combined with the masalas. Add grated coconut. Combine well.\r\n\r\n\r\n\r\nPour 1\/2 cup of water and cover and cook. Once in a while stir.\r\nAdd the garam masala pwd, saunf pwd and adjust salt towards the end of the cooking.\r\nOnce the plantains are cooked till soft remove from heat and serve with hot rice.\r\n\r\nRaw Plantain is an effective astringent and is recommended by Ayurveda widely as a diet for treating diarrhoea. Cut one raw banana into three pieces and soften them in a pressure cooker adding adequate water. Drain out the excess water. Separate the peel and mash the softened pulp well. In a skillet, dry roast 1 tbsp of poppy seeds (khus-khus, ghasgasaalu) till they brown. Grind it to a fine powder. Add this powder to the mashed banana pulp with a pinch of salt. This nutritious recipe checks diarrhoea owing to its astringent properties.","style":["easy","modern"],"course":["side"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","gluten\/wheat free","healthy","pregnancy","medium spice"],"cuisine":["andhra"],"cook-time":"35","prep-time":"15","main-ingredient":["raw plantain"],"serves":"4","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["aratikaya","raw-plantain","stir-fry"]}