{"id":428,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/20\/gajjar-ka-doodh-carrot-milk\/","title":"Gajjar Ka Doodh - Carrot Milk","content":"Gajjar ka doodh is one recipe I've tweaked and tested a number of times and today's version, is one which I keep returning to and well received by family and friends. Well, it all starts with some fresh carrots, milk, pala kova (evaporated unsweetened milk), sugar, infused with a hint of cinnamon, clove and a dash of freshly ground cardamom and saffron which gives it a delicious sweet note, aroma and a lovely color. \r\n\r\n\r\n\r\nIf you don't have unsweetened pala kova on hand, substitute with condensed milk and reduce the quantity of sugar. But try preparing it with pala kova - nothing to beat the flavor it lends to the carrot milk. This richly flavored comforting drink makes an ideal summer drink\/a perfect party drink or when unexpected guests arrive. Well, this drink does improve with age, ahem, yes, tastes better the next day or the day after that..:). \r\n\r\nI'm sure many of you are  surprised at the color of carrot milk, expecting it to be a bright orange shade. You see, its the addition of saffron which lent this dish its enticing beautiful yellow color..:)\r\n\r\nGajjar Ka Doodh Recipe\r\nPrep & Cooking: 30-40 mts and chilling time\r\nMakes approx 6 glasses\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 big carrots, steamed and pureed\r\n\r\n1 1\/4 lt milk (I used skimmed milk)\r\n\r\n1\" cinnamon stick\r\n\r\n1 clove\r\n\r\n2 tbsp unsweetened kova or 3 tbsps condensed milk\r\n\r\n4 tbsps sugar (adjust according to your choice)\r\n\r\n1\/2 tsp elachi pwd\r\n\r\nfew strands saffron (optional)\r\n\r\n6 cashewnuts & 4 almonds (blanched) (soak together in some milk for 10-15 mts)\r\n \r\n\r\n\r\n1 Steam the carrots, cool and puree. Keep aside.\r\n2 Grind the cashewnuts and almonds to a smooth paste. Keep aside.\r\n3 Add the clove and cinnamon stick to the milk and bring to a boil. Reduce heat and boil the milk for at least 10 mts, stirring it. Add the sugar and stir till its completely dissolved. \r\n4 Add the carrot paste to the milk mixture, combine well and let it cook for 3-4 mts.\r\n5 Add the nuts paste, pala kova and elaichi pwd - combine well. Turn off heat after 2 mts and cool completely. (remove the clove and cinnamon stick from the mixture and discard it)\r\n6 Blend the cooled mixture till you get a smooth consistency. \r\n6 Garnish with toasted almonds slivers or pista. Serve warm or chilled.\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2007\/02\/carrot-milk.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/carrot-milk-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/carrot-milk-300x300.jpg","main-ingredient":["carrots"],"author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes","Sweet Dessert Recipes"],"tags":["carrot","gajjar"]}