{"id":429,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/22\/chikkudukaya-tomato-indian-broad-beans-tomato-curry\/","title":"Chikkudukaya Tomato - Indian Broad Beans Tomato Curry","content":"Chikkudu kaya happens to be a favorite vegetable in our household and I know there are quite a few of you out there who are not very fond of these mildly sweet plump beans. I always felt there is something addictive about the beans, especially during their non-availability in the local market and when those cravings hit you - you really know what your missing! Now, you know why I buy them by the kilos during season.:)\r\n\r\n\r\n\r\nNot a very pleasant looking bean but then is packed with a lot of fibre and nutrients like most not-so-good looking vegetables do. Today's recipe is beans cooked in tomato, a very basic recipe and the addition of jaggery and garam masala makes a dramatic difference to an otherwise ordinary every day curry. The fresh, firm and plump dark green lima beans work best for this recipe and you wouldn't want to compromise when you prepare this dish. Hope this recipe helps all you broad bean haters to reconsider and give these beans its well deserved recognition.:). \r\n\r\nChikkudukaya Tomato Recipe\r\nPrep & Cooking: 30 mts \r\nServes: 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 kg chikkudukaya\/sem\/broadbeans, destring, tear each into two pieces, par-boil in salted water and strain\r\n\r\n2 medium onions, finely chopped\r\n\r\n1 slit green chilli\r\n\r\n2 tomatoes finely chopped\r\n\r\npinch of haldi, turmeric\r\n\r\n1 tsp red chilli pwd (adjust)\r\n\r\n1 tbsp grated jaggery (adjust according to your choice)\r\n\r\npinch of garam masala pwd (optional)\r\n\r\n1 1\/2 tbsps grated coconut (optional)\r\n\r\nsalt to taste\r\n\r\nfresh coriander leaves for garnish\r\n\r\nFor tempering\/tadka\/poppu:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n2 dry red chillis\r\n\r\n3-4 crushed garlic cloves (optional)\r\n\r\nfew curry leaves\r\n\r\n1 tbsp oil \r\n\r\n\r\n\r\n1 Heat oil in a cooking vessel, once hot, add the mustard seeds and let them pop, add the garlic, cumin, red chillis and curry leaves, stir fry for a few seconds. \r\n2 Add the slit green chilli and onions and saute till soft. Add turmeric and tomatoes and saute further for a mt. Add chilli pwd, mix, cover and cook on medium heat for 5-6 mts.\r\n3 Now add the par-boiled beans, jaggery and salt and cook for another 2-3 mts. Add a small cup of water and let it cook covered on medium heat for another 5-6 mts or till the beans are cooked and soft.\r\n4 Adjust salt, add garam masala pwd, mix and turn off heat. Garnish with fresh coriander leaves and serve with rice or chapatis.\r\n\r\n\r\n\r\n Kitchen Notes:You can even add some milk, about a few tbsps, once the curry is through and keep stirring till its absorbed and turn off heat. A variation - garnish with freshly grated coconut.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/broad_beans_tomatoes.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/broad_beans_tomatoes-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/broad_beans_tomatoes-300x300.jpg","main-ingredient":["broad beans"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Dal Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}