{"id":43,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/07\/mirchi-bajji-stuffed-green-peppers\/","title":"Mirchi Bhaji ~ Stuffed Green Peppers","content":"\r\n\r\nMirchi Bajji is green chilli stuffed with potato filling, dipped in chickpea flour (besan, senaga pindi) batter and deep fried in oil. Mirchi Bhajis are a popular Indian street food snack and often served as evening snack with a cup of tea. Mirchi Bajji make for a great treat during the monsoon season. One can use different kinds of stuffing for the peppers.\r\n\r\nToday I have used a potato based filling that is mostly used as a stuffing in North Indian Mirchi Bajjis. I have used banana peppers which are less spicy than the usual Indian green chillis. You can use any kind of green chillis.\r\n\r\n\r\n\r\nIngredients: (for 10 green chillis)\r\n\r\nWash and dry the green peppers. Take a pepper, make a slit lengthwise in the middle, keeping the ends intact. Scoop out the seeds with a knife or spoon leaving the insides clean for the stuffing.\r\n\r\n\r\n\r\nStuffing: 1 cup of mashed potato, 2 tbsp chopped fresh coriander leaves, 1 chopped onion, pinch of salt, 1 tsp grated ginger, 1 1\/2 tsp chaat masala, pinch of garam masala pwd. Mix well and keep aside.\r\n\r\nPrepare the batter with 1 cup of gram flour, 1\/4 cup of rice flour, pinch of cooking soda, salt and 1 cup of water.The batter should be like a dosa\/pancake batter consistency. Mix well and keep aside.\r\n\r\nNow stuff the peppers with the potato mixture. Fill in the gap of each pepper with the potato stuffing and keep them on a plate.\r\n\r\n\r\n\r\nDip one by one into the batter coating them well on all sides and drop them gently into hot oil.\r\n\r\n\r\n\r\nDeep fry until golden, turning constantly. Deep fry 2-3 bajjis at a time. Drain the oil from the bajjis and remove them on absorbent paper.\r\n\r\n","style":["easy","modern"],"course":["snack"],"special-diet":["nut free","eggless","vegetarian","vegan","dairy free","gluten\/wheat free","pregnancy","kid friendly"],"cuisine":["North Indian"],"cook-time":"30","prep-time":"30","main-ingredient":["green chilli","peppers","potato"],"serves":"7","goes-well-with":["tomato sauce","chutney"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["bhajji","mirchi","mirchi-bajji"]}