{"id":435,"permalink":"http:\/\/www.sailusfood.com\/2007\/02\/28\/dahiwali-bharwaan-bhendi-yogurt-based-stuffed-okra\/","title":"Dahiwali Bharwaan Bhendi - Yogurt based stuffed okra","content":"Sometimes all it takes is a small bowl of pachadi with its myriad flavors or a roasted papad to bring that extra comforting taste to a meal. I wanted to make a sabzi with that extra zing to perk up our lunch (with roti and salad), when I chanced upon this recipe from a cooking magazine. \r\n\r\n\r\nRotis rolled with stuffed okras\r\nI am an okra fan and always look forward to cook it, be it a comforting stew or a simple stir fry. In today's recipe, the stuffed okras are cooked in a subtly sweet onion-tomato base which is spiced up with a zing of fresh ginger and a tangy punch from the lemon juice and chaat masala. Well, this semi-dry okra dish truly lived up to its exotic sounding name - Dahiwali bharwaan bhendi, sounds exotic, doesn't it?:). (Honestly, not always do exotic sounding names  taste good)  \r\n\r\nStuffed okras\r\nThe only ingredient to be careful with, is the lemon, which can easily overwhelm the other flavors, and remember that tender okras are best for this recipe. One tip while cooking these stuffed okras - heat a heavy bottomed skillet (preferrably an iron kadai), drizzle with some oil, on high heat, add these stuffed okras and stir fry them constantly for approx 6-7 mts. This way the okras are lightly browned while retaining a slight crunch and you will not have the problem of slithers. Just ensure that you are by the stove stirring it all the time. (The original recipe didn't recommend this method, but believe me, it works!). The okra is now ready to go into the cooked onion-tomato base. Now for the adapted recipe -\r\nDahiwali Bharwan Bhendi Recipe\r\nRecipe Source: Adapted from Savvy Cookbook Mag \r\nPrep & Cooking: 40 mts \r\nServes:3 persons \r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg tender lady fingers (okra\/bhendi)\r\n\r\n1 tsp cumin seeds\r\n\r\n2 slit green chillis\r\n\r\n3 cloves garlic finely minced\r\n\r\n1\" ginger finely minced\r\n\r\n2 big onions finely sliced\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/2 tsp kashmiri chilli pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\n2 tomatoes finely chopped\r\n\r\n1 tbsp ghee (you can use a wee bit more)\r\n\r\nsalt to taste\r\n\r\n2 tbsp hung curd\r\n\r\nFor stuffing:\r\n\r\n1 1\/2 tbsps roasted channa powder (dalia\/putnala pappu)\r\n\r\n1 1\/2 tbsps chaat masala\r\n\r\n1 tsp ghee\r\n\r\npinch of salt\r\n\r\nFor garnish:\r\n\r\nchopped coriander leaves\r\n\r\npinch of chaat masala \r\n\r\n1 tbsp lemon juice (adjust)\r\n\r\n\r\n\r\n1 Wash and dry the okra. Trim the okra top and ends and make a slit in the center for stuffing.\r\n2 Combine the roasted channa powder, chaat masala, salt and ghee and stuff the okras. Drizzle a kadai with some oil, on high heat, add the stuffed okras and constantly keep stirring them for approx 6-7 mts till they are nicely browned. Turn off heat. Remove and keep aside.\r\n3 Heat ghee in a kadai, add cumin seeds and let them crackle. Add the ginger, garlic and green chillis. Saute for a few seconds.\r\n4 Add the sliced onions and saute till transparent. Add the turmeric and red chilli pwd. Combine.\r\n5 Add the tomatoes and salt, combine and cook covered for 5-7 mts on medium heat (do check and stir inbetween). \r\n6 Add the slightly cooked stuffed okras and cook on medium heat for 4-5 mts (uncovered). Now, on high flame, keep stirring and cook till the okras are soft and done (approx 8-10 mts).\r\n7 Turn off heat, adjust salt and chaat masala. Add the lemon juice and mix in the hung curd. Garnish with fresh coriander leaves and serve with hot rotis or rice.\r\n\r\nDahiwali Bharwaan Bhindi\r\nKitchen Notes: Carefully trim the stems and tips without exposing the seeds inside and before doing that ensure that the okra is completely dry.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/dahi_bhendi1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dahi_bhendi1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dahi_bhendi1-300x300.jpg","main-ingredient":["okra"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"]}