{"id":4368,"permalink":"http:\/\/www.sailusfood.com\/2009\/10\/17\/diwali-sweets-teepi-gavvalu-besan-laddu-halwa-boorelu\/","title":"Diwali Sweets ~ Teepi Gavvalu, Besan Laddu & Halwa Boorelu","content":"Wishing all my dear readers, visitors and friends a happy and safe Deepavali! \r\n\r\nBesan Laddu, Bellam Gavvalu & Halwa Boorelu\r\n\r\nLast year for Diwali, I blogged Badam Halwa, Bobbatlu and Paramannam. This Diwali also I have a delicious realm of 3 rich sweet recipes for my dear readers ~ Teepi Gavvalu, Besan Laddu and Halwa Boorelu. It took me almost 3 hours to prepare them. Worth the effort with loved ones relishing them and showering me with praises. :)\r\n\r\nTeepi aka Bellam Gavvalu\r\n\r\nTeepi Gavvalu (literally translated as sweet shells), a traditional Andhra pindi vantakam prepared with all purpose flour and jaggery. Maida dough is used to prepare small shells that are deep fried to a golden brown shade and coated with paakam aka syrup made with sugar or jaggery. Usually prepared using a gavvala chekka (mould) but I couldn't find it at the time of preparation and hence used a grater to prepare the shell shaped gavvalu. \r\n\r\nGavvalu before frying - Gavvalu\r\n\r\nTeepi Gavvalu Recipe\r\nCooking Time: 45 mts\r\nMakes 50-60 gavvalu\r\n. \r\n\r\nIngredients:\r\n\r\n1 1\/4 cups maida\r\n\r\n3-4 tbsps sooji (optional)\r\n\r\n2 tbsps melted ghee\r\n\r\npinch of salt\r\n\r\nwater as required\r\n\r\noil for deep frying\r\n\r\nSyrup for coating gavvalu:\r\n\r\n1\/4 cup grated jaggery or sugar\r\n\r\nenough water to immerse jaggery\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n1 Make a soft dough of maida, sooji, salt and ghee by adding enough water. Keep aside for 15 mts. Make small marble sized balls. Use the back of fork or a grater to shape each ball like a shell as shown in the image above. Use thumb to press each ball gently onto the fork\/grater to roll into a shell shape. Prepare shells with all prepared balls and keep aside.\r\n2 Take a heavy bottomed vessel, add the jaggery and water and let it melt. Cook till the syrup becomes thick. To check the correct syrup consistency, drop some syrup into a bowl of water and if turns into a soft ball, its the right time to turn off heat. Add cardamom pwd and turn off heat.\r\n3 Heat a heavy bottomed vessel, add enough oil for deep frying, once the oil turns hot, add the gavvalu and deep fry to a golden brown shade. Remove onto absorbent paper and immediately add to the syrup. Combine well to coat the gavvalu and let it reach room temperature. Store in air tight container.\r\n\r\nBesan Laddu\r\n\r\nThe key to this a good Besan Laddu is to fry the besan till the rawness disappears. Besan aka chick pea flour\/senaga pindi is roasted in a generous amount of ghee and mixed with cardamom flavored sugar syrup before binding the resultant mixture into round laddus.\r\n\r\nRoasted besan - Besan ladoos\r\n\r\nBesan Laddu Recipe\r\nCooking Time: 45 mts\r\nMakes approx 24 small laddus\r\n. \r\n\r\nIngredients:\r\n\r\n2 cups besan\/senaga pindi\/bengal gram flour\r\n\r\n1 cup sugar\r\n\r\n1\/4 cup water\r\n\r\n1\/4 cup ghee, melted\r\n\r\n3\/4 tsp cardamom pwd\r\n\r\n1 tbsp ghee\r\n\r\npinch of salt\r\n\r\n1 Take a heavy bottomed vessel and add besan. Roast on low-medium flame for 5 mts. Add the melted ghee and further roast for another 12-14 mts till you get a nice roasted aroma. Turn off heat and let it cool. \r\n2 Make a syrup of sugar by adding water and the sugar melts completely. Cook for 4-5 mts till a thin syrup is formed. Add cardamom pwd and combine.\r\n3 Add this syrup to the roasted besan and combine with a wooden spoon. Let it cool till warm enough to handle.\r\n4 Grease your hand with ghee and take a small portion of the mixture and shape into a round ball.\r\n5 Prepare laddus with rest of the besan mixture. Store them in an air tight container. Stays fresh for a few days.\r\n\r\nHalwa Boorelu\r\n\r\nI had earlier blogged about Boorelu with channa dal stuffing. The version I'm blogging today calls for sooji halwa stuffing. \r\n\r\nHalwa balls - Halwa boorelu\r\n\r\n Halwa Boorelu Recipe\r\nPrep & Cooking: 1 hour, Soaking: 2 hours\r\nMakes approx 32 boorelu\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 cup cup black gram dal\/urad dal\/minappappu \r\n\r\n1 cup rice\r\n\r\n1 tsp grated jaggery \r\n\r\npinch of salt\r\n\r\nFor halwa stuffing:\r\n\r\n1 cup sooji\/semolina\/upma rava\r\n\r\n1\/2 cup sugar (adjust to suit your taste)\r\n\r\n1\/4 cup water\r\n\r\nlittle less than 1\/4 cup melted ghee\r\n\r\n3\/4 tsp cardamom powder\r\n\r\n\r\n\r\n1 Drain water from the black gram dal and rice and grind to fine paste adding little water. It should be like a dosa batter. Add a pinch of salt and jaggery and mix well. Leave aside covered. \r\n2 Heat a vessel, add sugar, cardamom pwd and water and let the sugar melt completely. Bring to a boil and turn off heat. Keep aside.\r\n3 Take a heavy-bottomed vessel, add the melted ghee, add sooji and fry for 7-8 mts constantly. Slowly add the sugar syrup (be careful as the syrup might splash) and keep stirring and cook till it appears like a thick paste, stirring continuously. Cook on low flame for 3-4 mts. Turn off heat and cool.  \r\n4 When the halwa is warm enough to handle, grease palms and make small balls as shown in the image above and keep aside. \r\n5 Heat enough oil in a wide heavy bottomed vessel for deep frying. Dip each ball in the rice-dal batter and let it coat evenly and place in the oil and deep fry till golden brown. You can deep fry a batch of four to five balls depending on the size of the vessel. \r\n6 Serve warm. Store in an air tight container as they last for at least 3-4 days.\r\n\r\nNote: Ensure that the rice-dal batter is thick so that it coats the balls evenly and holds shape. You can use the left over batter to make savory balls by adding a little more salt, cumin seeds, chopped onions, coriander leaves and green chilli paste. Deep fry these savory balls till golden brown.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/10\/halwa-borelu-gavvalu-besan-ladoo.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/halwa-borelu-gavvalu-besan-ladoo-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/halwa-borelu-gavvalu-besan-ladoo-300x300.jpg","main-ingredient":["sugar","flour","chickpea flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Flour Recipes","Indian Sweets Recipes"],"tags":["diwali-sweets","mithai"]}