{"id":441,"permalink":"http:\/\/www.sailusfood.com\/2007\/03\/06\/paneer-fajitas\/","title":"Paneer Fajitas ","content":"Today, I made a Mexican inspired appetizer, Paneer fajita (fah-he-tah) which is very simple and tasty - just marinate, grill and eat! With the onset of summer, these fajitas make a great appetizer for barbecues or an evening tiffin for our kids, a great way to get them eat vegetables and remember, its a healthy snack. The best part of fajitas is they can be made with practically anything, vegetables, meat, chicken and seafood. I love that!-:)\r\n\r\n\r\nThe traditional method of preparing the fajitas is by grilling them, but they can also be pan fried and if using meat, oven broiling works (meat requires more marinating time than vegs and paneer). Its the marinade which holds the key to a good fajita. Vinegar or lemon juice is a must to lend a sour flavor. As told by a chef friend who used to work at a multi cuisine food joint - \"experiment with anything which has a sour flavor like orange juice or even a coke\". Well, I haven't got that creative yet.:). \r\n\r\nI'd love to learn more about marinades for fajitas if you'd like to share. Tried and tested recipes of fajitas (veg\/non-veg) are also welcome..:).\r\n\r\n\r\nPaneer Fajitas Recipe\r\nPrep & Cooking: 15 mts, marinate time: 30 mts \r\nMakes approx 15-20 fajitas\r\nCuisine: Mexican inspired \r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg paneer, squares\r\n\r\njuice of 1 lime\r\n\r\n1 tbsp olive oil\r\n\r\nsalt to taste\r\n\r\n2 tbsps red chilli flakes\r\n\r\n1 tsp mustard pwd\r\n\r\n1 tbsp Worcestershire sauce (optional)\r\n\r\npinch of cumin pwd \r\n\r\n2 tbsps sesame seeds\r\n\r\n1\/2 tsp dried parsley\r\n\r\nFor salad:\r\n\r\n1 onion, finely sliced\r\n\r\n1 capsicum, finely sliced\r\n\r\n1 tomato, finely sliced\r\n\r\nfistful boiled green peas\r\n\r\nfistful boiled sweet corn\r\n\r\na small cup of finely sliced cabbage\r\n\r\nfresh parsley for garnish\r\n\r\nsalt to taste\r\n\r\npepper to season\r\n\r\n1 tsp lemon juice (optional)\r\n\r\n\r\n\r\n1 Marinate the paneer squares with lemon juice, olive oil, worchestshire sauce, cumin pwd, mustard pwd and dry parsley and salt for 30 mts.\r\n\r\n2 Combine sesame seeds and chilli flakes in a small bowl. Coat both the sides of the paneer in this and place them on a greased baking tray or a grill. \r\n3 Grill the paneer in a pre-heated oven for 10 mts, till the paneer attains a light brown shade.\r\n4 Saute the vegetables for salad, season with salt, arrange on a serving plate, sprinkle some parsley on top and place the grilled paneer fajitas on the salad. Serve hot with salsa.\r\n\r\n\r\n\r\nNote:Do visit this website for more information on Mexican recipes and cooking classes. The above recipe was originally prepared by Manju Sethia who also designed the taco maker.\r\nI, in turn, learnt it from one of her student, Alka.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/paneer-fajitas.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/paneer-fajitas-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/paneer-fajitas-300x300.jpg","main-ingredient":["paneer"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Milk Recipes","Indian Paneer Recipes","Indian Snacks and Starter Recipes","Mexican Recipes","Tandoori Recipes"],"tags":["paneer","snacks"]}