{"id":445,"permalink":"http:\/\/www.sailusfood.com\/2007\/03\/09\/allam-kothimira-pachadi-ginger-coriander-chutney\/","title":"Allam Kothimira Pachadi - Ginger-Coriander Chutney","content":"I love coriander. Each of my visits to the rythu bazaar is incomplete without buying a bunch of farm fresh coriander. I have to buy it in spite of having some already lying in my fridge. So how do I use up the bunch lying in the fridge? Prepare allam kothimira pachadi! \r\n\r\nThis coriander based ginger chutney is one classic pachadi I keep returning to very frequently  much to the annoyance of Satish who usually enjoys a wide variety of chutneys each week with  idlis and dosas. Not that he doesn't enjoy this chutney, its just that he feels that I make it pretty often.:) Obviously I will. You see, the coriander season is coming to an end here when there will be a shortage of fresh coriander and even if its available (quite rare) the price shoots up even for a small bunch. And I want to relish it as much as I can when in season.:)\r\n\r\nAm not one to be deterred by lack of fresh coriander because the mango season is just around the corner.:) Yay! Just replace the coriander leaves with some grated green mango and you have an irresistable lip-smacking pachadi to go with rice. \r\n\r\nI love the flavors of this fragrant tangy-fiery-sweet chutney. Yes, its fiery and if your one who just can't take spice, cut down on the size of ginger piece and chillis but do add either a dried red or green chilli. It sure gives a distinctive taste to the pachadi. Makes a great pachadi with idlis and dosas but also goes well with hot rice and a dollop of ghee. Just remember to reduce the quantity of water while grinding to make it more like a thick coarse paste if preparing to eat with rice. Be sure to use clear, smooth tender ginger root and not the mature or shrivelled looking one. When you slice the ginger, your knife should cut through smoothly without much effort. \r\nAllam-Kothimira Pachadi Recipe\r\nPrep & Cooking: 15-20  mts\r\nServes 2-3 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2\" to 2\" ginger root, remove skin, slice (reduce if you can't take spice)\r\n\r\n1 tbsp grated coconut (optional)\r\n\r\n1 big bunch chopped coriander leaves (about 1 1\/2 cups)\r\n\r\n1 tbsp split black gram dal (minapa pappu)\r\n\r\n1 tsp  bengal gram (senaga pappu) (optional)\r\n\r\n1 tsp coriander seeds\r\n\r\n1-2 green chillies (adjust to suit your spice level)\r\n\r\n1-2 dry red chillis (adjust to suit your spice level)\r\n\r\nbig pinch asafoetida (hing)\r\n\r\nsmall lemon sized tamarind\r\n\r\n2-3 tbsps grated jaggery\r\n\r\n1\/4 cup water (adjust)\r\n\r\nsalt to taste\r\n\r\n1 tbsp oil\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/2 tsp split black gram\r\n\r\n6-7 fresh curry leaves\r\n\r\n1 tsp oil or ghee\r\n\r\n\r\n\r\n1 Heat a tsp of oil in a non-stick pan. Add the split gram dal, bengal gram and let them turn slightly red and a nice aroma emanates. Add the coriander seeds and toss for 15-20 secs. Add the red chilli and green chillis and saute for a few secs more. Finally add the asafoetida and immediately remove and keep aside.\r\n2 In the same pan, add the remaining oil, add ginger and saute till it turns red (approx 3 mts). Add the coriander leaves and saute further for a minute. Remove from heat and cool.\r\n3 Grind the roasted dal mixture, sauteed ginger-coriander, grated coconut, tamarind, jaggery along with salt, to a slightly coarse paste by adding about one-fourth cup of water. \r\n4 Heat oil or ghee in a pan and add the mustard seeds, let them pop and add the split gram dal and curry leaves and fry till the dal turns red. Add this seasoning to the ground pachadi. Serve with idlis, dosas or rice.\r\n\r\n\r\nKitchen Notes: Reduce the water to a few tbsps for a thicker pachadi to go with rice. You can even add a few curry leaves (8-10) while stir frying the ginger and coriander leaves. A variation is the use of mango-ginger (mamidi allam) in place of ginger root.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/idli_allam_pachadi.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idli_allam_pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/idli_allam_pachadi-300x300.jpg","main-ingredient":["ginger","coriander leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}