{"id":455,"permalink":"http:\/\/www.sailusfood.com\/2007\/03\/12\/quesadilla\/","title":"Quesadilla","content":"Over the weekend, I made some Mexican snacks - quesadillas, tacos, corn chips (nachos) with salsa and sour cream. Tacos and nachos are a regular at our home as Nehal enjoys them a lot. But I had never tried quesadilla and I've been wanting to prepare it at home, right from scratch and hence this attempt from a recipe I got from here on how to make flour tortillas. \r\n\r\n\r\n\r\nAs I was searching for a good quesadilla recipe, I found that there were many versions, each differing from region to region and like most authentic original recipes it has gone through many changes adapted to the likes of that particular region. What I learnt, quesadilla is basically a toasted tortilla with melted cheese inside and you could use vegetables\/meat as fillings. \r\n\r\nCombined with the crunch of sauteed vegetable filling and the melted cheese of the quesadilla, I was quite pleased with the end result and my son relished it. I am happy that there is one more snack variety loaded with a lot of vegetables to add to Nehal's list of evening tiffins. I'm so glad I tried it.:)\r\n\r\nQuesadilla Recipe:\r\nPrep & Cooking: 60 mts \r\nMakes approx 6-7 quesadillas \r\nCuisine: Mexican\r\n.\r\n\r\nIngredients:\r\n\r\nFor flour tortillas:\r\n\r\n1 3\/4 cups flour\r\n\r\n2 tbsps butter\r\n\r\n1\/2 tsp salt\r\n\r\n1\/2 tsp baking pwd\r\n\r\napprox 1\/2 cup warm milk or water\r\n\r\nFor the vegetable filling:\r\n\r\nonions, cabbage, beans, carrots, capsicum, baby corn, sweet corn, green peas, mushrooms, spring onions or any vegetables of your choice\r\n\r\nsalt to taste\r\n\r\nred chilli flakes\r\n\r\n3\/4 - 1 cup grated cheese\r\n\r\n1\/2 cup sour cream (optional)\r\n\r\n\r\n\r\n1 First combine all the ingredients except milk. Now slowly add the warm milk or water to knead to a soft dough, kneading well for 4-5 mts. Keep aside for 15 mts and during this sitting time of dough, prepare the vegetable filling.\r\n2 Make lemon sized balls of the dough and using a rolling pin to roll out like very thin rotis of approx 8\"-9\" size. \r\n3 Pre-heat a griddle and place each tortilla on the hot griddle for only 4-5 seconds on each side and remove. They shouldn't be roasted brown at this stage. Keep aside all the lightly toasted tortillas.\r\n\r\n\r\n\r\nFor the vegetable filling:\r\n4 The vegetables I used were grated carrots, finely chopped cabbage, capsicum, baby corn, onions, sweet corn, grated paneer, tomatoes and coriander leaves. Saute the garlic first  followed by the vegetables in olive oil for 3 mts, season with salt and red chilli flakes. (you can skip the saute part).\r\n\r\n\r\n\r\n5 Take the vegetable filling and place in the centre of each tortilla, spread a tbsp of sour cream, sprinkle grated cheese and wet the edges of the tortilla with water. Place another tortilla on top and press the edges. Take a fork and press along the edges as shown in the picture above.\r\n6 Pre-heat a griddle and on medium heat roast both sides of the quesadilla flipping over to toast both sides. Ensure that you cook it over medium heat, you want the cheese to melt inside. Drizzle some oil if you want while frying the quesadilla. Remove quesadilla onto a serving plate, slice into triangles with a pizza cutter and serve hot with salsa or tomato sauce. \r\n\r\n\r\nHow to make a flour tortilla?\r\nHistory and versions of quesadilla ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/vegetable_filled_tortilla_before_frying.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable_filled_tortilla_before_frying-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vegetable_filled_tortilla_before_frying-300x300.jpg","main-ingredient":["flour","beans"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Mexican Recipes"],"tags":["Add new tag","snacks","vegetables"]}