{"id":4556,"permalink":"http:\/\/www.sailusfood.com\/2009\/11\/03\/rasam-spiced-tamarind-soup\/","title":"Rasam","content":"My foray into rasam making wasn't very impressive during the many trial and error sessions of my early kitchen days. I would try numerous versions to replicate a flavor that I tasted at my Tamilian friend's home or at a restaurant in Coimbatore or elsewhere during my travels to Tamil Nadu. Each home has its own version of rasam and trying to replicate a particular flavor wasn't easy. I am yet to master the perfect 'rasam'. Today's recipe is the very basic rasam using home made rasam powder. Hope to blog other versions of 'rasam' in future posts.\r\n\r\nRasam\r\n\r\nWith its concoction of spices, tamarind and tur dal, rasam is a cold weather favorite, tastes heavenly as well as warms the body and the taste buds. I always look forward to drinking rasam even though I prepare it almost every other day, well, at least 4 days a week. To me, its the best part of the meal. Yes, you read right. My meal would be incomplete without rasam. Even more so, today, since we had a cold, breezy and rainy morning. The aroma of  ghee tempered spices is enticing to say the least and as it sizzles its way into the boiling spiced broth, it gives a totally different flavor dimension to the rasam. Fresh coriander leaves improve and enhance the flavor.\r\n\r\nThis rasam powder recipe should last a month, if you prepare rasam at least 2-3 times a week. Ensure you use fresh spices since the key to a good rasam is in its fresh spices.\r\n\r\nHow to make rasam powder \r\n\r\n\r\n Rasam Powder Recipe\r\nPreparation: 215 mts\r\nServes 4-5 persons\r\nCuisine: South Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\nlittle less than 1\/4 cup tur dal\/red gram dal\/kandi pappu \r\n\r\n10 dry red chillis\r\n\r\n1\/4 cup coriander seeds\r\n\r\n1 tbsp cumin seeds\r\n\r\n1 tsp fenugreek seeds\r\n\r\n1 tsp mustard seeds\r\n\r\n1 tbsp pepper corns\r\n\r\n1\/2 tsp asofoetida\r\n\r\nfew curry leaves \r\n\r\n\r\n\r\n1 Dry roast all the dal till red, remove and keep aside. Next roast coriander seeds for 4 mts and remove. Add the remaining ingredients, except asafoetida and curry leaves and dry roast for 3-4 mts on low to medium flame. Remove and cool. Roast the curry leaves till they wilt and turn crisp, don't burn it. Remove and cool. Grind all the roasted and cooled ingredients along with asafoetida to a coarse powder. Store in an air tight container.\r\n\r\n\r\n Rasam Recipe\r\nPreparation: 25-30 mts\r\nServes 4-5 persons\r\nCuisine: South Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/4 cup tur dal\/red gram dal\/kandi pappu \r\n\r\n1 large tomato, chop into small pieces\r\n\r\nbig pinch turmeric pwd\r\n\r\n2 tsps rasam pwd\r\n\r\ntamarind, small lemon size, extract juice in half a cup of water\r\n\r\n3\/4 tsp jaggery (optional)\r\n\r\nfew fresh curry leaves\r\n\r\nsalt to taste\r\n\r\n3 cups water\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\npinch of asafoetida\/hing\/inguva\r\n\r\n1 dry red chilli, de-seed and tear\r\n\r\nfew fresh curry leaves\r\n\r\n1-2 tsps ghee\r\n\r\n\r\n\r\n1 In a pressure cooker, place a cup of tur dal, turmeric pwd, pinch of hing and 1  cup of water and pressure cook upto 3 whistles. If cooking over stove top, cook till the dal is soft. Mash dal and keep aside.\r\n2 Heat a deep vessel, add 3 cups of water, mashed dal, chopped tomatoes, tamarind extract, salt, turmeric pwd, few fresh curry leaves, pinch of jaggery and rasam pwd and bring to a boil. Continue to boil for 2-3 mts.\r\n3 Heat oil in a pan, add mustards seeds and as they splutter, add red chillis and curry leaves and stir fry for a few seconds. Add asafoetida and turn off heat.\r\n4 Add this to the rasam and combine. Turn off heat and place lid. Garnish with coriander leaves and serve with white rice and appadams.\r\n\r\n\r\nRasam","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/10\/rasam-tamarind-soup.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rasam-tamarind-soup-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rasam-tamarind-soup-300x300.jpg","style":["traditional"],"course":["soup"],"special-diet":["vegetarian","vegan"],"cuisine":["south indian"],"cook-time":"20","prep-time":"5","main-ingredient":["tamarind"],"serves":"4","goes-well-with":["rice"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Dal Recipes","Indian Snacks and Starter Recipes","Indian Soup Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["tamarind"]}