{"id":46,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/09\/minappa-sunni-undalu-black-gram-lentil-sweet\/","title":"Minappa Sunnundalu - Black Gram Lentil Sweet","content":"\r\n\r\nMinappa Sunnundalu (Urad Dal Laddo) is a traditional Andhra sweet dish that is simple to prepare. Can be stored in an air tight container for at least 2 weeks.\r\n\r\nIngredients:\r\n\r\n1 cup black gram lentil (without husk)\r\n1 tbsp raw rice\r\n1 cup granulated sugar\r\n1\/2 cup ghee\/clarified butter\r\n\r\nDry roast raw rice in a vessel till red on low to medium flame and remove. Now dry roast black gram on a low to medium flame till deep red and till you get a nice aroma, which could take at least 18-20 minutes. You should keep stirring the dal while dry roasting, lest it burns. Remove and allow it to cool. Blend both the raw rice and black gram to a fine powder. Keep aside.\r\nHere's a picture of the black gram dal both before and after dry roasting it.\r\n\r\n\r\n\r\nBlend the sugar to a fine powder. Keep aside. Heat ghee till it melts. Do not over heat. Keep aside.\r\n\r\n\r\n\r\nNow mix together black gram powder and powdered sugar in a wide plate. Slowly add hot ghee and keep mixing with hand, till the mix holds together.\r\n\r\n\r\n\r\nShape into round balls of the size of a big lime.The ghee should be just enough to hold the powders together and not drip while making balls.\r\n\r\nStored the sunnundalu in an air tight container. Stay fresh for at least 2 weeks.\r\n\r\nVariations\r\nA combination of jaggery and sugar can be used. Take 3\/4 cup jaggery and 1\/4 cup powdered sugar.\r\n\r\nTip\r\nMixture of black gram powder and sugar can be stored in an air tight container for 1-2 months. When ever required mix melted hot ghee and make balls.","style":["easy","traditional"],"course":["dessert"],"special-diet":["nut free","eggless","vegetarian","dairy free","gluten\/wheat free","kid friendly","pregnancy"],"cook-time":"30","prep-time":"10","main-ingredient":["urad dal","sugar","ghee"],"serves":"12","author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Dal Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["laddu","sunnundalu","urad dal"]}