{"id":463,"permalink":"http:\/\/www.sailusfood.com\/2007\/03\/14\/corn-chips-with-salsa-sour-cream\/","title":"Corn Chips with Salsa & Sour Cream","content":"Today I'm blogging three recipes - corn chips, tomato salsa and sour cream! At time, I get into those moods where I want to prepare dishes inspired by a cuisine different from the usual everyday food. So, during the weekend it was an all Mexican cuisine at home. \r\n\r\nEating Mexican food felt comforting, flavorful on the palate and filling on the stomach and you find a lot of culinary similarities between Indian and Mexican cuisines. Especially in the use of chillis, tortillas bearing a close resemblance to our roti, salsas to our chutneys, rich sauces to our curries and beans to our staple dal. As learnt from my chef friend the other food similarities are the regular use of coriander\/parsley, garlic, onions, tomatoes, mango, lemon, plantain, coconut, corn and rice. I think he mentioned many more but these are what I recollect. \r\n\r\n\r\n\r\nCorn chips are Nehal's favorite chips and I make variations by adding blanched and pureed spinach to the dough for green colored chips and cooked beetroot puree for red chips. Another variation I try is adding dried parsley and fresh coriander to the dough. \r\n\r\nCorn Chips Recipe\r\nPrep & Cooking: 15-20 mts, sitting time: 10 mts\r\nCuisine: Mexican\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups makai ka atta (finely ground maize flour)\r\n\r\n1 cup maida\r\n\r\n1 tbsp oil\r\n\r\n3\/4 tsp salt\r\n\r\n1 tbsp dried parsley \r\n\r\n1 tsp red chilli flakes\r\n\r\nluke warm water for mixing dough\r\n\r\n1 Sieve both the flours together. Add oil, salt, dried parsley and red chilli flakes and combine. Add luke warm water and make a soft dough similar to a roti dough. \r\n2 Make lemon sized balls and roll out thinly with a rolling pin, dusting some flour as you roll them into 9\"-10\" size rotis or rounds. Prick lightly with a fork.\r\n\r\n3 Toast the rolled out roti lightly on both sides for a few seconds on a hot griddle. Remove and cut into desired shape of chips. \r\n3 Heat oil in a heavy bottomed vessel and deep fry the chips till golden brown. Drain onto absorbant paper. Serve with salsa and sour cream. You can store them in air tight containers. \r\n\r\nNote: You can alternately bake them crisp.\r\n\r\nRead more about corn chips.\r\n\r\nThis is one salsa recipe I always rely upon and has always been a hit with friends and I love it for its versality - makes a good dip, dressing for a salad, serves as a sauce for spaghetti or a spread over an omlette. This recipe is neither too spicy not too thick and works well for me.\r\n\r\n\r\n\r\n\r\nTomato Salsa Recipe\r\nPrep & Cooking: 15 mts, baking time: 15 mts\r\nCuisine: Mexican\r\n.\r\n\r\nIngredients:\r\n\r\n6-7 bright red tomatoes\r\n\r\n2 big capsicum, cut into 4 longitudinal pieces\r\n\r\n4-5 green chillis\r\n\r\n4-5 cloves garlic with skin\r\n\r\n1 onion finely chopped\r\n\r\nolive oil to coat the vegetables\r\n\r\njuice of half a lemon\r\n\r\nsalt and pepper to taste\r\n\r\n1\/2 tsp sugar\r\n\r\nfresh parsley, chopped\r\n\r\n\r\n1 Pre-heat oven. Coat tomatoes, capsicum, green chillis and garlic with olive oil such that they are oiled all over. Arrange in a greased shallow baking tray and keep  and broil 10-12 mts. Remove and cool.\r\n\r\n2 Discard the skin of garlic, the tomato cores and skin. Combine the garlic, tomatoes, capsicum and green chillis in a bowl and using a hand blender, puree roughly. Alternately, run in a mixer grinder for a few seconds. Be careful not to make a smooth paste of it. It should be chunky and coarse.\r\n3 Add chopped onions, salt, pepper, sugar and fresh parsley to the coarse paste and your salsa is ready. Serve with nachos, tacos and quesadillas.\r\n\r\nNote:You can store salsa in the refrigerater for a few days and in that case don't add the onions. Add onions only  at the time of serving.\r\n\r\nRead more about the different versions of salsa.\r\n\r\nThis recipe of sour cream works best with malai (top of milk) or Amul cream. You will require atleast a cup of malai and you might not always have it on hand and also its high fat. The next best option is slightly hung curd. You need to blend the cream\/curds smoothly and as you pour the lemon juice you will find that the cream thickens. \r\n\r\n\r\n\r\n\r\nSour Cream Recipe\r\nPrep & Cooking: 10 mts\r\nCuisine: Mexican\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup malai\/Amul cream\/slightly hung curd (at room temp)\r\n\r\napprox 5-6 tbsp lime juice\r\n\r\nsalt to taste\r\n\r\n1 tbsp dried parsley \r\n\r\n1\/2 red chilli flakes\r\n\r\n1 tbsp fresh parsley chopped\r\n\r\n1 Take a bowl, add the cream, chilli flakes, dried parsley, salt and combine well. Blend the mixture slowly till it form a smooth consistency.\r\n1 Now slowly add the lemon juice and keep blending smoothly and you will find that the cream will begin to thicken. Add lemon juice till it reaches a sour stage. \r\n1 Add the chopped parsley and chill. Serve chilled sour cream with nachos, tacos, quesadillas or mexican rice.\r\n\r\nRead more about sour cream. \r\n\r\nNote:Do visit this website for more information on Mexican recipes and cooking classes. The above recipes were originally prepared by Manju Sethia.\r\nI, in turn, learnt them from one of her student, Alka.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/corn_chips.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/corn_chips-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/corn_chips-300x300.jpg","main-ingredient":["maize flour"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","Mexican Recipes"],"tags":["chips","popular","salsa","snacks"]}