{"id":47,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/10\/gutti-dondakaayi-stuffed-gherkinstondli\/","title":"Gutti Dondakaya  - Stuffed Gherkins (Tondli)","content":"These oblong shaped vegetables are an unusual treat to an otherwise monotonous meal. They lend themselves well to stuffing, slicing, frying, etc. Gherkins (Tondli, Dondakai) tastes great cooked by itself, or as a combination with other vegetables. Take care to wash hands immediately after cutting the vegetable, since it tends to stain fingers and make them rough. Always nip of a tiny piece off the top and base tip, before cutting, stuffing.\r\n\r\n\r\n\r\nToday, its Amma's recipe called Gutti Dondakaya (Stuffed Dondakaya). In Andhra we use dondakaya a lot in our cooking. You can also use the same method for cooking stuffed brinjals\/egg plant.\r\n\r\n\r\n\r\nIngredients:\r\n\r\n\r\n1\/4 kg fresh tender dondakayalu (gherkins, tondli, tindora, kunthroo)\r\n4 dry whole red chillis\r\n1\/2 cup roasted channa dal (dalia, putanala pappu)\r\n1 tsp cumin seeds\r\n7-8 garlic flakes, peeled\r\nsalt\r\noil for deep frying\r\n10-12 curry leaves\r\n\r\nClean the gherkins and make a vertical slit on one side length wise..i.e each gherkin should be intact and not cut into two pieces.\r\nHeat oil for deep frying the slit gherkins. Deep fry the gherkins till slightly brown and cooked. Remove on absorbent paper and cool.\r\n\r\n\r\n\r\nIn the same oil add curry leaves and fry for few secs. Remove and cool.\r\nDry roast cumin seeds and red chillis. Cool. Now blend to a fine powder cumin seeds, red chillis, roasted channa dal and garlic.\r\nStuff this powder in the fried gherkin slits.\r\n\r\n\r\n\r\nHeat 1 tbsp oil in a skillet and add the stuffed gherkins and fry on medium heat for 3 minutes, stirring.\r\nRemove onto a dish and garnish with fried curry leaves.\r\nServe with rice.","style":["easy","modern"],"course":["side"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","gluten\/wheat free","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"25","prep-time":"20","main-ingredient":["ivy gourd","tindora"],"serves":"5","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["dondakaya","ivy-gourds","tendli","tindora"]}