{"id":4780,"permalink":"http:\/\/www.sailusfood.com\/2009\/12\/23\/kobbari-burfi-coconut-sweet\/","title":"Kobbari Burfi ~ Coconut Sweet","content":"Coconut Burfi\r\n\r\nWith Christmas round the corner, I am spending more time in the kitchen baking cookies and cakes and preparing traditional sweets. I made Gulabi Puvvulu, popularly known as Rose Cookies on Sunday and today it was Coconut Burfi. We usually make Kobbari Undalu using grated coconut and jaggery. Decided on trying my hand at coconut burfi\/paakam that calls for the use of sugar instead of jaggery. This is my first attempt at making Coconut Burfi and am yet to perfect it. Its all in the sugar syrup consistency. \r\n\r\n&nbsp;Cooked coconut-sugar mixture spread out on greased thali ~ Kobbari Louz\r\n\r\nKobbari Paakam Recipe\r\nPreparation: 15 mts Cooking Time: 40 mts\r\nMakes approx 15-16 squares\r\n. \r\n\r\nIngredients:\r\n\r\n2 cups grated coconut\r\n\r\n1 1\/2 cup sugar\r\n\r\n1\/2 cup water\r\n\r\n1 tbsp ghee, melted\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n1 Take a heavy bottomed vessel, add water and sugar and on medium low flame allow the sugar to dissolve and come to a boil. Stir it and allow the syrup to thicken. Let the sugar syrup cook and thicken till it reaches 2 string consistency. Test the syrup by using your thumb and index finger and touch the sugar syrup and as your stretch the syrup, it should form at least 2-3 threads. This takes approx 15-18 mts.\r\n2 Immediately at this stage add the grated coconut, ghee and cardamom pwd and stir. Stir at regular intervals till the mixture appears thick and leaves the sides of the vessel. This could take about 15-18 mts. Turn off heat.\r\n3 Immediately pour the mixture on to a greased thali (use ghee to grease) and spread out evenly with a spatula. Allow to cool and slightly harden. Cut into desired shapes and cool completely before storing in an airtight container.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/10\/kobbari-burfi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kobbari-burfi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kobbari-burfi-300x300.jpg","main-ingredient":["coocnut","sugar"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Sweets Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["burfi","coconut","kobbari"]}