{"id":4822,"permalink":"http:\/\/www.sailusfood.com\/2009\/11\/05\/beerakaya-thokku-pachadi-rigde-gourd-turai-skin-chutney\/","title":"Beerakaya Thokku Pachadi ~ Rigde gourd skin Chutney","content":"Ridge gourd is one vegetable that I find regularly at my neighbourhood rythu bazaar (farmer's market). Always buy 1\/2 kg on almost every visit since our family relishes it. The peel which is high in fibre is edible and need not be thrown away. Use it to prepare a tangy spiced chutney.\r\n\r\nBeerakaya Thokku Pachadi\r\n\r\n\r\nThe texture is slightly coarse and the flavor is something beyond your imagination. Healthy high fibre food at its best. Those first timers tasting this pachadi are sure to be won over and will regret throwing away the peels every time they cooked a ridge gourd dish. Their reaction would be \"Wow! A turai peel can yield so much flavor?!\"  Seriously! Dollop of ghee, rice and beerakaya thokku (peel\/skin) pachadi and you are on the road to heaven. \r\n\r\nYou can look forward to another ridge gourd peel chutney recipe that calls for garlic, in future posts. \r\n\r\n\r\nBeerakaya Thokku Pachadi Recipe\r\nPrep & Cooking: 20 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\nskin of 2 large ridge gourds, wash and peel the skin (prepare another dish with the peeled ridge gourd)\r\n\r\n2 green chillis\r\n\r\n1-2 dry red chillis, tear and de-seed\r\n\r\n1 tbsp split gram dal\/minappa pappu\r\n\r\n1 tsp cumin seeds\r\n\r\nvery small lemon sized tamarind\r\n\r\n2 tsps oil\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1-2 dry red chillis\r\n\r\nbig pinch asafoetida\/inguva\/hing \r\n\r\nfew fresh curry leaves\r\n\r\n1\/2 tsp oil\r\n\r\n\r\n\r\n1 Heat a tsp of oil in a cooking vessel, add split gram dal, cumin seeds and red chillis and stir fry for a few seconds till the dal turns red. Remove and keep aside.\r\n2 In the same vessel, add another tsp of oil and add the green chillis and saute for a mt. Add the ridge gourd peels (chop them into small pieces) and fry on medium heat for 4-5 mts. Add the tamarind to it and leave aside to cool.\r\n3 Once cool, grind the dal-cumin-red chillis first till coarsely ground, add the rest of the sauteed ingredients along with tamarind and salt and grind to a slightly coarse paste. \r\n4 Heat half a tsp of oil in a pan, add mustard seeds and let them pop, add curry leaves and dry red chillis followed by asafoetida and stir fry for a few seconds. \r\n5 Pour the seasoning over the ground pachadi and serve with hot rice.\r\n\r\n\r\nRidge gourd peel chutney\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/11\/beerakaya-thoku-pachadi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/beerakaya-thoku-pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/beerakaya-thoku-pachadi-300x300.jpg","main-ingredient":["ridge gourd"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["beerakaya","pachadi"]}