{"id":484,"permalink":"http:\/\/www.sailusfood.com\/2007\/03\/22\/mamidikaya-pulihora-green-mango-rice\/","title":"Mamidikaya Pulihora - Green Mango Rice","content":"Our Ugadi festive meal was simple and not elaborate. I prepared mamidikaya pulihora, carrot kothimira pachadi, mokka jonna garelu (corn vadas), pesarappu payasam, white rice, rasam, vadiyalu, fried dried green chillis and curd. On Ugadi we celebrate the season's fresh produce of mangoes by preparing Mamidikaya Annam (green mango rice), a South Indian rice delicacy, prepared on the same lines as lemon rice (nimmakaya annam) and is the most simple and easiest recipe one can ever make. \r\n\r\n\r\nUgadi pachadi, pesarapappu payasam, perugu, mamidikaya pulihora, vadiyalu, majiga mirapakayalu, carrot kothimira pachadi, mokka jonna garelu\r\nA healthy rice dish unlike most pulaos and biryanis which call for a generous amount of oil or ghee. The key to this rice dish is mango which lends it a tangy flavor and is counter balanced with a fragrant tempering of dals, chillis, curry leaves and a good measure of peanuts.\r\nMamidi Kaya Pulihora Recipe\r\nPrep: 15 mts, Cooking: 15 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n3 cups cooked white rice (each grain should be seperate)\r\n\r\n1 1\/2 cups grated raw green mango (remove skin) for more tangy flavor increase \r\n\r\n5-6 tbsps roasted peanuts\r\n\r\n2 tbsps roasted cashewnuts (broken)\r\n\r\nsalt to taste\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1 1\/2 tbsp oil \r\n\r\n1 tsp mustard seeds\r\n\r\n1 tbsp channa dal\r\n\r\n1 tbsp split black gram dal\r\n\r\n3-4 dry red chillis\r\n\r\n6-8 slit green chillis\r\n\r\n1 tsp grated ginger (optional)\r\n\r\n1\/4 tsp asafoetida\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n15-20 curry leaves\r\n\r\n\r\n1 Heat oil in a heavy bottomed vessel and add the mustard seeds. Once they pop, add the channa dal and gram dal and let them turn red on medium heat. Now add the red chillis, green chillis, grated ginger, curry leaves, ginger, turmeric pwd and asafoetida. Toss them for a few seconds.\r\n2 Add the grated mango and stir fry it for a few mts (approx 3-4 mts). Add the roasted peanuts and cashewnuts, turn off heat and keep aside.\r\n3 Spread the cooked white rice on a wide plate, sprinkle salt and add the tempering and use your hand to combine well till the tempering is well blended with the rice. Adjust salt.\r\n4 Serve hot with vadiyalu, perugu or pachadi of your choice.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/ugadi_festive_meal1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ugadi_festive_meal1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ugadi_festive_meal1-300x300.jpg","main-ingredient":["raw mango"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Rice recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["raw_mango","rice","ugadi","vegan_recipe"]}