{"id":491,"permalink":"http:\/\/www.sailusfood.com\/2007\/03\/28\/carrot-kothimira-pachadi\/","title":"Carrot Kothimira Pachadi ","content":"All South Indian regional cuisines are famous for their innumerable pachadis, exploding with myriad flavors - sweet, sour, tangy and spicy and a combination of these flavors which each home having some of their own signature styles in terms of preparation and use of spices.\r\n\r\n \r\n\r\nAn all time favorite at our home, carrot kothimira pachadi is simple, colorful and healthy with a  pleasantly subtle blend of sweet-tangy-spicy medley of flavors and makes a great side with steamed rice. Considering my love for coriander, undoubtedly it had to play a major role in our festive meal and so it did along with carrots. This pachadi calls for simple everyday ingredients - dals, red chillies, cumin, garlic, jaggery for that hint of sweetness, lemon for the tang and of course the harmonious combo of fresh coriander and grated carrots giving this pachadi its unique flavor.\r\n \r\n\r\n\r\nCarrot Kothimira Pachadi Recipe\r\nPrep & Cooking: 30  mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups grated carrot\r\n\r\n3\/4 to 1 cup chopped fresh coriander (adjust)\r\n\r\n1 1\/2 tbsp split black gram dal (minapa pappu)\r\n\r\n1 tbsp  bengal gram (senaga pappu) \r\n\r\n1 tsp cumin seeds\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1-2 dry red chillis (adjust to suit your spice level)\r\n\r\n4-5 garlic flakes\r\n\r\n1-2 green chillies (adjust)\r\n\r\n1 tbsp grated jaggery (adjust)\r\n\r\nsalt to taste\r\n\r\njuice of 1\/2 lemon (small)\r\n\r\n1 tbsp oil\r\n\r\nFor the tempering\/poppu\/tadka:\r\n\r\n1 tsp oil\r\n\r\n1\/2 mustard seeds\r\n\r\n1\/2 tsp split gram dal\r\n\r\n8-10 curry leaves\r\n\r\n\r\n\r\n1 Heat half a tbsp of oil in a non-stick pan. Add the garlic, cumin, split gram dal, bengal gram, red chillis and mustard seeds and stir on medium heat till the dals turn slightly red and a nice aroma emanates. Immediately remove the roasted spices, straining the left over oil and keep aside.\r\n2 In the same pan, add a tsp of oil if required, add the slit green chilli and grated carrot and on medium flame saute till the rawness of carrot disappears (approx 3-4 mts). Remove and keep aside.\r\n3 In the same pan, add another tsp of oil and saute the chopped coriander leaves for a minute. Remove from heat and cool.\r\n4 Grind the roasted dal mixture first, followed by the sauteed carrot and coriander, jaggery along with salt, to a coarse paste without adding any water. \r\n5 Heat oil in a pan for the tempering, add the mustard seeds, let them pop and add the split gram dal and curry leaves and fry till the dal turns red. Add this seasoning along with lemon juice to the ground pachadi. Serve with hot steamed rice.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/carrot_kothimira_pachadi1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/carrot_kothimira_pachadi1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/carrot_kothimira_pachadi1-300x300.jpg","main-ingredient":["carrots","coriander leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}