{"id":493,"permalink":"http:\/\/www.sailusfood.com\/2007\/04\/09\/pesara-pappu-payasam-moong-dal-payasam\/","title":"Pesara Pappu Payasam - Moong Dal Payasam","content":"With some very basic ingredients usually available at home, you can whip up some comforting simple lentil based sweet dishes that are not high in calories yet delicious. One such traditional Indian dessert is Pesara pappu payasam prepared from good quality yellow moong dal, jaggery and milk. This humble earthy sweet dish was part of our festive thali on Ugadi and what I really like is its subtle sweet flavor leaving you with a pleasant mouth feel.\r\n\r\nCooked moong dal is simmered in milk and melted jaggery till well blended and flavored with cardamom powder and ghee toasted cashewnuts and raisins providing that crunch. Try it and  you are assured of an absolutely delectable treat. Can be served either warm or chilled.\r\n\r\nPesara Pappu Payasam Recipe\r\nCooking Time: 40 mts\r\nCuisine: South Indian\r\nServes 6-7 persons\r\n. \r\n\r\nIngredients:\r\n\r\n1 1\/2 lt milk\r\n\r\n3\/4 cup split yellow moong dal\r\n\r\n1 cup jaggery (adjust)\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n2 tbsps cashewnuts \r\n\r\n1 tbsp raisins\r\n\r\n1 tbsp ghee\r\n\r\n1 1\/2 cups water to pressure cook dal\r\n\r\n1 1\/4 cup water to prepare jaggery syrup\r\n\r\n1 Heat a pan, add a tbsp of ghee and toast the cashewnuts and raisins till golden brown. Remove from pan, keep aside.\r\n2 In the same pan, add the moong dal and roast it for approx 4 mts till a nice aroma emanates the kitchen and it turns a light brown shade. Remove from pan and pressure cook the dal till soft and mushy.\r\n3 Take a cooking vessel, add jaggery and water and boil till the jaggery melts (remove scum). Turn off heat.\r\n4 In a heavy bottomed vessel, boil the milk (1 1\/2 lts), stirring once in a while and once the milk is boiled (it should reduce to a little over one litre), add the cooked mushy dal and combine well.\r\n5 Next, add the jaggery syrup and go on stirring on low flame till well blended for at least 12-15 mts. \r\n6 Add the cardamom pwd and toasted cashews and raisins. Serve warm or refrigerate until chilled. It tastes good both warm and chilled. \r\n\r\n                      ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/moongdal_milk_jaggery_cashewnuts_kismis1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/moongdal_milk_jaggery_cashewnuts_kismis1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/moongdal_milk_jaggery_cashewnuts_kismis1-300x300.jpg","main-ingredient":["moong dal","jaggery"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Festival Foods","Indian Dal Recipes","Indian Festivals","Indian Milk Recipes","Indian Sweets Recipes","South Indian Recipes","Sweet Dessert Recipes"]}