{"id":494,"permalink":"http:\/\/www.sailusfood.com\/2007\/04\/03\/tomato-kothimira-pachadi\/","title":"Tomato Kothimira Pachadi ","content":"There is nothing more satisfying than cooking with vegetables grown in one's own backyard. Today I used a few not so ripe orange tinge tomatoes from our vegetable garden to make a perfectly simple pachadi. \r\n\r\nTo make this deliciously tangy pachadi all you need are simple everyday ingredients like fresh firm tomatoes, coriander, green chillis, onion and the all important spice - cumin seeds. Ultimate in simplicity yet flavorful this chutney tastes best with idlis and dosas. The greenish shade of the pachadi is due to coriander which should not be overused and may play a dominant flavor but used subtly to harmonise with the tangy flavor of tomatoes.\r\n\r\n\r\n\r\nTomato Kothimira Pachadi Recipe\r\nPrep & Cooking: 20 mts\r\nServes 3-4 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n4-5 medium sized tomatoes \r\n\r\n1 onion, sliced\r\n\r\n1\/2 cup chopped fresh coriander (adjust)\r\n\r\n1\/2 tbsp cumin seeds\r\n\r\n2 green chillies (adjust)\r\n\r\nsalt to taste\r\n\r\n1 tbsp tamarind paste (optional)\r\n\r\n1 tbsp oil\r\n\r\nFor the tempering\/poppu\/tadka:\r\n\r\n1\/2 tsp oil\r\n\r\n1\/2 mustard seeds\r\n\r\n1\/2 tsp split gram dal\r\n\r\n8-10 curry leaves\r\n\r\npinch of asafoetida (optional)\r\n\r\n\r\n1 Heat half a tbsp of oil in a non-stick pan. Add the cumin and let them brown. Add the slit green chillis and saute for a few seconds, add the sliced onion and saute for 4 mts on medium heat. Lastly add the chopped coriander and saute further for a mt. Remove and keep aside.\r\n2 In the same pan, add a tsp of oil, add the chopped tomatoes and on medium flame saute till the rawness of tomato disappears and the water evaporates (approx 4-5 mts). Remove and keep aside.\r\n3 Grind the sauteed onions, coriander, tomato, tamarind along with salt, to a coarse paste adding a few tbsps of water. \r\n5 Heat oil in a pan for the tempering, add the mustard seeds, let them pop and add the split gram dal and curry leaves and fry till the dal turns red. Lastly add the asafoetida and immediately add this seasoning to the ground pachadi. Serve with hot idlis or dosas.\r\n\r\n\r\nMy entry to JFI - Tomato hosted by RP of My Workshop and Green Blog Project hosted by Mandira of Ahaar. Thanks RP and Mandira for hosting JFI and Green Blog Project.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/tomato_kothimira_pachadi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tomato_kothimira_pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tomato_kothimira_pachadi-300x300.jpg","main-ingredient":["tomatoes","coriander leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["kothimira","pachadi","tomato"]}