{"id":4954,"permalink":"http:\/\/www.sailusfood.com\/2009\/12\/04\/barbati-bangaladumpa-vepudu-yard-long-beans-potato-stir-fry\/","title":"Barbati Bangaladumpa Vepudu ~ Yard Long Beans-Potato Stir fry","content":"Yard long beans Potato Fry\r\n\r\nBarbati aka yard long beans are a regular fare at the local market though they hardly make an appearance at our dining table. This morning as Nehal was leaving for school, a young mobile vegetable vendor, greeted us at our doorstep to sell farm-fresh long beans, ridge gourd and raw plantains. These vegetables among others are grown on his small piece land situated in a village 28 kms away from Vizag. From what I gathered, he sells farm-fresh produce directly to the consumers, eliminating any middle men, at half the market price. I bought 1\/2 kg of each variety and told him to bring fresh vegetables and greens on a regular basis. \r\n\r\nYard long beans, barbati\r\n\r\nHe picked the beans early in the morning, so they couldn't be more fresh. I prepared a stir fry by combining potatoes similar to the french beans potato stir fry I had blogged earlier. Simply fabulous! I wondered why I gave these beans a step-motherly treatment all this while. Anyway, I am going to cook them often now with a lot of motherly love. :)\r\n\r\n\r\nBarbati Bangaladumpa Vepudu Recipe\r\nPrep & Cooking: 40-45 mts\r\nServes 4 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/4 kg runner beans (string, chop, par boil in water with 1\/4 tsp salt and pinch of turmeric for 6-7 mts)\r\n\r\n2 potatoes, peeled and cubed\r\n\r\npinch of turmeric pwd\r\n\r\n1 tsp red chilli pwd\r\n\r\n1 tsp coriander pwd\r\n\r\npinch roasted methi pwd \r\n\r\nsalt to taste\r\n\r\n1 tbsp oil\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n4 garlic cloves, crushed\r\n\r\n10-12 curry leaves\r\n\r\n\r\n\r\n1 Heat oil in a cooking vessel, add mustard seeds and as they jump around, add the cumin and as they crackle, add garlic and fresh curry leaves and saute for few secs. \r\n2 Add the cubed potatoes and salt. Combine, place lid and simmer for 15 mts or till the potatoes are three-fourth cooked. Add the coriander pwd, turmeric pwd, chilli pwd and methi pwd and combine. \r\n3 Add the par-boiled runner beans and combine. Sprinkle few tbsps of water and place lid. Simmer for about 12-14 mts or till the beans and potatoes are fork tender.\r\n4 Adjust salt and stir fry without lid on high flame for a mt and combine well. Turn off heat and serve with rice or rotis. \r\n\r\nBarbati Bangaladumpa Vepudu","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/12\/barbati-bangaladumpa-vepudu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/barbati-bangaladumpa-vepudu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/barbati-bangaladumpa-vepudu-300x300.jpg","main-ingredient":["yard long beans","potatoes"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["barbati","long-beans","potato"]}