{"id":509,"permalink":"http:\/\/www.sailusfood.com\/2007\/04\/18\/mexican-tacos\/","title":"Mexican Tacos","content":"\r\nMy son, Nehal relishes his favorite Mexican snack - tacos and I set myself the task of preparing home made taco shells right from scratch using corn tortillas, loaded with a delicious paneer-vegetable-baked beans filling as a tea-time snack and use the left over tortillas to prepare enchilada casserole for dinner. The tacos I prepare at home are Mexican inspired and are no where authentic.:).\r\n\r\n\r\nIts a simple recipe but does call for quite a bit of preparation work. First I prepared the corn  tortillas, the recipe of which I had blogged earlier, and used these tortillas to prepare taco shells, using a taco mould. I bought a very convenient custom made aluminium taco mould\/maker with a long wooden handle for Rs.120 (approx $ 2.70) from a cookware store in Vizag. \r\n\r\nTaco mould (custom made at a cookware store)\r\n\r\nMexican Tacos Recipe\r\nPrep & Cooking: 45 mts, cooking: 15 mts\r\nCuisine: Mexican\r\n.\r\n\r\nIngredients:\r\n\r\n For filling:\r\n1 1\/2 cups chopped mixed vegetables (onions, carrots, beans, baby corn, capsicum, cabbage)\r\n\r\n2 tomatoes chopped\r\n\r\n3\/4 cup grated paneer\r\n\r\n3-4 tbsps coriander leaves or parsley finely chopped\r\n\r\npepper pwd or dried red chilli flakes for seasoning\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsp olive oil\r\n\r\nhome made tomato salsa\r\n\r\nhome made sour cream (optional)\r\n\r\n1\/2 cup baked beans (optional)\r\n\r\nFor tacos:\r\n\r\nrolled out corn tortillas\r\n\r\ntaco mould\/maker\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Saute the mixed vegetables in olive oil for 2-3 mts. Next add the grated paneer and saute further for a minute. Turn off heat and cool.\r\n2 Combine the sauteed vegetables-paneer, tomatoes, salt and pepper\/red chilli flakes. Filling is ready.\r\n\r\nTomatoes, cabbage, capsicum, sweet corn, carrot, onions, paneer, green peas, baby corn and grated paneer\r\n How to prepare corn tortillas at home \r\n\r\n3  To prepare the tacos, roll out corn tortillas into small rotis or approx 6\" in diameter. Use a fork to prick lightly on the rolled out tortillas. \r\n4 Heat enough oil for deep frying in a heavy bottomed vessel. Once hot, slide a tortilla into the oil and immediately place the bottom of the taco mould on the center of the tortilla and press gently into the oil and hold for 12-15 secs. You will find that the  tortilla takes the shape of the mould and forms a cup.\r\n\r\n\r\n5 Remove the mould and cook the shell all over till golden brown. Drain and remove. Prepare with the rest of the tortillas.\r\n\r\n6 Now fill the taco shells with 2 tbsps of the paneer-vegetable filling. Top with a tbsp of baked beans followed by a tbsp of salsa, a tbsp of sour cream and garnish with parsley. Crunchy crisp tacos with a delicious filling are ready to be devoured!\r\n\r\nNote:You can use any type of filling - vegetables or meat based and top with cheese.\r\nRead more about Mexican Tacos\r\nInteresting article on the history of tortilla and taco\r\nNote:Do visit this website for more information on Mexican recipes and cooking classes. The above recipes were originally prepared by Manju Sethia who designed the taco maker along with 2 other shapes.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2007\/04\/mexican_tacos1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mexican_tacos1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mexican_tacos1-300x300.jpg","main-ingredient":["maize flour"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","Mexican Recipes"],"tags":["snacks","tacos"]}