{"id":52,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/13\/mirchi-khatta-masala-tangy-green-chillis-curry\/","title":"Mirchi Khatta Masala - Tangy Green Chillis Curry","content":"\r\n\r\nLong green chilli peppers are large, mild chillis and are generally used to cook Mirchi Ka Salan (Hyderabadi dish), stuffed bajjis, pakoras and other gravy dishes. They can be chopped, ground into a paste, slit, and de-seeded, or an entire chilli can be used in the dish.\r\n\r\nThese chillis have a very mild spice to them and I usually like to cook them during winters as a curry which has a tangy flavor. It goes well with pulao, rice and rotis. My family enjoys this dish, especially during cold weather. Here goes \"Mirchi Khatta Masala\" recipe.\r\n\r\nIngredients:\r\n\r\n10 long green chillis (cut into 2\" pieces)\r\n\r\n\r\n\r\n1 cup chopped onions (make a coarse paste)\r\n1\/2 tsp shahjeera (black cumin seeds)\r\n1 tbsp chopped pudina (mint leaves)\r\n1 tsp ginger garlic paste\r\n1 cup chopped tomatoes\r\n1\/2 tsp red chilli pwd\r\n1 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1\/2 tsp garam masala pwd\r\n2 tbsp tamarind paste\r\n boiled channa dal paste (boil 2 tbsp of channa dal and make a paste)\r\n2 tbsp of khus-khus and melon seeds (magaz,dawsa ginjallu) paste (soak 2 tsps each of poppy seeds and melon seeds in little water for half an hour and make a smooth  paste)\r\n3 tbsp oil\r\n2 cups water\r\nsalt\r\nchopped coriander leaves for garnish\r\n\r\nHeat 3 tbsp oil in a pan. Add shahjeera and pudina leaves and fry for few seconds.\r\nAdd the coarse onion paste and fry till oil separates.\r\nNext add ginger garlic paste and fry till oil separates.\r\nAdd the chopped tomatoes and mix well and fry till oil separates.\r\nAdd chilli pwd, cumin pwd and coriander pwd and mix well.\r\nNow add the green chilli pieces and salt, mix well. Cover and cook on slow fire till three fourth cooked.\r\nNow add the khus-khus and melon seed paste along with boiled channa dal paste and tamarind paste. Mix well.\r\nAdd water and cook till the chillis are soft. Add garam masala towards the end and garnish with chopped coriander leaves.\r\nServes best with hot rotis and rice\/pulao.","style":["easy","traditional"],"course":["side"],"special-diet":["eggless","dairy free","vegetarian","vegan","pregnancy"],"cuisine":["hyderabadi"],"cook-time":"40","prep-time":"15","main-ingredient":["green chillis","peppers"],"serves":"5","goes-well-with":["rice","roti","pulao"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["green chillis","masala","mirchi"]}