{"id":530,"permalink":"http:\/\/www.sailusfood.com\/2007\/06\/11\/dondakaya-pulusu-ivy-gourd-in-tamarind-sauce\/","title":"Dondakaya Pulusu - Ivy gourd in tamarind sauce","content":"Murali, an avid foodie, techie geek, ace photographer, studying film-making, presently working in Australia and a close family friend wanted to share one of his favorite recipe and asked me if he could do a guest post. I am more than happy to oblige with his request.:)\r\n\r\nI'm sharing one of my favorite recipe using tindora, dondakaya pulusu, where dondakaya is simmered in a sweet and sour tamarind sauce. \r\n\r\n\r\n\r\nDondakaya Pulusu Recipe\r\nPrep & Cooking Time: 30 mts\r\n\r\n\r\nIngredients:\r\n\r\n1 tbsp oil\r\n1\/2 tsp mustard seeds\r\n1\/2 tsp cumin seeds\r\n1\/4 tsp grated ginger \r\n2 garlic cloves, crushed\r\n2 red dried chillis, de-seed\r\n1\/2 tsp fenugreek seeds\r\n10-12 curry leaves\r\n2 onions, finely chopped\r\npinch of turmeric\r\nsalt to taste\r\n1 tsp chilli pwd\r\n1 tsp daniya pwd\r\n1\/2 kilo tindora, finely sliced\r\nsmall lemon sized tamarind ball (extract juice)\r\n1 tbsp grated jaggery\r\n\r\n\r\n\r\nProcedure:\r\n1 Soak the tamarind in 2 cups of warm water for 10 mts. Extract juice and keep aside.\r\n2 Heat oil in a skillet and when hot, add the mustard seeds and let them splutter, add cumin seeds, ginger, garlic, fenugreek seeds, red dried chilli and curry leaves.\r\n3 Toss them for a few seconds and don't allow the fenugreek seeds to burn, they should turn slightly red.\r\n4 Add the onions and saute till brown, add turmeric. Now add the tindoora pieces (cut lengthwise) and fry for two minutes and cover with lid and cook on medium heat.\r\n5 Add dhaniya powder, salt and chilli pwd. Add the tamarind juice and grated jaggery and cover with lid and cook on medium heat.\r\n6 Cook till the tindoora turns soft and the sauce thickens. \r\n\r\nYou can serve with rice or chapathi. Hope you enjoy this recipe as much as I did in preparing and presenting it to you. Thank you, Sailaja.:)\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/img_2820.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/img_2820-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/img_2820-300x300.jpg","main-ingredient":["ivy gourd"],"author":null,"type":"post","categories":["Andhra Recipes","Guest Blogger","Indian Curry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}