{"id":538,"permalink":"http:\/\/www.sailusfood.com\/2007\/04\/23\/enchilada-casserole\/","title":"Enchilada Casserole","content":"Last weekend, I had prepared a spicy-cheesy layered enchilada casserole for dinner with the left over corn tortillas used for preparing mexican tacos. I was inspired by this mexican lasagna  and a  chicken gravy enchilada casserole  recipe and made an amalgamation of sorts using mixed vegetables and left over chicken curry which were all pretty much tossed together to serve as a filling for the tortillas. A perfect kid pleaser, delicious and an ultimate comforting casserole. \r\n\r\n\r\n\r\nYou can modify the recipe to suit your family's taste buds with endless combinations. These enchiladas filled with a flavorful combination of ingredients, layered with white sauce, a tangy homemade tomato salsa, finished with a generous sprinkling of grated cheese and baked, makes for a hearty dinner.\r\n\r\nEnchilada Casserole Recipe\r\nPrep & Cooking: 45 mts, baking: 40 mts\r\nServes: 4-5 persons\r\nCuisine: Tex-Mex\r\n.\r\n\r\nIngredients:\r\n\r\n8 corn or flour tortillas roasted on both sides (I used corn tortillas)\r\n\r\n1\/4 cup thick buttermilk (whisked well)\r\n\r\n1 cup home made salsa \r\n1 cup white sauce\r\n\r\n1\/2 cup grated cheese\r\n\r\n\r\n For filling:\r\n\r\n1 cup chopped mixed vegetables (onions, carrots, beans, baby corn, capsicum, cabbage)\r\n\r\n1 tomato chopped\r\n\r\n1\/4 cup boiled sweet corn\r\n\r\nleft over chicken curry (or cooked shredded boneless chicken) - optional\r\n\r\n1 tbsp worchestershire sauce\r\n\r\n3-4 tbsps coriander leaves or parsley finely chopped\r\n\r\ndried red chilli flakes for seasoning\r\n\r\nsalt to taste\r\n\r\n1 tbsp olive oil\r\n\r\nFor white sauce:\r\n\r\n1 tbsp butter\r\n\r\n1 tbsp maida\r\n\r\n1 cup milk (at room temp)\r\n\r\n1 tbsp grated cheese\r\n\r\nsalt \r\n\r\npepper to taste\r\n\r\ndried parsley (optional)\r\n\r\n\r\n\r\nHow to prepare corn tortillas or flour tortillas\r\n\r\n1 Saute the mixed vegetables in olive oil for 2-3 mts. Next add the tomatoes, sweet corn, left over chicken curry (remove bones if any), worchestshire sauce, chopped parsley and combine well and cook for 2-3 mts. Season with salt and red chilli flakes or pepper. Turn off heat and cool. Filling is ready. Keep aside.\r\n2 Prepare the white sauce. Heat a cooking vessel and on low flame, add the butter and let it melt. Add maida and keep stirring using a hand whisk over a low flame till well blended. Slowly add the milk, stirring continuously. Add cheese and parsley. Increase the heat to medium and continue to stir until you have a nice smooth consistency sauce. Once in a while, remove the vessel away from the heat for a few seconds and place it back while stirring. Season with salt and pepper.\r\n3 Prepare the tortillas, roll them into small rotis, approx 5\"  in diameter. Roast them on both sides, drizzle some olive oil and roast till brown specks appear. \r\n4 Dip each roasted tortilla into the thick buttermilk till coated on both sides. Place about 2 heaped tbsps of the filling in the middle of each tortilla and fold into half and place it carefully fold side down in a wide shallow square shaped casserole. Repeat with rest of the tortillas and place them side by side as shown in the picture.\r\n\r\n\r\n\r\n5 Now spread the white sauce over all the tortillas covering the entire casserole, followed by home made salsa and then sprinkle grated cheese all over. Seal with alumunium foil.\r\n6 Bake in a pre-heated oven at 200 degrees C for 30 mts or till the cheese melts. Bake uncovered without foil for another 10 mts. Let it stand for 10 mts and serve hot.\r\n\r\n\r\nTortillas with filling, topped with white sauce, salsa and grated cheese before baking\r\nNote:You can use any type of filling - vegetables or meat based and top with cheese.\r\n\r\nRead about Tex-Mex favorites at All Recipes","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/tortillas_vegetable_filling_casserole.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tortillas_vegetable_filling_casserole-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tortillas_vegetable_filling_casserole-300x300.jpg","main-ingredient":["carrots","beans"],"author":null,"type":"post","categories":["All Recipes","Easy Pasta Recipes","Indian Non-Vegetarian Recipes","Mexican Recipes"],"tags":["snacks"]}