{"id":54,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/15\/senaga-pappu-menthu-kura-fenugreek-leaves-stir-fried-in-lentils\/","title":"Senaga Pappu Menthu Kura - Fenugreek Leaves Stir Fried in  Lentils","content":"\r\n\r\nMethi Channa dal is a semi dry (sukha) curry that is nutritious. Made with methi (fenugreek leaves) and channa dal (split bengal gram). Fenugreek leaves are rich in iron, vitamins, and minerals and is generally cooked with potatoes or lentils. Fenugreek leaves have many medicinal properties and help in improving digestion, reducing colic, relieving constipation, and hemorrhoids.\r\n\r\nChanna Dal (Bengal Gram) is nutritious and has a sweet, nutty flavor and is easily digested. Its a popular lentil in India and generally used in dal dishes and to prepare savories. Channa dal is roasted and powdered into chickpea flour (besan), another widely used ingredient in nearly every regional Indian cuisine. Besan is the basic ingredient in preparing bajjis,a popular snack in India.\r\n\r\nIngredients:\r\n\r\n1 bunch of fresh methi (fenugreek) leaves, picked, washed chopped\r\n1 small cup senaga pappu (channa dal, split bengal gram)\r\n1 tsp coriander pwd\r\n1\/2 tsp red chilli pwd\r\n2 cups water\r\n1\/3 tsp turmeric pwd (pasupu, haldi)\r\n1 tbsp oil\r\n1\/2 tsp cumin seeds\r\n4 garlic flakes finely chopped\r\npinch of asafoetida (hing)\r\n1 green chilli finely chopped\r\n2 medium tomatoes finely chopped\r\nsalt\r\n\r\n\r\n \r\nWash the channa dal and add two cups of water, salt, coriander pwd and turmeric pwd pressure cook till one whistle. The dal should be soft and not mushy.\r\nHeat oil in a skillet. Add cumin seeds and let them splutter and now add the garlic and hing and fry for few seconds.\r\nNow add tomatoes and green chillies and fry till oil separates.\r\nAdd the chilli pwd and mix well.\r\nAdd chopped methi and the cooked dal and let it simmer for 10-12 minutes covered. The consistency of the dal is semi dry.\r\nServe hot with roti or rice.","style":["easy","modern"],"course":["side"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","kid friendly","pregnancy","gluten\/wheat free"],"cuisine":["andhra"],"cook-time":"30","prep-time":"15","main-ingredient":["methi","bengal gram"],"serves":"5","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Dal Recipes","Indian Fry Recipes","Indian Lentil Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["bengal-gram","menthu-kura","methi","senaga-pappu"]}