{"id":549,"permalink":"http:\/\/www.sailusfood.com\/2007\/04\/26\/rava-idli-groundnut-pachadi-peanut-chutney\/","title":"Rava Idli - Groundnut Pachadi (Peanut Chutney)","content":"Although idlis and dosas are the most popular South Indian breakfast items, there are some culinary gems like ravva idli that are nutritious yet filling. I read in a cooking magazine that the birth of ravva idli took place in the kitchen of the famous MTR Restaurant during Second World War when they faced shortage of rice (an essential ingredient to prepare idli). Either the sheer simplicity or ease with which one can prepare, can be eaten at any time of the day, the nutrition it has to offer or its flavor, makes it special. \r\n\r\nUnlike idlis, where the batter needs to be fermented and need some preparation work, ravva idlis hardly need any preparation and can be made at the spur of the moment. Cream of wheat, popularly known as semolina\/sooji is lightly roasted with a seasoning of mustard seeds, channa dal, green chilis and ginger and brought together with a mixture of curd, coconut and vegetables like carrots or peas. The resultant un- fermented batter is a thick consistency unlike idli batter which is light and rises on fermentation. Let the batter sit covered for just under 30 minutes and its ready to be steamed. Vegetables like peas and carrots can be added along with cashewnuts to give more flavor. \r\n\r\nThis is one breakfast recipe I enjoy preparing time and again as a delicious anytime brunch\/lunch\/dinner option and also serves as a great lunch-box tiffin or evening snack for Nehal.\r\nRava Idli Recipe\r\nPrep: 10 mts, sitting time: 30 mts, cooking: 10 mts\r\nMakes: approx 12-14 idlis\r\nCuisine: Karnataka\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup sooji\/cream of wheat\/semolina\/upma ravva \r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1 tbsp channa dal\r\n\r\n1\" grated ginger\r\n\r\n3 green chilies, finely chopped\r\n\r\n5-6 curry leaves (optional)\r\n\r\nbig pinch soda (optional)\r\n\r\n2 carrots, grated \r\n\r\n2 tbsps fresh coriander leaves (optional)\r\n\r\n2 tbsps grated fresh coconut \r\n\r\nsalt to taste\r\n\r\n1 cup well beaten thick curd\r\n\r\n1\/4 cup water\r\n\r\n2 tbsps roasted cashewnuts (optional)\r\n\r\n1 tbsp ghee or oil\r\n\r\n\r\n\r\n1 Heat ghee, add the mustard seeds and once they splutter, add the chana dal and saute till the dal turns golden brown. Add the green chillis, curry leaves and ginger. \r\n2 Immediately add the ravva and on low to medium heat stir fry the rava constantly for 3 mts. Take off heat and cool.\r\n3 Add grated carrot, coriander leaves, grated coconut, curd, water and salt and mix well. Let this sit for atleast half an hour.\r\n4 Grease idli plates. Place a roasted cashewnut on each of the greased idli plates and pour the rava batter over the cashewnut. Don't let the batter fill till the brim.  \r\n5 Steam the ravva idlis on medium flame for around 10 mts. Turn off heat and let it sit for 5 mts. Remove the rava idlis carefully with a spatula and serve hot with chutney of your choice.\r\n\r\nNote: You can add vegetables of your choice like peas, beans and capsicum. Soda bicarb can be replaced with eno salt. \r\n\r\nVerusenaga pachadi or peanut chutney happens to be one of my favorites and a regular at home. Today's version calls for onion, garlic and dry red chillis to be sauteed before ground with roasted peanuts and tamarind. Goes great with idlis and dosas.\r\n Groundnut Chutney Recipe\r\nPrep: 15 mts\r\nServes: 3-4 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup roasted and peeled peanuts\r\n\r\n1 small onion sliced\r\n\r\n3 dry red chillis, de-seeded\r\n\r\nsmall lemon sized tamarind (soaked in warm water for 10 mts)\r\n\r\n3 garlic flakes, crushed\r\n\r\nsalt to taste\r\n\r\n3\/4 cup water\r\n\r\n1 tsp oil\r\n\r\nFor poppu\/tadka\/seasoning:\r\n\r\n1\/2 mustard seeds\r\n\r\n1\/2 split black gram dal\r\n\r\n8-10 curry leaves\r\n\r\n1\/2 tsp oil\r\n\r\n\r\n\r\n1 Heat oil in a vessel, add the garlic and dry red chillis and stir fry for a few seconds. Add the sliced onions and saute further for 2-3 mts on medium heat. Turn of heat and cool. \r\n2 Grind the roasted peanuts, tamarind, sauteed onions and garlic along with salt and half a cup of water.\r\n3 Heat oil in a pan for seasoning. Once hot, add the mustard seeds and once they splutter, add the split gram dal and let it turn golden brown. Add the curry leaves and turn off heat. Pour over chutney and serve with idlis or dosas.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/peanut_chutney.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/peanut_chutney-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/peanut_chutney-300x300.jpg","main-ingredient":["semolina","yogurt"],"author":null,"type":"post","categories":["All Recipes","Indian Breakfast Recipes","Indian Chutney Recipes - Pachadi","Lunch Box Recipes","South Indian Recipes"]}