{"id":553,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/01\/thotakura-vepudu-amaranth-leaves-stir-fry\/","title":"Thotakura Vepudu - Amaranth Leaves Stir-Fry","content":"Greens hold a special place in my kitchen, though I have a tough time getting Nehal overcome his aversion to eating greens. What I usually do is camoflauge a greens stir fry dish with some grated cheese and tomato sauce and prepare a sandwich for him.:) Satish and I are fond of most greens and usually prepare them on a daily basis, especially in combination with tur dal (red gram lentil).\r\n\r\n\r\nFresh amaranth leaves\/thotakura\/chauli\r\nThis summer the rythu bazaars in Vizag are loaded with fresh amaranth and red sorrel leaves (gongura). Each morning we wake up to the call of the vegetable vendor shouting \"aakuralu\" (green vegetables), selling fresh greens like coriander leaves, mint, red sorrel, spinach, amaranth and methi leaves. \r\n\r\nVegetable vendor selling fresh greens, door to door\r\nToday, I'm sharing a simple stir fry of amaranth leaves. Its tastes great with white rice, we had it along with a lentil stew pappu pulusu and perugu (curd).\r\n\r\n\r\nAmaranth leaves stir fry with white rice\r\nThotakura Vepudu Recipe\r\nPrep & Cooking: 30 mts\r\nServes: 3-4\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n6 big bunches fresh amaranth leaves (picked, discard thick stalks, use tender stalks) \r\n\r\n1 big onion, finely chopped\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n4 dry red chillis de-seeded\r\n\r\n5-6 garlic flakes, crushed\r\n\r\n1 sprig curry leaves\r\n\r\n2 green chilies, slit length wise\r\n\r\nbig pinch turmeric pwd\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp olive oil\r\n\r\n\r\n\r\n1 Boil the amaranth leaves and tender stalks in just enough water (about a cup of water) for 10-12 mts, such that the water is almost absorbed.\r\n2 Heat oil, add the mustard seeds and once they splutter, add the cumin seeds, garlic flakes, red chillis, curry leaves and green chillis and saute for half a minute.  \r\n3 Add the onions and saute till transparent. Add salt and turmeric pwd and saute further for a minute. \r\n4 Add the boiled leaves and saute uncovered for 15-20 mts or till done. Serve hot with rice.\r\nNote:Use any left over water to prepare roti dough.\r\nMy entry to JFI-WBB - Green Leafy Vegetables hosted by creator of Jihva, the lovely Indira of Mahanandi.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/fresh_greens_aaku_kuralu.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fresh_greens_aaku_kuralu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fresh_greens_aaku_kuralu-300x300.jpg","main-ingredient":["amaranth leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Fry Recipes","Indian Vegetarian Recipes"]}