{"id":5556,"permalink":"http:\/\/www.sailusfood.com\/2009\/12\/14\/high-raw-food-peas-paneer-and-peanut-salad\/","title":"High Raw Food ~ Peas, Paneer and Peanut Salad","content":"Today's salad is a fusion of 3 P's, peas, paneer and peanuts. An outcome of whatever was available at home and it turned out simply fabulous! Finished with a generous amount of coarsely pounded roasted peanuts, the 3 P salad is one of the best high raw food salad recipes I have ever made.\r\n\r\n\r\n\r\nBring together 1 chopped apple, 1 peeled and chopped cucumber, fistful of boiled fresh green peas, 1 grated carrot, 1\/4 cup paneer cubes (sauteed in a tsp of oil for 2-3 mts), salt and pepper to taste, 1\/2 tbsp honey, 1 1\/2 tbsps coarsely ground roasted peanuts. Toss well. Add any fruit of your choice. \r\n\r\nMonday high raw food diet ~\r\n\r\nMorning: 6.15 am - Glass of luke warm lemon water \r\nBreakfast: 7.30 am - Small bowl of soaked yellow moong dal, small chopped onion, small chopped tomato, sliced almonds (soaked and peeled), chopped coriander leaves and a dash of lime and pepper and tsp of honey. Toss well. \r\nMid Morning: 9.30 am - A guava and small bowl of papaya\r\nMid Morning: 11 am - Glass of sweet lime juice\r\nLunch: 1.30 pm - Peas, Paneer and Peanut Salad \r\nLate Afternoon: 4 pm - Cup of green tea\r\nDinner: 6.45 pm - Flax seeds-Papaya-Orange Smoothie\r\n Drank more water than usual. I squeezed juice of two lemons in 2 1\/2 lts of water that I've drinking through out the day. Just before going to bed, I will take a tsp of triphala churna with a tbsp of honey. \r\n\r\nHigh raw food Recipes\r\nPineapple Paneer Salad\r\nBlack Chickpeas Fruit Salad","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/12\/pea-peanut-paneer-salad.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pea-peanut-paneer-salad-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/pea-peanut-paneer-salad-300x300.jpg","main-ingredient":["green peas","paneer"],"author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Indian Vegetarian Recipes","Raw Food Recipes","Recipes Vegetable Dishes","Salad Recipes"],"tags":["apple","peanuts","peas","salad"]}