{"id":557,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/11\/erra-karam-masala-dosa\/","title":"Erra Karam Masala Dosa ","content":"The ever versatile masala dosa in all its variations and myraid fillings is a meal by itself. Erra kaaram masala dosa is basically one of the incarnations of the masala dosa. A popular Andhra tiffin item, this dosa differs from the mysore masala dosa in terms of the filling. Mysore masala dosa is smeared with a red chilli-garlic chutney, served with some white butter and potato masala. \r\n\r\nErra kaaram aka ulli kaaram masala dosa uses a red chutney made from onion, garlic and red chillis (ulli kaaram), spiced roasted chickpeas podi which is liberally sprinkled followed by the potato masala, giving it a distinctive fiery flavor. \r\n\r\nPappulu Podi Recipe\r\nPrep & Cooking: 3 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 cup roasted split chickpeas\/dalia\/putnala pappu\/bhuna chana\r\n\r\n1\/4 tsp cumin seeds\r\n\r\n1 crushed garlic flake (optional)\r\n\r\n2 dry red chillis (de-seeded)\r\n\r\n1 tsp dry coconut pwd (optional)\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Grind all the above ingredients to a fine powder and store in an air-tight container.\r\n2 Serve with rice and ghee, sprinkle over idlis with a dollop of ghee or sprinkle some of this podi over stir fry dishes like beans\/capsicum. \r\n\r\nErra Kaaram Recipe\r\nPrep & Cooking: 6-8 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 large onion, sliced\r\n\r\n3 garlic flakes crushed\r\n\r\n1 tsp tamarind paste\r\n\r\n4 dry red chillis, de-seeded\r\n\r\n1 tsp oil\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Heat oil in a vessel. Add the onions, red chillis and garlic flakes and saute for 3 mts. Remove and cool.\r\n2 Grind the sauteed mixture along with tamarind paste and salt to a fine paste. \r\n\r\nPotato Masala Recipe\r\nPrep & Cooking: 15 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 boiled potatoes\r\n\r\n1 onion, finely sliced\r\n\r\n2 green chillis, slit length wise\r\n\r\n1\/4 tsp grated ginger\r\n\r\n12-15 curry leaves\r\n\r\n1\/2 tsp mustard seeds\r\n\r\nbig pinch turmeric pwd\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Heat oil in a vessel. Add the mustard seeds and let them pop. Add the curry leaves, green chillis, ginger and onions and saute for 2 mts. Add turmeric pwd.\r\n2 Slightly mash the potatoes and add to the onions and saute further for another 2 mts. Add salt and sprinkle 2-3 tbsps of water. Cover and cook on low heat for a minute. Turn off heat.\r\n\r\nHow to prepare masala dosa batter \r\nPour a ladleful of dosa batter in the centre of the hot tava and spread the batter with the back of the ladle to form a thin circle. Drizzle oil along the edges of dosa and let it cook on medium heat for 2-3 mts. Now take a tbsp of the erra kaaram and spread with a spatula all over the open side of the dosa. Next spread a tsp of melted butter all over. Now sprinkle some of the pappulu podi all over the dosa and finally spread potato masala. Don't flip the dosa. Just fold over and serve hot.\r\n\r\nNote:Potato masala is optional as the dosa tastes great with just erra kaaram and pappulu podi. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/potato_masala_pappulu_podi_ulli_kaaram.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/potato_masala_pappulu_podi_ulli_kaaram-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/potato_masala_pappulu_podi_ulli_kaaram-300x300.jpg","main-ingredient":["urad dal","red chillis"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Chutney Recipes - Pachadi","Podi Recipes"]}