{"id":558,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/15\/reliance-fresh-and-summer-salads\/","title":"Reliance Fresh And Summer Salads","content":"Satish can live off salads 365 days, literally. Unfortunately we don't get lettuce which is his favorite but I try my best to get some, thanks to my chef friends who get fresh lettuce from their regular suppliers.:) \r\n\r\nWith the recent opening of Reliance Fresh in Vizag, I have been able to find some vegetables like purple cabbage, brocolli, zuchini, parsley, red and yellow peppers and fruits like grapefruit, green apples and Australian grapes, to name a few. These were never available at any of the grocers in Vizag till a few months ago but thanks to Reliance Fresh outlets, I do find them on their shelves 'sometimes' and not on a regular basis. \r\n\r\nAt Reliance Fresh (RF), I find that the stock is not always fresh (especially the greens which are shrivelled and limp), hardly any range and lack of quality expected of this huge conglomerate, Reliance Group. Till the old stock is cleared, they don't use the fresh arrivals. Obviously even the fresh produce would be old stock as they are put up usually a day later. My overall shopping experience at RF isn't very satisfactory.\r\n\r\nI prefer to buy the regular fresh vegetables and greens at the rythu bazaar (farmers market) and go to RF only to pick up vegetables\/fruits which are usually not available at the rythu bazaar. I picked up some red cabbage, red, yellow and green peppers and pineapple at RF to prepare salad. Over the week, made salad with two different types of dressings. Simple to prepare, delicious and with a glass of buttermilk\/juice, a complete meal. \r\n\r\nSalad with ginger-honey dressing recipe\r\nChop one each of red, yellow, green peppers, onion, red apple, 2-3 baby corns, 1\/2 cup cabbage and few green seedless grapes. Whisk together 1\" grated ginger, 2 crushed garlic cloves, 1 tbsp lemon juice or vinegar, 1 tbsp olive oil, 1 tbsp honey, 1\/2 tsp soya sauce and pepper to taste. Combine this dressing with the chopped vegetables and fruits. Chill and serve.\r\n\r\nSalad with honey-mustard dressing recipe\r\nChop one each of red, yellow, green peppers, one onion, one apple, 2-3 baby corns, 1\/2 cup cabbage and 1\/2 cup pineapple pieces. Whisk together 1\/4 cup low-fat mayonnaise, 1 tbsp mustard pwd, 1 tbsp lemon juice, 1 tbsp honey and pepper to taste. Combine this dressing with the chopped vegetables and fruits. Chill and serve.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/summer_salads.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/summer_salads-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/summer_salads-300x300.jpg","main-ingredient":["green peppers","mayonnaise"],"author":null,"type":"post","categories":["All Recipes","Recipes Vegetable Dishes","Salad Recipes"],"tags":["reliance_fresh","salad","salads","vegetables"]}