{"id":56,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/16\/curried-baby-potatoes\/","title":"Curried Baby Potatoes ","content":"\r\n\r\nPotato is a regular vegetable in my kitchen. There are innumerable ways of cooking up potatoes. Use it almost every other day be it, potato curry with masala dosa, vegetable pattis, salads, potato fry, mixed vegetable rice dish, a gravy dish or aloo parathas. Today, I cooked some baby potatoes gravy dish which has a rich flavor using cashewnuts, melon seeds and poppy seeds. Turned out great. Excellent with rotis\/parathas.\r\n\r\nIngredients:\r\n1\/4 kg baby potatoes (boiled and peeled)\r\n1 cup chopped onions\r\n2 green chillis slit\r\nwhole spices (1\" cinnamon stick, 3 cloves, 2 green cardamom pods)\r\n1 tsp ginger garlic paste\r\n1 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1 tsp chilli pwd\r\n1\/2 tsp garam masala pwd\r\nmelon seeds and cashew nut paste (soak 2 tsps melon seeds and 6 cashew nuts in water for 10 minutes and grind to a paste)\r\ncoconut - poppy seeds paste (Dry roast 2 tsps khus-khus and grind to a paste along with 1 tbsp grated coconut .You can use dry coconut if fresh isn't available)\r\noil\r\nsalt\r\nchopped coriander leaves for garnish\r\n\r\nHeat 2 tsps oil in a pan. Add the chopped onions and green chillis and fry till rawness disappears.Cool and grind coarsely.Keep aside.\r\nHeat 1 1\/2 tbsps oil in a pan. Add whole spices and fry for few seconds. Add ginger garlic paste and 1 tbsp of water and fry stirring it constantly so that it doesn't burn for 3-4 minutes. Now add the coarsely ground onion paste and fry for 3 minutes on medium heat. Take care that it doesn't burn.\r\nAdd coriander pwd, cumin pwd, chilli pwd and salt. Mix well.\r\nNow add the boiled potatoes and mix well. Cover and cook for 2 minutes.\r\nNow add the coconut-poppy seeds paste and cashew nut-melon seeds paste. Mix well and add 1 1\/2 cups of water and let the potatoes cook in these masala for 15 minutes.\r\nAdd garam masala pwd and combine well.\r\nGarnish with chopped coriander leaves.","style":["easy","modern"],"course":["side"],"special-diet":["eggless","vegetarian","vegan","gluten\/wheat free","kid friendly","pregnancy","dairy free"],"cuisine":["north indian"],"cook-time":"35","prep-time":"15","main-ingredient":["baby potatoes"],"serves":"6","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["baby-potatoes","curry"]}