{"id":564,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/17\/vankaya-kothimira-vepudu-brinjal-fresh-coriander-stir-fry\/","title":"Vankaya Kothimira Vepudu - Brinjal-Fresh Coriander Stir Fry","content":"Lakshmi of Veggie Cuisine started a monthly food blog event, Regional Cuisines of India (RCI) where each month one regional cuisine is showcased. This month RCI is showcasing Andhra Cuisine, which is being hosted by the lovely Latha of Masala Magic. It is in events like this, one can find some traditional hard-to-find culinary gems from the myriad cuisines of India and its a feast to see the round-up at the end of each month. \r\n\r\nFor this event, I intend to blog a few simple Andhra recipes. I am a brinjal lover. Alright, all you brinjal haters, let me tell you, when cooked right brinjal is the best tasting vegetable around and you would regret having missed out on relishing this vegetable. Believe me and try brinjals, its worth it, once in a while, atleast.:)\r\n\r\nToday's brinjal stir fry dish needs very few basic, freshest of ingredients, brinjals, coriander leaves, ginger and green chilli and a touch of asafoetida. Though it lacks the looks, its very satisfying on the palate. With warmth written all over, subtly spiced and a touch of sweet flavor elevates what might otherwise be just a plain simple stir fry. Makes a great side with rice and a dal dish and remember, the key is to serve this modest appearing dish hot off the stove when the brinjals are still warm and to chose the tender brinjals, ensuring its not a bitter variety.\r\n\r\n\r\nVankaya Kothimira Vepudu Recipe\r\nPrep & Cooking: 30 mts\r\nServes: 2-3 \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg purple brinjals, slice them thin lengthwise \r\n\r\nbig pinch turmeric pwd\r\n\r\n1 tbsp oil\r\n\r\nsalt to taste\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n3\/4 tsp cumin seeds\r\n\r\nbig pinch asafoetida\r\n \r\n12-15 curry leaves\r\n\r\nMake a coarse paste:\r\n\r\n1 small bunch coriander leaves (half a cup)\r\n\r\n3-4 green chillis (adjust)\r\n\r\n1\" ginger \r\n\r\n\r\n\r\n1 Heat oil in a cooking vessel. Add the mustard seeds and let them pop. Next add cumin seeds, curry leaves and asafoetida and toss about for 8-10 seconds.\r\n2 Add the brinjal slices and combine well with seasoning. Add salt and turmeric pwd and cook for 3-4 mts on high heat stirring continuously.\r\n3 Reduce heat and cover with lid and let the brinjals simmer for 10-12 mts. Stir inbetween.\r\n4 Once the brinjals are almost cooked, add the ground paste and adjust the salt. Combine well and cook uncovered on low heat for another 10-12 mts.\r\n5 Garnish with fresh coriander leaves and serve with hot rice. \r\n\r\nNote:If you don't have asafoetida on hand, add 2 crushed garlic flakes. \r\n\r\nMy entry to Lakshmi of Veggie Cuisine RCI food blogging event hosted by Latha of Magic Masala.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/vankaya_vepudu.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vankaya_vepudu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vankaya_vepudu-300x300.jpg","main-ingredient":["brinjals"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["brinjals","coriander_leaves","kothimira","vankaya"]}