{"id":5668,"permalink":"http:\/\/www.sailusfood.com\/2010\/06\/26\/savory-maida-biscuits-diamond-cuts\/","title":"Savory Maida Biscuits - Diamond Cuts","content":"Maida Biscuits - Diamond Cuts\r\n\r\nI have a lot of childhood memories associated with this savory snack. My Ammamma and Amma would prepare Maida Biscuits (the name they go by at home) and store them in large stainless steel containers. Back from school, we would head straight to the pantry, grab a plateful of maida biscuits and savor them like there was no tomorrow. Maida chips, maida biscuits, diamond cuts, maida squares, khara biscuits, whatever the name, they were extremely popular among us kids and friends.\r\n\r\nThe savory or spicy version was more popular in our household as compared to the sweet version. I shaped into squares instead of diamonds and added sesame seeds which gave a nice flavor to the munchies. Makes for an addictive tea time snack.\r\n\r\nMaida Biscuits - Diamond Cuts Recipe\r\nRecipe Source: Amma\r\nPrep & Cooking: 45 mts\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups maida\/plain flour (u can use 1\/2 cup whole wheat flour and 1 cup plain flour)\r\n\r\n1 1\/2 tbsps sesame seeds\/til\/nuvvulu\r\n\r\n1\/4 tbsp cumin seeds\r\n\r\n1 tsp red chilli pwd or green chilli paste\r\n\r\n1 tbsp hot oil or ghee or butter\r\n\r\nsalt to taste\r\n\r\nwater as required to prepare dough\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 In a wide plate, add the maida, atta, salt, chilli pwd, ghee or oil, sesame seeds and cumin seeds and combine. Knead the dough till smooth and firm. Test the dough for salt before preparing the biscuits.\r\n2 Pinch a large lemon size ball of the dough and roll into slightly thick roti. Use a fork to prick the roti all over. Using a sharp knife, cut the roti length wise about an inch apart. Then cut into 2 inch squares.\r\n3 Heat a wide heavy bottomed vessel with enough oil for deep frying and once the oil is hot, place the cut maida squares one by one into the hot oil, you will find the oil froth up in bubbles. Let the squares\/chips fry on high flame till they rise to the surface. \r\n4 Once the chips rise to the surface, turn heat to medium flame and cook the squares till they turn a golden shade. Turn them over gently during the cooking process so that they cook on all sides. Remember the frying has to be done on medium flame to achieve that golden color and crispness. If you reduce flame to low, the chips will absorb a lot of oil, so keep flame on medium to high while frying.\r\n5 Use a slotted ladle to remove onto an absorbent paper and cool. Cool completely before storing in an air tight metallic container.\r\n\r\nNote: There are many variations to prepare maida biscuits. You can replace red chilli  pwd with green chilli paste or green chilli-coriander leaves paste. You can add vaamu\/ajwain (avoid cumin if adding ajwain and use red chilli pwd).","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2009\/12\/savory-maida-biscuits.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/savory-maida-biscuits-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/savory-maida-biscuits-300x300.jpg","style":["easy","modern"],"course":["snack"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"30","prep-time":"10","main-ingredient":["maida","flour"],"goes-well-with":["tea"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Festival Foods","Flour Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["diamond-cuts","khara","maida-biscuits","snack"]}