{"id":567,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/21\/pachi-mamidikaya-kobbari-pachadi-raw-mango-coconut-chutney\/","title":"Pachi Mamidikaya-Kobbari Pachadi - Raw Mango-Coconut Chutney","content":"Earlier, I had blogged a pachadi recipe using green mango and fresh coconut, kobbari mamidikaya pachadi. Today, I'm blogging another version of this pachadi, a traditional Andhra summer favorite.\r\n\r\nThis humble, brown zesty chutney that lacks visual appeal comes from a favorful combination of fresh coconut and raw mango (both from my backyard garden) with a pleasant sweet-tangy flavor, the red chillis and spices providing the necessary kick and freckled with an aromatic seasoning of curry leaves. Magical raw food at its best, pachadi lovers would relish.:)\r\n\r\n\r\nIts an easy task putting it all together. Just make sure you don't burn the spices and use a slightly tangy variety of mango like suvarna rekha as the coconut itself is sweet with only red chillis providing the spice. You wouldn't want a sweet pachadi but a concoction that is sweet, tangy and spicy.\r\n\r\nMamidikaya Kobbari Pachadi Recipe\r\nPreparation: 20 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup of freshly grated coconut \r\n\r\n3\/4 cup raw mango, peeled and grated (if mango is too tangy reduce)\r\n\r\n1 1\/2 tbsps coriander seeds\r\n\r\n3\/4 tsp cumin seeds\r\n\r\n5 dry red chillis (increase or decrease to suit your spice level)\r\n\r\n7-8 garlic flakes\r\n\r\n14 -15 curry leaves\r\n\r\nsalt to taste\r\n\r\n1 tsp oil\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n8-10 fresh curry leaves\r\n\r\n1\/2 tsp split black gram (minappa pappu) \r\n\r\n1-2 dry red chillis, de-seed and tear \r\n\r\n1\/2 tsp oil\r\n\r\n1 Heat oil in a pan. Add cumin, coriander seeds and red chillis and fry them for 2 mts on medium heat. Add the garlic flakes and curry leaves, fry for another mt. Remove from pan and cool.\r\n2 Once cool, grind the spices to a coarse pwd and then add the grated coconut, mango and salt and grind to a coarse paste by adding very little water. A stone mortar is recommended to crush them but you can use a blender too. \r\n3 Heat oil in a small pan. Add the mustard seeds and let them pop. Add the split black gram and let it brown. Add the curry leaves and dry red chilli and toss them for a few seconds till the flavors come out.\r\n4 Turn off heat and add the seasoning to the ground mango-coconut pachadi and combine.\r\n5 Serve with hot steamed rice and ghee. \r\n\r\n\r\n\r\nMy entry to Lakshmi of Veggie Cuisine RCI food blogging event hosted by Latha of Magic Masala.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/maamidikaya_kobbari_pachadi_ingredients.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/maamidikaya_kobbari_pachadi_ingredients-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/maamidikaya_kobbari_pachadi_ingredients-300x300.jpg","main-ingredient":["raw mango"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}