{"id":5671,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/04\/pepper-chicken-roast\/","title":"Pepper Chicken Roast","content":"Today's chicken roast recipe is a huge hit at my home as well as with friends. Makes for a wonderful starter or side dish with rotis. I found this recipe at Varsha's blog which is home to authentic Kerala style non-vegetarian fare that I have bookmarked to try. The first recipe to try from her blog is Pepper Chicken Roast. I have already made it twice and will be a regular chicken dish at home. I more or less followed the recipe to the 'T' adjusting the quantities of spices used. Thank you, Varsha for sharing with us a wonderful lip-smackingly good chicken roast recipe.\r\n\r\nPepper Chicken Roast\r\n\r\nPepper Chicken Roast Recipe\r\nPrep & Cooking: 45 mts\r\nServes 4-5 persons\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg chicken, washed and cut into medium sized pieces\r\n\r\n1\" cinnamon stick\r\n\r\n1 cardamoms\r\n\r\n2 cloves\r\n\r\n7-8 whole pepper corns\r\n\r\n10-12 curry leaves\r\n\r\n2 large onions, finely sliced\r\n\r\n1 tbsp ginger garlic paste\r\n\r\n3-4 green chillis, slit\r\n\r\n1\/2 tsp turmeric pwd\r\n\r\n1 tsp freshly ground pepper pwd\r\n\r\nsalt to taste\r\n\r\n2 tbsps oil\r\n\r\nRoast and make a paste:\r\n\r\n5-6 curry Leaves\r\n\r\n3 shallots or a small onion, sliced\r\n\r\n1\/2 cup grated coconut\r\n\r\n10-12 pepper corns\r\n\r\n3\/4 tbsp coriander seeds\r\n\r\n1\/2 tsp fennel seeds\r\n\r\n3 cloves\r\n\r\n2 cardamoms\r\n\r\n1\" cinnamon\r\n\r\npinch of nutmeg\r\n\r\n\r\n\r\n1 Heat one and a half tbsps of oil in a heavy bottomed vessel, add cardamom, cloves, cinnamon stick and pepper corns and saute for a few secs. Add the curry leaves and saute till crisp.\r\n2 Add the sliced onions and saute till transparent, approx 5-6 mts. Add ginger garlic paste and saute for 4 mts. Add turmeric pwd and pepper pwd and combine well. Add the chicken and cook on high for 4 mts. Reduce flame, add salt, place lid and simmer till chicken is almost cooked.\r\n 3 Heat half a tbsp of oil in another cooking vessel, add curry leaves, coriander seeds, fennel seeds, pepper corns, cardamom, cloves, cinnamon and nutmeg and saute for 3 mts on low flame. Next add the sliced shallots and saute for 2 mts. Add the grated coconut and saute on low flame for 4 mts. Turn off heat and cool. Grind to a paste without adding water.\r\n4 Add this paste to the three fourth cooked chicken and combine well. Add few tbsps of water if the curry is too dry. Otherwise there is no need to add water. Place lid and cook for 5 mts. Now increase flame, and toss the contents for 2-3 mts. Lastly sprinkle some kasuri methi, combine well and turn off heat.\r\n5 Serve hot with rotis or rice.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/spicy-pepper-chicken-roast.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/spicy-pepper-chicken-roast-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/spicy-pepper-chicken-roast-300x300.jpg","main-ingredient":["chicken"],"author":null,"type":"post","categories":["All Recipes","Indian Chicken Recipes","Indian Fry Recipes","Indian Non-Vegetarian Recipes"],"tags":["chicken","pepper","roast"]}