{"id":57,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/18\/chole-masala-with-puri-white-chick-peas-masala-curry-with-fried-indian-bread\/","title":"Chole Masala Puri - White Chick Peas Curry with Fried Indian Bread","content":"Puri, Chole and Salad\r\n\r\nWhite chick peas or garbanzo beans or kabuli channa is a popular lentil in most parts of India. It belongs to the pea family and its nutty, creamy with less fat making it popular. They are rich in protein and are high in manganese, folate, iron and dietary fiber.\r\n\r\nChole, a Punjabi dish, is regularly cooked in my kitchen. We generally eat chole as a evening snack garnished with chopped onions and coriander leaves or eat it with puri or bhatura (Indian bread) for dinner.\r\n\r\nIngredients for Chole:\r\n\r\n1 cup white chick peas (soak overnight in 6 cups of water)\r\nTo cook the kabuli channa it has be soaked in water and pressure cooked. It is necessary to ensure that the channa is soaked in plenty of water for 6-8 hours, preferably overnight. Wash and pressure cook in good amount of water, since the channa will first bloat to third its size on soaking, then double that on pressure cooking. \r\n\r\nPressure cook for at least 5-6 whistles, to be done. Many add cooking soda to soften the channa but I think that spoils the taste. While cooking the channa, add a small pouch of muslin cloth in which a tsp of tea leaves have been tied. This will enhance the colour and flavor of the dish. You can also add a bayleaf and a stick of cinnamon.\r\n\r\n1 tsp tea leaves (tied into a small muslin cloth to form a pouch)\r\n1 cup tomato puree\r\n1 large onion\r\n1 tsp ginger garlic paste\r\n1\/2 tsp garam masala pwd\r\n1 tsp coriander pwd\r\n1\/2 tsp chilli pwd\r\n1\/4 tsp turmeric pwd\r\n1\/2 tsp cumin pwd\r\n3 tbsp oil\r\n1 tbsp punjabi chole masala (any good brand)\r\n1\/4 tsp sugar (optional)\r\nsalt\r\n1 cup water\r\nchopped coriander leaves for garnish\r\n\r\nPressure cook the white chick peas till soft but not mushy. Make a paste of 3 tbsps of the boiled chick peas. Keep aside the boiled chick peas along with the left over water (used to pressure cook the chickpeas) and the boiled chick peas paste.\r\nGrind onions to a paste.\r\nHeat 2 tbsp oil in a heavy pan. Add the onion paste and 2 slit green chillis and fry well till oil separates.\r\nNow add the ginger garlic paste and fry till oil separates stirring constantly so that it doesn't burn.\r\nAdd turmeric powder, chilli powder, coriander pwd, cumin pwd and salt. Mix well.\r\nAdd tomato puree and fry for 5-6 minutes.\r\nNow add boiled chole with the left over water and the boiled chole paste. Combine well.\r\nAdd more water if required, cover and cook till you get the desired consistency for gravy.\r\nAdd garam masala and chole masala and mix well. Garnish with chopped coriander leaves.\r\nServe hot with puri, roti or bhatura.\r\n\r\nChole \r\n\r\nIf you have an cast iron skillet use it to cook the channa. That's how the street food vendors make it - in huge kadais which are cast iron. You can cook it in any cooking vessel.\r\n\r\nMethod to prepare puris:\r\n\r\nTake a wide bowl and mix together 1 cup atta (wholewheat) flour, a dash of ghee or oil and pinch of salt. Make a well in center and slowly pour warm water and a little milk to make a smooth stiff dough (not too stiff nor too soft). It should be a slightly firm dough. Let it sit covered for 5-10 minutes. Divide dough into small lemon-sized balls and roll them out using a rolling pin, slightly thicker than rotis. The rolled out puris should be circular shaped around 6-7 cms in diameter.\r\n\r\n\r\n\r\nHeat enough oil for deep frying the puris. Slowly slide the rolled out puris into the hot oil and press gently with the spatula so that it puffs up with the steam and swell up like a balloon and turns golden brown with a light crisp. (If it doesn't rise immediately to the surface it means the oil hasn't reached the correct temperature for frying) Flip the puri to cook the other side for 15-20 seconds till it turns golden brown. Drain the puris ensuring all the oil has been drained along the sides of the cooking vessel. Remove onto a absorbent kitchen towel.\r\n\r\nIf the oil is the right temperature the puris will puff up within seconds of sliding into the hot oil. Serve piping hot with chole or potato curry or any curry of your choice. Puris taste best when hot and served immediately on frying.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2005\/12\/puri-chole2.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puri-chole2-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puri-chole2-300x300.jpg","style":["easy","traditional"],"course":["side"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["north indian"],"cook-time":"45","prep-time":"15","main-ingredient":["channa","chickpeas"],"serves":"5","goes-well-with":["rice","roti","puri","bhatura"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Bread Recipes","Indian Dal Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["channa","chole","puri"]}