{"id":5728,"permalink":"http:\/\/www.sailusfood.com\/2010\/01\/03\/indo-chinese-food-chilli-paneer\/","title":"Indo-Chinese Food ~ Chilli Paneer","content":"Hope you had a wonderful start into 2010. Wishing you a safe, happy and healthy 2010! Reflecting on 2009, I've had an enjoyable food blogging year and look forward to another year of good food, fun and cheer. \r\n\r\nChilli Paneer\r\n\r\nI'm beginning the new year with a favorite appetizer, Chilli Paneer. Last week, I prepared a vegetarian Indo-Chinese meal consisting of Sweet Corn Vegetable Soup, Chilli Paneer and Vegetable Soft Noodles with Schezwan Vegetables. \r\n\r\nChilli Paneer Ingredients\r\n\r\n\r\nControl the level of spice by reducing the amount of red chillis. Use spring onion white and greens for that authentic restaurant-style appetizer look and flavor. \r\n\r\nChilli Paneer Recipe\r\nMarination: 1 hr, Prep & Cooking: 40 mts\r\nServes: 5 persons\r\nCuisine: Indo-Chinese\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg paneer, cut into 1\" pieces (as shown in the image above)\r\n\r\n6-7 tbsps spring onion whites\r\n\r\n3-4 tbsps spring onion greens\r\n\r\n1 tbsp chopped garlic\r\n\r\n1 tbsp chopped ginger\r\n\r\n2 tsp soya sauce\r\n\r\n2 tsps vinegar\r\n\r\n1 tbsp corn flour + 5 tbsps water\r\n\r\n1\/2 tbsp sugar\r\n\r\n2 green capsicums, thin slices\r\n\r\n1 1\/2 tbsps tomato sauce\r\n\r\n1 tsp red chilli paste (soak 3 or 4 dry chillis in hot water for 10 mts, cool, grind to a paste, and saute paste in a tsp of oil for 2 mts)\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp chopped coriander leaves (optional)\r\n\r\n2 tbsps oil\r\n\r\nFor marinade: (marinate paneer with below ingredients for 10 mts)\r\n\r\nlarge pinch black pepper pwd\r\n\r\nsalt to taste\r\n\r\n1\/2 tsp chopped ginger\r\n\r\n1\/2 tsp chopped garlic\r\n\r\n1 tbsp corn flour + 5 tbsps water\r\n\r\n\r\n\r\n1 Heat oil in a flat non-stick pan, place the thinly coated paneer pieces next to one another and shallow fry till brown. Flip over and let it brown the other side. Remove and keep aside.\r\n2 Heat a heavy bottomed vessel, pour the left over shallow fried oil (if necessary add 1-2 tsps more oil), add the chopped ginger and garlic and saute on high flame for about 30 secs. Add the chopped spring onion whites and saute for 2 mts. Add sliced capsicum and stir fry on high flame for 2 mts. Add red chilli paste, tomato paste, soy sauce, vinegar, sugar and combine. Add the sauteed paneer and toss for a mt on high flame. Add 5 tbsps of water and adjust salt if necessary.\r\n 3 Add the cornflour water and combine on high flame, tossing the contents, for 2 mts. You will find that it becomes thick due to cornflour.\r\n4 Add the chopped spring onion greens and combine. Garnish with more spring onion greens. Serve hot as a starter\/appetizer.\r\n\r\nNote: Alternately, you can deep fry the marinated paneer till golden brown and follow rest of the procedure.\r\n\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/01\/chili-paneer.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chili-paneer-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chili-paneer-300x300.jpg","main-ingredient":["paneer"],"author":null,"type":"post","categories":["All Recipes","Indian Chinese Recipes","Indian Paneer Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes"],"tags":["chilli-paneer","paneer"]}