{"id":59,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/20\/vankaaya-pachadi-egg-plant-chutney\/","title":"Vankaya Pachadi - Egg Plant Chutney","content":"\r\n\r\nVankaya Pachadi recipe is similar to Punjabi dish Baigan ka Burtha. In Andhra, we do not use any of the spice powders which are used in preparing burtha. To prepare the pachadi, mustard seeds, cumin seeds and black gram are used for tempering and the egg plant is grilled or placed directly over the gas burner so that the insides of the egg plant is cooked. The flavor of the grilled brinjal\/egg plant is very different to the one where brinjals are chopped and cooked in any gravy or stir fry dish.\r\n\r\n\r\n\r\nThe big round white-green egg plants are used to prepare vankaya pachadi. When choosing the egg plants check if there are any tiny holes which may be infected with worms. The egg plant should be firm on touch but not hard. It should be tender and the seeds will be white. If very hard it means its very mature and the seeds will be black and those can be discarded.\r\n\r\nIngredients\r\n\r\n1 large green brinjal\r\n1 1\/2 tbsp tamarind paste\r\n1\/2 mustard seeds\r\n3\/4 tsp cumin seeds\r\n10 curry leaves\r\n1\/2 tsp urad dal(split black gram)\r\n1 large onion chopped\r\n3 green chillis slit length wise\r\n1 tsp chopped ginger\r\nchopped coriander leaves for garnish\r\nsalt\r\n1 tbsp oil\r\n\r\nApply oil to the egg plant and place it on the burner and keep turning the brinjal, so that the skin on the surface is uniformly blackened. Place over the burner till the egg plant softens and cooked. (Alternately you can put it on the baking sheet and bake it at 350 degrees C and keep checking it and turning it till the skin starts cracking and can be peeled off without difficulty. Remember, this process has to be done carefully so that the inner part of the egg plant is cooked well)\r\n\r\nRemove from fire when done and wash the egg plant with water. Peel the skin and mash the egg plant.This is how it looks like after the skin is peeled.\r\n\r\n\r\n\r\nAdd tamarind paste and salt to the mashed egg plant and keep aside.\r\n\r\nHeat 1 tbsp oil in a pan. Add mustard seeds and let them splutter. Now add the cumin seeds and black gram dal and let them fry till brown i.e 1 minute approx.\r\nNow add the curry leaves and fry for few seconds. Add the chopped onions,ginger and green chillis and fry till transparent. Don't brown it.\r\nNow add the mashed egg plant which has been mixed with the tamarind paste and salt. Mix well.Let it cook for 3-4 minutes.\r\nTurn off heat and garnish with chopped coriander.\r\nServe with hot rice and ghee or rotis.\r\n\r\nAndhras love their brinjals and one special dish is stuffed brinjal curry called 'Gutti vankaya kura' which is made with the small purple egg plants that is eaten with rotis or rice.","style":["easy","quick","traditional"],"course":["side"],"special-diet":["nut free","eggless","vegetarian","vegan","kid friendly","pregnancy","dairy free"],"cuisine":["andhra"],"cook-time":"15","prep-time":"15","main-ingredient":["eggplant"],"serves":"5","goes-well-with":["rice","roti"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["brinjal","eggplant","vankaya"]}