{"id":594,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/24\/mamidikaya-pulusu-raw-mango-in-tamarind-sauce\/","title":"Mamidikaya Pulusu - Raw Mango In Tamarind Sauce","content":"Sometimes we get carried away with a particular seasonal food or ingredient and end up preparing different varieties or variations of it more often than usual. During the summer season, I am obsessed with mangoes - both, raw and ripe and can never get tired of them.\r\n\r\nToday, I'm sharing with you an unforgettable summer fare delicacy prepared from raw mangoes that are not tangy but have more of a sweet flavor. The best choice for preparing this pulusu is Thotapuri (Collector kaya) or Banganpalli variety of mangoes.  \r\n\r\nThotapuri, Collector kaya\r\nThe combination of mango-tamarind-jaggery is simmered in a onion-spice base to give a magnificent red colored sauce with a distinctive taste. This astounding pulusu delivers the flavors I crave for along with hot steamed rice and mudda pappu. A handsome and satisfying meal one would want to serve loved ones and friends. \r\n\r\nMamidikaya Pulusu Recipe\r\nPreparation: 30 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 mango (thotapuri variety), skin, de-seed and cube\r\n\r\n1 drumstick, cut into 2 inch pieces (optional)\r\n\r\n2 medium sized onions, finely chopped onions\r\n\r\n2 green chillis\r\n\r\n14 -15 curry leaves\r\n\r\n1 tsp red chilli pwd (adjust)\r\n\r\n1-1 1\/2 tbsp jaggery, grated (adjust)\r\n\r\nsmall lemon sized tamarind ball, extract pulp\r\n\r\nsalt to taste\r\n\r\ncoriander leaves for garnish\r\n\r\n1\/2 tbsp oil\r\n\r\nFor poppu\/tempering\/tadka:\r\n\r\n1\/2 mustard seeds\r\n\r\n1\/4 tsp methi seeds\r\n\r\n1\/2 tsp cumin\r\n\r\n1 dry red chilli, de-seed and tear\r\n\r\nbig pinch asafoetida\r\n\r\n\r\n\r\n1 Heat oil in a pan. Add mustard seeds and let them pop, add the cumin, methi, red chillis and asafoetida and toss for a few seconds till the flavors come out but dont burn them. \r\n2 Add the curry leaves, onions, green chillis and saute till the onions turn transparent. Add the chilli pwd and salt and combine.\r\n3 Now add the mango cubes and drumstick pieces and cook for 2-3 mts, combining them often, on medium heat.\r\n4 Add the grated jaggery and cook for another minute. Add the tamarind pulp along with two cups of water. \r\n5 Pressure cook upto one whistle and turn off the flame. Once the pressure is released, open the lid and see if the mango has been cooked and turned soft. If not, let it cook uncovered till the mango pieces turn soft. Once cooked, garnish with coriander leaves.\r\n6 Serve with hot steamed rice.\r\n\r\n Note: Don't pressure cook the mango for more than one whistle as the mangoes might get gooey and try to use Kashmiri chilli pwd\r\nMy entry to Lakshmi of Veggie Cuisine RCI food blogging event hosted by Latha of Magic Masala.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/mamidikaya_pulusu.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mamidikaya_pulusu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mamidikaya_pulusu-300x300.jpg","main-ingredient":["raw mango"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["raw_mango","vegan_recipe"]}