{"id":598,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/25\/aam-ki-lassi-mango-yogurt-smoothie-mango-milk-shake\/","title":"Aam Ki Lassi - Mango Yogurt Smoothie & Mango Milk Shake","content":"Antioxidant, fibre-rich, sweet and juicy mango, considered the 'king of fruits', is the most beloved fruit to us at home. Can you imagine yourself sitting under the shade of a tree on a hot sultry day sipping a glass of chilled mango lassi? Its pure bliss! The essence of this enticing wonder, Aam ki lassi, adds a breath of freshness and its delightful sweetness enlivens our palate craving for more. \r\n\r\n\r\nSuvernarekha variety of mangoes & Aam ki lassi\r\n\r\nA classic Indian recipe prepared from ripe mango (known as aam in hindi and mamidipandu in telugu) and curd is Aam ki lassi otherwise called Mango yogurt smoothie. Its quick, easy to prepare and a meal by itself. I used Suvarnarekha variety from our backyard garden to prepare both aam ki lassi and mango milk shake. \r\n\r\nAam Ki Lassi Recipe\r\nPreparation: 5-6 mts\r\nServes 4-5 persons\r\nCuisine: North\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups ripe mango cubes\r\n\r\n1 cup curd\/yogurt\r\n\r\n1 tbsp sugar or 2 tbsps honey (adjust according to the sweetness of mango)\r\n\r\n1\/2 cup water (add more water for a thinner consistency)\r\n\r\n1\/2 cup crushed ice cubes\r\n\r\nmint leaves for garnish (optional)\r\n\r\n\r\n\r\n1 Whip the above ingredients in a blender for a little less than a minute. Adjust the consistency of the smoothie according to the variety of mango used. If its a juicy variety, it will yield a thicker smoothie. Add more water and adjust sugar accordingly, for a thinner consistency lassi. \r\n2Serve chilled, garnish with mint leaves.\r\n\r\nAnother very popular, warm weather quencher is, Mango milk shake. Prepared with minimum effort, it serves as a lazy summer meal or brunch and sure rejuvenates me on a hot day. With a strong mango flavor and undertones of cinnamom, its cool, refreshing and low on calories.:)\r\n\r\nMango Milk Shake Recipe\r\nPreparation: 5-6 mts\r\nServes 4-5 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups ripe mango cubes\r\n\r\n1\/2 lt low fat milk\r\n\r\n1 1\/2 tbsps sugar (adjust)\r\n\r\npinch of cardamom pwd (optional)\r\n\r\n1\/2 cup crushed ice cubes\r\n\r\n\r\n\r\n1 Blend the mango pulp along with a cup of milk for 15-20 seconds.\r\n2 Add the remaining milk, sugar, cardamom pwd and crushed ice and blend for another 30 seconds and serve chilled.\r\n\r\nMango milk shake\r\n\r\nMy entry to Nandita of Saffron Trail  Weekend Breakfast Blogging food blogging event,  WBB #11 hosted by Padmaja of Spicy Andhra.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2007\/05\/mango-salsa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-salsa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mango-salsa-300x300.jpg","main-ingredient":["ripe mango"],"author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Indian Drink - Sharbat Recipes","Indian Milk Recipes","Sweet Dessert Recipes"],"tags":["mango","vegan_recipe"]}