{"id":6,"permalink":"http:\/\/www.sailusfood.com\/2005\/11\/09\/easy-coriander-leaves-chutney-kothimira-pachadi\/","title":"Coriander Leaves Chutney","content":"\r\n\r\nI recently read a good article on eating right, the right kind of foods to maintain a balanced diet. The author gave some universal applicable principles that are important to follow in an ayurvedic lifestyle by choosing the right foods for balance. The basic principles she gives are to include the six tastes at every main meal, choosing foods by balancing physical attributes, choosing foods that are sattvic, opting for whole, fresh, in-season, local foods, rotating menus and experimenting with a variety of foods, including spices and herbs in our daily diet. You can read the full article on a balanced ayurvedic diet.\r\n\r\nFresh coriander leaves - Kothimira\r\n\r\nI would like to share with you a few favorite coriander leaves chutney recipes which we generally have with dosas, idlis, vadas and rice. Coriander leaves (cilantro, kothimira, dhania patta, chinese parsley) help in removing phlegm from bronchial tubes, strengthens the stomach and gives relief from flatulence. Drinking water boiled in coriander seeds (Dhania, Dhaniyalu) helps in lowering cholesterol. Read more about coriander and its wonderful properties here.\r\n\r\nHere is a recipe for coriander chutney that goes well with rice and a dash of ghee and also with idlis, dosas, pesarattu and vadas. \r\n\r\nCoriander leaves Chutney\r\n\r\nMy son loves this chutney as a spread on his sandwich. It tastes good believe me! It goes well with toast too. Try it!","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2005\/11\/kothimira-pacchadi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kothimira-pacchadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kothimira-pacchadi-300x300.jpg","style":["easy","quick","traditional"],"course":["meal"],"special-diet":["non dairy","nut free","eggless","vegetarian","healthy","vegan","gluten free"],"cuisine":["andhra","indian"],"cook-time":"10","prep-time":"5","main-ingredient":["coriander leaves"],"serves":"4","goes-well-with":["idli","dosa","vada"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["chutney","cilantro","coriander-leaves","kothimira","pachadi"]}