{"id":60,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/21\/bagara-anda-masala-eggs-cooked-in-rich-creamy-sauce\/","title":"Bagara Anda Masala - Eggs Cooked In Rich Creamy Sauce","content":"\r\n\r\nThere are innumerable ways of cooking eggs right from a simple boiled egg or bull's eye to a stuffed egg curry. Bagara Anda Masala calls for the famous Indian 'Bagara masala', an Indian curry masala where the key flavors are coconut, tamarind, peanuts and sesame seeds. Bagara Baigan (egg plant), a Hyderabadi dish is cooked in this masala which lends a certain exotic rich creamy quality that one cannot resist. Bagara Anda Masala is eggs cooked in peanut-sesame paste and in tamarind sauce, without the use of onions or tomatoes (onions and tomatoes are the basic ingredients for most Indian curries). Believe me it tastes great. This dish goes well with flavored rice, rotis or white rice.\r\n\r\nIngredients:\r\n\r\n6 boiled eggs\r\n1 1\/2 tbsps roasted peanuts\r\n1 1\/2 tbsps sesame seeds (til, nuvvulu)\r\n1 tbsp fresh coconut\r\n1\/2 tbsp poppy seeds (optional)\r\noil for cooking\r\n1\/4 tsp cumin seeds (jeera)\r\npinch of methi (fenugreek seeds)\r\n1-2 whole dry red chillis\r\n4 garlic flakes chopped\r\n8-10 curry leaves\r\n2 slit green chillies\r\n3\/4 tsp chilli powder\r\n1\/2 tsp jeera pwd\r\n1 tsp coriander pwd\r\n1\/3 tsp turmeric pwd\r\n1 1\/2 tbsp tamarind paste\r\n1 cup water - as required\r\nsalt\r\n1\/4 tsp garam masala pwd\r\n\r\nHeat 2 tsps oil in a pan and add the boiled eggs and fry for 2 minutes and remove. Make small slits with a knife along the length of the eggs and keep aside.\r\nDry roast sesame seeds and poppy seeds for 4 minutes. Grind sesame seeds, poppy seeds, fresh coconut and roasted peanuts to a fine paste adding some water. Keep aside.\r\nHeat 1 1\/2 tbsps oil in a pan. Add cumin seeds and let them splutter and then add methi seeds, curry leaves, dry red chillis, green chillis and chopped garlic. Fry for few seconds, add the ground paste. Saute till oil separates..i.e approx 10 minutes on low-medium heat and stirring it constantly so that it doesn't burn.\r\nNow add chilli pwd, turmeric pwd, coriander pwd, cumin pwd and saute again for a mt.\r\nAdd the boiled eggs and mix well. Add tamarind paste and let it cook covered for 4-5 minutes.\r\nNow add 1 cup water and salt, cover and cook on medium flame for about 12-15 minutes. Lastly add garam masala pwd (optional).\r\nServe hot along with plain white rice, biryani, paratha or roti.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2005\/12\/bagara-anda-masala1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bagara-anda-masala1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bagara-anda-masala1-300x300.jpg","style":["easy","traditional"],"course":["side"],"special-diet":["kid friendly","pregnancy","dairy free"],"cuisine":["andhra"],"cook-time":"40","prep-time":"15","main-ingredient":["eggs","sesame seeds","peanuts"],"serves":"6","goes-well-with":["rice","roti","paratha","biryani","pulao"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Egg Recipes","North Indian Recipes"],"tags":["anda","bagara","curry","egg","masala"]}