{"id":609,"permalink":"http:\/\/www.sailusfood.com\/2007\/06\/04\/royallu-mudda-kura-prawn-curry\/","title":"Royallu Mudda Kura - Prawn Curry","content":"My friend sent me some fresh water prawns the other day and also shared a lovely recipe of prawn curry. It was pretty quick to prepare and it turned out amazingly good with well balanced flavors - redolent with the sweetness of coconut and subtly spiced. Curry leaves, khus-khus and coconut form the essence of this pasty textured prawn curry (almost like a stir fry dish). \r\n\r\nDefinitely a keeper and one I would serve for a dinner party. Goes great with hot white rice of rotis.\r\nRoyallu Mudda Kura Recipe\r\nMarination: 30 mts Preparation: 30 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/2 kg shelled, remove head, tail and de-vein, washed fresh prawns \r\n\r\n2 big onions, finely sliced\r\n\r\n1 tsp red chilli pwd (adjust)\r\n\r\nbig pinch turmeric pwd\r\n\r\nsalt to taste\r\n\r\n15-20 fresh curry leaves\r\n\r\n1\/2 tbsp oil\r\n\r\nMake a paste:\r\n\r\n4-5 garlic flakes\r\n\r\n1 tbsp coriander seeds\r\n\r\n2-3 cloves (lavanga)\r\n\r\n1\" cinnamon (dalchini)\r\n\r\n1\/2 tbsp khus-khus (poppy seeds) -soak in warm water for 10 mts\r\n\r\n2\" fresh coconut piece \r\n\r\n\r\n\r\n1 Marinate the prawns in salt, turmeric pwd and chilli pwd for half an hour. \r\n2 Make a paste of the all the ingredients mentioned in 'make a paste', adding 1-2 tbsps of water.\r\n3 Boil the marinated prawns till they are almost done, approx 4-5 mts (for small to medium sized prawns and for larger prawns, boil for 7-8 mts)\r\n4 Heat oil in a cooking vessel, add the onions and curry leaves and saute till the onions turn transparent. \r\n5 Add the paste and combine well and cook on medium heat for 4-5 mts, stirring constantly as you will find that the mixture sticks to the vessel.\r\n6 Add the boiled prawns with any left over water, if any. Cook on low heat till the prawns cook in the curried paste, approx 8-10 mts. There should be no water content and stir fry till the curry coats the prawns and appears like a stir fry dish.\r\n7 Serve with hot steamed rice or rotis.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/prawn_curry.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/prawn_curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/prawn_curry-300x300.jpg","main-ingredient":["prawns"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Non-Vegetarian Recipes","Indian Seafood Recipes"]}