{"id":61,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/22\/kothimiri-pachadi-cilantro-chutney\/","title":"Kothimira Pachadi - Cilantro Chutney","content":"\r\n\r\nThis authentic Indian chutney is so versatile and goes with most foods and tastes great on crackers, sandwiches, grilled chicken, fish, chips. No Indian meal is complete without freshly prepared chutney. Traditionally served with curry and other side dishes in a traditional Indian meal\/thali to contrast the flavors. In the North its called 'Hari Chutney' (hari means green in hindi) or 'Green Chutney'. Down South chutneys are eaten with idlis, dosas, vadas and steamed rice. You can have it as a side dish, as a spread or a dip for savories like pakodas, samosas, bread or cheese rolls.\r\n\r\nIngredients:\r\n\r\n2 big bunches of fresh coriander leaves (washed and chopped)\r\n2 green chillis (slit lengthwise)\r\n2 dry red chillis\r\n1 tbsp channa dal (senaga pappu, bengal gram lentil)\r\n1 tbsp urad dal(minappa pappu, black gram lentil)\r\nÂ¼ tsp cumin seeds (jeera)\r\n1 Â½ tbsp tamarind paste\r\npinch of sugar or jaggery(optional)\r\nsalt\r\noil\r\nSeasoning- 1 tsp mustard seeds and few curry leaves\r\n\r\nHeat 1 tbsp oil in a pan. Add cumin seeds, let them splutter. Add the dry red chillis, urad dal, channa dal and fry constantly till brown (approx 2-3 minutes on medium heat).\r\nRemove from pan. To the same oil add the coriander leaves and green chillis and fry for 3-4 minutes on medium heat stirring continuously. Remove from fire and cool.\r\nGrind the fried dals mixture, tamarind paste and salt till the dals are well ground. Next add the coriander leaves and green chillis and grind to a slightly coarse paste adding little water.\r\nHeat 1\/2 tsp oil in a pan. Add mustard seeds and let them splutter and then add the curry leaves and fry for 10-15 seconds and turn off heat.Add this to the chutney and mix. Serve with idli, dosa, vada or as a dip for any savoury of your choice.\r\n\r\nI like my chutney to have a slightly sweet tangy taste so I add some jaggery or sugar. This can be stored in the refrigerator up to a week but it is advisable to finish it in a day or two. Our breakfast today was rava dosa with coriander chutney.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2005\/12\/coriander-pachadi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/coriander-pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/coriander-pachadi-300x300.jpg","style":["easy","modern","quick"],"course":["side","dip"],"special-diet":["nut free","eggless","vegetarian","vegan","dairy free","gluten\/wheat free","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"6","prep-time":"5","main-ingredient":["coriander leaves"],"serves":"5","goes-well-with":["idli","dosa","rice","vada"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Chutney Recipes - Pachadi","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["chutney","cilantro","coriander-leaves","kothimira","pachadi"]}