{"id":612,"permalink":"http:\/\/www.sailusfood.com\/2007\/05\/30\/kodi-guddu-munagakaaya-kura-egg-drumstick-curry\/","title":"Kodi Guddu Munagakaaya Kura ~ Egg - Drumstick Curry","content":"Today's curry is possibly one of my favorite combination of eggs and drumsticks, only after Egg pulusu though.:) I have an overabundance of drumsticks, fresh from the backyard garden and have been using them pretty often in my cooking lately. \r\n\r\n\r\n\r\nThere are numerous ways to cook eggs and while preparing a gravy or curry, vegetables like drumsticks or ridgegourd are added for variation and flavor. This mildly spiced curry is a simple straightforward recipe with hardly any spices going into it. Boiled eggs and drumsticks are cooked in sauteed onions, garlic and tomatoes and spiced with red chilli pwd and a good amount of fresh curry leaves are added for an enhanced aromatic flavor. Makes a satisfying curry with white rice or hot rotis.\r\nKodi Guddu Mungakaya Kura Recipe\r\nPreparation: 30 mts\r\nServes 5-6 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n6 boiled eggs, make small slits lengthwise along the egg\r\n\r\n1 drumstick, cut into 2 inch pieces \r\n\r\n2 onions, finely chopped\r\n\r\n1 large tomato, finely chopped\r\n\r\n1 tsp red chilli pwd (adjust)\r\n\r\n1\/2 tsp coriander pwd\r\n\r\nsalt to taste\r\n\r\ncoriander leaves for garnish\r\n\r\n1\/2 tbsp oil\r\n\r\nFor poppu\/tempering\/tadka:\r\n\r\n1\/2 mustard seeds\r\n\r\n1 dry red chilli, de-seed and tear (optional)\r\n\r\n3-4 crushed garlic flakes\r\n\r\n14-15 fresh curry leaves\r\n\r\n\r\n\r\n1 Drizzle oil in a cooking vessel, once hot and roast the boiled eggs on medium heat,  tossing them for 1-2 mts. Sprinkle a pinch of turmeric pwd and toss again. Remove and keep aside.\r\n2 In the same vessel, add the drumstick pieces and toss them for a minute. Remove and keep aside.\r\n3 Add the remaining oil and once hot, add mustard seeds and let them pop. Add the red chilli, garlic flakes and curry leaves and toss for a few seconds till the flavors come out but don't burn them. \r\n4 Add the onions and saute till they turn transparent. Add the chilli pwd, coriander pwd and salt, combine.\r\n5 Now add the chopped tomatoes and drumstick pieces and cook for 2-3 mts, combining them often, on medium heat.\r\n6 Add the boiled and roasted eggs and combine. Cook on low heat covered for two minutes.\r\n7 Add two cups of water, increase heat and bring to a boil. Reduce heat to medium and cook covered till it forms a thickish gravy, approx 10-12 mts.\r\n8 Garnish with fresh coriander leaves and serve with hot steamed rice.\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/eggs_drumstick_curry.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/eggs_drumstick_curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/eggs_drumstick_curry-300x300.jpg","main-ingredient":["eggs"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Egg Recipes"]}