{"id":615,"permalink":"http:\/\/www.sailusfood.com\/2007\/06\/07\/summer-salads-green-papaya-salad-som-tum\/","title":"Summer Salads ~ Green Papaya Salad - Som Tum","content":"Summer is at its peak here and its salad days at our home. Means less time spent in the kitchen - just fix a salad and a chilled drink. :) Today I prepared a popular Thai inspired raw papaya salad, Som Tam. When ever we order Thai food, this salad is a must. This is a kind of salad I could eat every other day and still not have enough of it. I found a good recipe on the 'The Good Food Show' aired on NDTV and had made a mental note of it. \r\n\r\nYou would need a wooden or earthen mortar and pestle for this recipe as the ingredients have to be lightly pounded to combine together. Don't have one, you can still make this salad by just combining the ingredients using your hands. Garlic and red chillis are pounded together followed by jaggery, lemon juice and soya sauce which are finally combined with raw papaya and tomato juliennes. This recipe is an adapted version of the authentic Thai raw papaya salad which calls for long beans and fish sauce which I omitted. The salad had a wonderfully light, sweet-sour-salty flavor with an added crunch of peanuts and raw papaya. \r\n\r\nIced cocoa-coffee and a healthy, refreshing sweet, subtly spiced and tart raw papaya salad was our lunch today and it's hard to imagine anything better suited for a hot summer afternoon.:). \r\nRaw Papaya Salad Recipe\r\nPreparation: 15 mts, \r\nServes 3-4 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups raw papaya, peeled and julienned and soaked in ice cold water\r\n\r\n3-4 garlic cloves\r\n\r\n1-2 small dried red chillies, de-seed and tear\r\n\r\n2-3 tbsps jaggery or brown sugar\r\n\r\n1 1\/2 tbsps lemon juice\r\n\r\n1 1\/2 tsp light soy sauce\r\n\r\n1 tomato, remove seeds and julienne\r\n\r\n1 small cucumber, peeled and finely sliced (optional)\r\n\r\n2 tbsp roasted peanuts \r\n\r\n\r\n\r\n1 In a mortar, lightly crush the garlic, add the chillies and lightly pound again.\r\n2 Add the jaggery, lemon juice, soy sauce. Add the roasted peanuts and lightly pound while stirring once in a while with a spoon to prevent the paste from thickening. \r\n3 Add the tomato juliennes and lightly pound and mix with spoon again. \r\n4 Add the shredded papaya and cucumber slices, lightly pound (they should just bruise a bit) and stir until all the ingredients have combined well. Don't pound too much as it will become a pasty  salad. The juliennes should hold shape while combining with the rest of the ingredients. Use a spoon to mix them well.\r\n5 Garnish with crushed peanuts.\r\nNote:If you do not have a mortar, just crush garlic, red chillis and add them to a bowl. Add the soya sauce, lemon juice and jaggery followed by green papaya and tomato juliennes along with roasted peanuts and combine well. You can also add some raw mango juliennes for variation.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/som-tum-raw-papaya-salad.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/som-tum-raw-papaya-salad-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/som-tum-raw-papaya-salad-300x300.jpg","main-ingredient":["raw papaya"],"author":null,"type":"post","categories":["All Recipes","Indian Vegetarian Recipes","Salad Recipes"],"tags":["summer_salads"]}