{"id":63,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/24\/celebrating-christmas-eve-with-sweet-pongal\/","title":"Celebrating Christmas Eve with Sweet Pongal","content":"Here's wishing you all a very Happy and Cheerful Christmas & Happy Holidays! Celebrating the Lord's birthday with this sweet dish as an offering to HIM!\r\n\r\n\r\n\r\nSweet Pongal is a sweet, pudding-like dish that is traditionally prepared in South India for the harvest festival of Makar Sankranti festival celebrated on January 14th. In the rural villages people gather in front of their homes and cook the 'sweet pongal' in earthen clay pots. \r\n\r\nThis sweet is also prepared as 'naivedyam' or 'prasadam' as an offering to God during various festivals of India.\r\n\r\n\r\n\r\nIngredients:\r\n\r\n1 cup raw rice\r\n1\/4 cup moong dhal (green gram lentil)\r\n1 1\/4 cup grated or powdered jaggery or sugar\r\n5-6 cardamoms (powdered)\r\n10-12 cashewnuts\r\n8-10 raisins\r\n2 tbsp ghee\r\n\r\nDry roast whole green gram dal till light brown in colour. Remove from fire.\r\nWash rice. Pressure cook the rice and dal till it becomes very soft and mushy. Alternately you can cook the rice and green gram dal with 3 1\/4 cups of water over stove top and set aside.\r\nCook jaggery in half cup of water till it dissolves completely.\r\nAdd the cooked rice and dal to the jaggery and cook on low flame for few minutes. Turn off heat.\r\nHeat ghee and add the cashew nuts and raisins and fry till brown and add these along with the ghee to the sweet pongal. Now add the cardamom powder and mix well.\r\nIt can be served hot or cold.","style":["easy","traditional"],"course":["dessert"],"special-diet":["eggless","vegetarian","kid friendly","pregnancy"],"cuisine":["south indian"],"cook-time":"30","prep-time":"10","main-ingredient":["rice","moong dal","jaggery"],"serves":"6","author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Dal Recipes","Indian Sweets Recipes","South Indian Recipes","Sweet Dessert Recipes"],"tags":["pongal","sweet"]}