{"id":6312,"permalink":"http:\/\/www.sailusfood.com\/2010\/04\/02\/endu-tomato-pachadi-sun-dried-tomato-pickle\/","title":"Endu Tomato Pachadi ~ Sun dried Tomato Pickle ","content":"Sun dried Tomato Pickle\r\n\r\n\r\nSummer=abundant tomatoes=sun dry=pickle preparation. :) Many of you dear readers have been very patiently waiting for sun dried Tomato pickle recipe. Amma prepared this tangy red-colored pickle in February but I get to blog it in April since March was the month of chaat. With tomatoes available in abundance and very reasonably priced, we bought 5 kilos of desi vali or heirloom tomatoes (Rs.3 per kg at our farmer's market) for pickle preparation. \r\n\r\nSun drying the tomatoes is a labor intensive process but is worth the effort keeping in mind the end result is a concentrated, intense flavored 'red gold'. Amma made two versions of tomato pickle, a garlic flavored one and the other asafoetida based. Both came out stupendously good. \r\n\r\nFarm fresh tomatoes ~ Endu Tomato Pachadi\r\n\r\nThe key is to use juicy, slightly under-ripe farm fresh heirloom tomatoes. Warmly spiced, with a heady, asafoetida flavor, the pickle has sweet and sour tones at the same time, a delight to the taste buds.\r\n\r\nEndu Tomato Pachadi Recipe\r\nRecipe Source & Prep: Amma\r\nSun drying: 3 days Prep & Cooking: 20 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 kg tomatoes, wash, dry and slice \r\n\r\n50 gms tamarind \r\n\r\n1\/2 tsp turmeric pwd\r\n\r\n3 tbsps red chilli pwd (adjust)\r\n\r\n1 tsp dry roasted methi pwd\r\n\r\n1 tbsp mustard seeds, dry roast till they splutter, cool and make pwd\r\n\r\n3 tbsps salt \r\n\r\n1\/2 tsp hing\/asafoetida\r\n\r\n6 tbsps oil\r\n\r\n\r\n\r\n1 Slice each tomato into 6 pieces. Add salt and turmeric pwd, combine and place lid. Leave aside overnight.\r\n2 Next morning, squeeze out entire liquid from each piece and spread the tomato pieces over a cloth and sun dry. Sun dry the pieces till they are completely dry with no trace of rawness. This usually takes 3-4 days of good sunshine. Every evening, remove the cloth containing the tomato pieces, place indoors and next day again place back the cloth containing the tomato pieces to sun dry.\r\n3 Pour the liquid in a very wide (shallow) vessel. Add tamarind and allow to sun dry. This could take at least 4 days of good sunshine. The liquid will thicken. Every evening, remove the tomato liquid and place indoors, place back again the next day morning to sun dry.\r\n4 Once the tomatoes and liquid are sun-dried, combine the dried tomatoes pieces with the sun dried liquid and leave overnight, covered.\r\n5 Next morning, blend this to a slightly coarse paste. Add red chilli pwd, methi pwd, roasted mustard pwd and combine. \r\n6 Heat oil in a vessel. It should not be too hot. Once hot, turn off heat. Add asafoetida and leave for 10 to 15 secs in the oil. Be careful not to burn the hing. Now add this asafoetida infused oil to the tomato mixture and combine.\r\n7 Cool and store in an airtight bottle. Refrigerate.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/04\/sun-dried-tomato-pickle.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sun-dried-tomato-pickle-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sun-dried-tomato-pickle-300x300.jpg","style":["traditional"],"course":["side","pickle"],"special-diet":["nut free","eggless","dairy free","vegan","vegetarian","pregnancy"],"cuisine":["andhra"],"cook-time":"0","main-ingredient":["tomato"],"goes-well-with":["rice","roti","tiffin"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["pachadi","pickle","sun-dried-tomato-pickle","tomatoes"]}