{"id":6314,"permalink":"http:\/\/www.sailusfood.com\/2010\/06\/03\/sun-dried-tomato-pickle-garlic-flavored\/","title":"Sun-dried Tomato Pickle (Garlic Flavored)","content":"Sun dried Tomato Pickle (Endu Tomato Velluli Pachadi)\r\n\r\nI completely missed out blogging the garlic flavored sun dried tomato pickle recipe that I had promised my dear readers. Better late than never. Today's recipe differs from the earlier blogged Endu Tomato Pachadi in terms of the seasoning. Asafoetida aka hing is replaced with crushed garlic, mustard seeds and fresh curry leaves that are tempered in hot oil before combining with the tomatoes. This lends depth of flavor and strikes a balance between the acidity and fruity sweetness of sun dried tomatoes. \r\n\r\nEndu Tomato Velluli Pachadi Recipe\r\nRecipe Source & Prep: Amma\r\nSun drying: 3 days Prep & Cooking: 20 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n2 kg tomatoes, wash, dry and slice \r\n\r\n50 gms tamarind \r\n\r\n1\/2 tsp turmeric pwd\r\n\r\n3 tbsps red chilli pwd (adjust)\r\n\r\n1 tsp dry roasted methi pwd\r\n\r\n1 tbsp mustard seeds, dry roast till they splutter, cool and make pwd\r\n\r\n3 tbsps salt \r\n\r\nFor tempering\/tadka\/poppu:\r\n\r\n10-12 peeled and crushed garlic cloves\r\n\r\n10-12 fresh curry leaves\r\n\r\n1 tsp mustard seeds\r\n\r\npinch of methi seeds\/fenugreek seeds\/menthulu\r\n\r\n3 dry red chillis\r\n\r\n5-6 tbsps oil\r\n\r\n\r\n\r\n1 Slice each tomato into 6 pieces. Add salt and turmeric pwd, combine and place lid. Leave aside overnight.\r\n2 Next morning, squeeze out entire liquid from each piece and spread the tomato pieces over a cloth and sun dry. Sun dry the pieces till they are completely dry with no trace of rawness. This usually takes 3-4 days of good sunshine. Every evening, remove the cloth containing the tomato pieces, place indoors and next day again place back the cloth containing the tomato pieces to sun dry.\r\n3 Pour the liquid in a very wide (shallow) vessel. Add tamarind and allow to sun dry. This could take at least 4 days of good sunshine. The liquid will thicken. Every evening, remove the tomato liquid and place indoors, place back again the next day morning to sun dry.\r\n4 Once the tomatoes and liquid are sun-dried, combine the dried tomatoes pieces with the sun dried liquid and leave overnight, covered.\r\n5 Next morning, blend this to a slightly coarse paste. Add red chilli pwd, methi pwd, roasted mustard pwd and combine. \r\n6 Heat oil in a vessel. It should not be too hot. Once hot, add mustard seeds and allow to splutter. Add the methi seeds, red chilies and fresh curry leaves and allow too saute for 15-20 secs on medium flame till the methi turns red. Do not burn it. Turn off flame and add the crushed garlic. Allow the seasoning to cool before combining with the tomato mixture.\r\n7 Cool and store in an airtight bottle. Refrigerate.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/01\/sun-dried-tomato-garlic-pickle.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sun-dried-tomato-garlic-pickle-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sun-dried-tomato-garlic-pickle-300x300.jpg","style":["traditional"],"course":["side"],"special-diet":["nut free","eggless","vegetarian","vegan","dairy free","pregnancy"],"cuisine":["andhra"],"cook-time":"15","main-ingredient":["tomato"],"goes-well-with":["rice","tiffin"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Pickles","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["pachadi","pickle","sun-dried","tomato"]}