{"id":64,"permalink":"http:\/\/www.sailusfood.com\/2005\/12\/31\/new-year-greetings-2006\/","title":"New Year Greetings \"2006\" & Date Balls","content":"Wishing you all a New Year filled with good health, new hope and new beginnings!\r\nThere is NO limit to the goals you can attain or the success you can achieve!\r\nMay \"2006\" open up for you more opportunities, lead you to the path of success,\r\nhappiness and prosperity.\r\n\r\nDates Balls Recipe to usher in the New Year! A very simple, low fat sweet dish, Date (Khajur) Balls, where dates are combined with crushed biscuits and dry fruits and then rolled in crushed corn flakes. Wanted to start the New Year on a sweet note. :)\r\n\r\nKhajur or Dates provide natural sugar in the form of glucose and fructose and are very healthy with high fibre content and I often use them to make Dates Balls which is a sweet with dry fruits, biscuits and corn flakes. It's healthy, nutritious and low fat. \r\n\r\n\r\n\r\n\r\nIngredients:\r\n\r\n1 cup of finely chopped dates (khajur)\r\n6-7 Britannia Marie Biscuits\r\n2 1\/2 tbsp almonds\r\n2 1\/2 tbsp pista\r\n4-5 tbsp crushed corn flakes\r\n5-6 tbsp of water\r\n\r\nAdd the water to the chopped dates in a pan and slowly cook it over low heat for 6-7 minutes or till the dates get mushy (crush with the spoon). Turn off heat and cool.\r\nDry roast the almonds and pista for 5 minutes on medium heat stirring constantly. Cool and grind to a coarse pwd.\r\nPowder the biscuits. Keep aside.\r\nMix the biscuit pwd to the dry fruits pwd. Add the cooled cooked dates to this pwd mixture and mix well.\r\nMake small balls and roll over crushed corn flakes. Refrigerate for 15-20 minutes.Serve.\r\n(If the balls are not sticky to touch, roll the balls in little honey (which makes them sticky) and then roll them over crushed corn flakes)\r\n\r\nWishing you all a very Happy New Year and God Bless!","style":["easy","modern","quick"],"course":["dessert"],"special-diet":["eggless","dairy free","vegetarian","vegan","kid friendly","gluten\/wheat free","pregnancy"],"cuisine":["western"],"cook-time":"10","prep-time":"15","main-ingredient":["dates","biscuits","dry fruits"],"serves":"6","author":null,"type":"post","categories":["All Recipes","Indian Vegan Recipes","Sweet Dessert Recipes"],"tags":["biscuits","dates","khajur","sweet"]}