{"id":6472,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/14\/hyderabadi-chicken-dum-biryani\/","title":"Hyderabadi Chicken Dum Biryani","content":"Biryani! Doesn't that word conjure feelings of joy and comfort? Who doesn't love this pampered, fragrant, rice delicacy that reigns supreme as the world best one pot meal? \r\n\r\nHyderabadi Chicken Dum Biryani\r\n\r\nFor many of my dear readers, today's post is a long awaited one. At last I got to blog the recipe of the quintessential 'home style' Chicken Dum Biryani from the royal kitchen of the Nizams. A dish that calls for an elaborate process and requires lots of TLC aka 'tender loving care' while preparing unlike the quick pressure cooker biryani. There are two versions, Kachha (raw) and Pakki (cooked) Biryani. Today's recipe is basically a Hyderabadi kachha style of biryani where marinated raw chicken and partially cooked basmati rice are layered and cooked on dum, over low heat. I prepared this biryani a couple of times, the recipe is perfect and has never failed me. Once the biryani is cooked on dum, as you open the lid, the kitchen smells fragrant, rich with the reassuring aroma of pure ghee and saffron and the chicken cooked to melt in the mouth tenderness.\r\n\r\nChicken Dum Biryani\r\n\r\nA few things to keep in mind while preparing biryani. Use best quality aged Basmati rice, good quality chicken and the best saffron available. Marinate chicken for at least 4-6 hrs and if running out of time then two hours will do. No short cut methods and all the ingredients listed below are a MUST, in other words, there are no substitutes for the mentioned ingredients.\r\n\r\n\r\nMarinated Chicken ~ Partially cooked basmati rice\r\nCaramelized Onions ~ Saffron Milk\r\n\r\nHyderabadi Chicken Dum Biryani Recipe\r\nMarination: 4 hrs Prep & Cooking: 1 hr\r\nServes 6-7 persons\r\n.\r\n\r\nIngredients:\r\n\r\n1 kg chicken, washed and drained completely\r\n\r\n2 large onions, finely sliced\r\n\r\n2 tbsps chopped coriander leaves\r\n\r\n1 tsp saffron\r\n\r\n1\/2 cup luke warm milk\r\n\r\nsalt to taste\r\n\r\n2 tbsps ghee + 5 tbsps oil\r\n\r\nFor marination:\r\n\r\n3\/4 cup thick curd\/yogurt\r\n\r\n8-10 green chillis, make a small slit in them\r\n\r\n1 1\/2 tbsps ginger garlic paste\r\n\r\n1 tbsp red chilli pwd (adjust)\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n3\/4 tbsp coriander pwd\r\n\r\n1\/2 cup chopped coriander leaves\r\n\r\n3\/4 cup pudina leaves\r\n\r\njuice of 1 lemon\r\n\r\n1 3\/4 tsps salt\r\n\r\nBiryani masala, make pwd:\r\n\r\n8 cloves\r\n\r\n1\" cinnamon stick\r\n\r\n4 elaichi\/cardamom\r\n\r\n3\/4 tsp shah jeera\r\n\r\n12 pepper corns\r\n\r\nIngredients to cook rice:\r\n\r\n4 cups Basmati rice\r\n\r\n6  cloves\r\n\r\n3 cardamoms\r\n\r\n1\" cinnamon stick\r\n\r\n3 bay leaves\r\n\r\n1 marathi mogga\r\n\r\n1 star anise\r\n\r\n10 mint leaves\r\n\r\n1 tbsp oil\r\n\r\n1 1\/2 tbsps salt\r\n\r\nwater as required\r\n\r\n\r\n\r\n1 Marinate chicken with the ingredients called for 'marination' along with biryani masala pwd. Keep aside for 4 hrs or a min of 1 1\/2 hrs. While the chicken is marinating, work on the rest of the preparation.\r\n2 Cook basmati rice in lots of water along with bay leaves, cloves, cinnamon, cardamom, marathi mogga, elaichi, oil, salt till its half cooked. Strain the water and spread the rice on a large wide plate. Allow to cool.\r\n3 Heat 1 tbsp oil + 1 tbsp ghee in a vessel, add sliced onions, saute for 8-10 mts till caramelized. Remove and keep aside.\r\n4 Add the saffron to the luke warm milk and combine well. Keep aside.\r\n5 Take a wide deep vessel to prepare the biryani. Add 3 tbsps oil, add the marinated chicken and spread out over the vessel. Cook on high for 2 mts. Add a tbsp of oil over the chicken pieces. Reduce flame.\r\n6 Spread half of the rice over the chicken layer, pour half a tbsp of ghee all over the rice, add half of the caramalized onions and spread over the rice. Next sprinkle a tbsp of coriander leaves and pour about one fourth cup of saffron milk over the rice. Over this layer, spread the remaining rice. Again pour half a tbsp of ghee all over, add remaining caramelized onions and spread over the rice. Finally sprinkle a tbsp of coriander leaves and pour remaining saffron milk over the rice.\r\n7 Place lid and over the lid place a heavy weight and seal the edges with wheat dough. Cook on high flame for 2 mts. Remove the vessel from the stove and place a iron tawa. Allow to heat. Reduce to low flame and place back the biryani vessel on the iron tawa and cook biryani for 20-25 mts. Turn off heat and do not remove lid for 10 mts.\r\n8 After 10 mts, remove lid, combine gently and serve hot with raita and curry of your choice.\r\n\r\nOur Sunday meal ~ Chicken Dum Biryani, Nilgiri Chicken Korma and Raita","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/chicken-biryani-korma.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken-biryani-korma-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chicken-biryani-korma-300x300.jpg","style":["traditional"],"course":["main"],"special-diet":["eggless","dairy","gluten free","non-vegetarian","kid friendly","pregnancy"],"cuisine":["hyderabadi"],"cook-time":"60","prep-time":"30","main-ingredient":["rice","chicken"],"serves":"5","goes-well-with":["raita","curry"],"author":null,"type":"post","categories":["All Recipes","Hyderabadi Recipes","Indian Chicken Recipes","Indian Non-Vegetarian Recipes","Indian Rice recipes"],"tags":["biryani","chicken","hyderabadi-biiryani-recipe"]}