{"id":659,"permalink":"http:\/\/www.sailusfood.com\/2007\/06\/25\/sabudana-khichdi\/","title":"Sabudana Khichdi ","content":"When RCI - Maharastrian cuisine  food blog event was announced, I knew instantly what I would prepare - Sabudana Khichidi, Maharastra's breakfast delicacy. Preparing this dish got me all nostalgic and took me on a wonderful trip down memory lane, when I reminised my friend's mother's sabudana khichidi, one of my fondest food memories - the comforting flavors of a harmonious combination of sago and peanuts.\r\n\r\n\r\n\r\nThis khichidi is prepared from sago which is tapioca starch or cassava starch white granules, available in three sizes - small, medium and large. Very light and easy to digest, and is said to be good for diabetic patients.\r\n\r\nSabudana khichidi, a vrat ka khana (fasting food) and popular breakfast food, purely because of its simplicity and flavor. Softened medium sized sago pearls (sabudana\/saggubiyyam\/saboonari\/javarisi) are combined with coarsely powdered roasted peanuts and sugar and constantly tossed in a seasoning of curry leaves, green chillis and cumin on a low heat. Potatoes are also added to enhance the flavor. Simple hearty food at its best that is flavorful and filling!\r\nSabhudana Khichidi Recipe\r\nPreparation: 20 mts, standing time to soften sago - overnight\r\nServes 3-4 persons\r\nCuisine: Maharastrian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup sago (medium size pearls) wash, drain and let it stand overnight\r\n\r\n1\/2 cup coarsely pound roasted peanuts\r\n\r\n1 tbsp sugar (adjust)\r\n\r\nsalt to taste\r\n\r\n1 tsp oil\r\n\r\n1 tbsp ghee\r\n\r\nFor poppu\/tempering\/tadka:\r\n\r\n1 tsp cumin seeds\r\n\r\n3-4 green chillis, finely chopped\r\n\r\n10-12 fresh curry leaves\r\n\r\n\r\n\r\n1 Wash the sago thoroughly, drain off the water and let it stand over night. Next day morning, run your fingers through the sago pearls and loosen the lumps if any. The sago should appear clear, translucent, swelled up and separate pearls.\r\n2 Combine coarsely pounded roasted peanuts, sugar and salt to the sago and keep aside.\r\n3 Heat both oil and ghee together and once hot, add cumin seeds and let them brown a bit. Add the chopped green chillis and curry leaves and toss for a few seconds till the flavors come out but don't burn them. \r\n4 Finally add the sago-peanut mixture and combine well with the seasoning on low heat and toss the sago mixture continously for 8-9 mts. Serve hot.\r\n\r\n\r\nNote: Check if the sago has softened by pressing between the thumb and forefinger. If you find that the centre (core) is still hard, sprinkle some water and let it stand for a little while before cooking. Don't ever cover the vessel during the cooking process since you might end up with a rubbery thick mass of khichdi. Add grated coconut towards the end of cooking process or a dash of lime for variation. If using potatoes, chop them into small cubes, add them after the seasoning and fry for about 8-10 mts until almost cooked and then add the sago-peanut mixture. \r\n\r\nMy entry to Lakshmi's   RCI - food blog event hosted by the lovely Nupur of One Hot Stove.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/sabudana-khichdi.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sabudana-khichdi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/sabudana-khichdi-300x300.jpg","main-ingredient":["sago"],"author":null,"type":"post","categories":["All Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Breakfast Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes"],"tags":["sago","vegan_recipe"]}