{"id":663,"permalink":"http:\/\/www.sailusfood.com\/2007\/07\/16\/refreshing-salads\/","title":"Refreshing Salads ","content":"I happened upon some fresh lettuce at Reliance Fresh and so it was salad days this past week. \r\nThese vibrant summer salads made for some crisp, light, cooling and refreshing meals and I am glad I could make most of the freshest summer fruits I had at hand. Less time spent in the kitchen and a wonderful way to get one's dose of healthy vegetables and fruits. I have kept them simple with bite-sized vegetables and fruits combining with the fewest of ingredients for the dressing and enriching them a liberal dose of olive oil.\r\n\r\nChicken Salad Recipe\r\nPreparation: 15 mts, \r\nServes 3-4 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup bite sized boneless cooked chicken pieces \r\n\r\nfew iceburg lettuce leaves, washed and torn into pieces\r\n\r\n1 green capsicum, cubed\r\n\r\n1 red or yellow capsicum, cubed\r\n\r\n1\/2 cup brocolli florets, blanched \r\n\r\n1 carrot, cubed and blanched\r\n\r\nFor dressing:\r\n\r\n2 tbsps olive oil\r\n\r\n1 tbsp grated tender ginger\r\n\r\n1 tbsp lemon juice or vinegar\r\n\r\n1 tbsp honey\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Cut cooked chicken into bite sized pieces. Combine with the rest of the vegetables and lettuce. \r\n2 Prepare the dressing and keep aside. Just before serving toss the the chicken and vegetables in the dressing and serve. \r\n\r\n\r\nI prepared this fruit salad with the same dressing as for the chicken salad, omitting lemon juice. Combined bite sized pieces of pineapple, apple, capsicum, sprouts and lettuce with ginger-honey-pepper dressing and the resultant salad provided a refreshing crunch. A light summer lunch on a hot day. \r\n\r\nNote:To get the most our of your salad, prepare your salad at room temperature and combine the dressing just before serving. No rules here, just combine whatever vegetables you have on hand.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/fruit_salad.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fruit_salad-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/fruit_salad-300x300.jpg","main-ingredient":["lettuce","apple"],"author":null,"type":"post","categories":["All Recipes","Fruit Recipes","Green Leafy Vegetables","Indian Vegetarian Recipes","Recipes Vegetable Dishes","Salad Recipes"]}