{"id":6638,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/19\/rasgulla-rasmalai\/","title":"Rasgulla & Rasmalai","content":"My favorite Indian dessert ~ Rasmalai\r\n\r\nTraditional sweets are usually prepared during festive occasions in our home and its been a while since I made any Indian sweet at home. I have been craving Rasmalai since quite some time but did not get myself to make a visit to our neighborhood Indian sweet store. Today, when Nehal asked me for 'Rasgullas', I got down to preparing them at home. This is the first time I ventured out to prepare home style 'Rasmalai'. One of the greatest culinary creations that has won the hearts of millions the world over. My humble Pranam (salutation) to the makers of these divine specialties!\r\n\r\nRasagulla\r\n\r\nRasgulla and Rasmalai are milk based desserts prepared with freshly prepared chenna aka cottage cheese balls. For Rasagulla, the chenna balls are cooked in sugar syrup till they double in size and are ready to be served. For Rasmalai, chenna balls that have been cooked in sugar syrup are gently squeezed off the sugar syrup and further immersed in saffron flavored sweetened thick milk to cook till soft. One of the most elegant Indian dessert delicacy with sweet and fragrant flavors!\r\n\r\nChenna balls ready for boiling ~ Balls cooking in sugar syrup\r\n\r\nRasagulla Recipe\r\nPrep: 1 hr Cooking Time: 15 mts\r\nMakes approx 15 small rasgullas or 12 large rasgullas\r\n. \r\n\r\nIngredients:\r\n\r\n1 lt milk\r\n\r\n3 tbsps lemon juice\r\n\r\n3 1\/2 cups water\r\n\r\n1 cup sugar\r\n\r\npinch of cardamom pwd\r\n\r\n1 Take a heavy bottomed vessel and boil milk. Once its boiled, slowly add the lemon juice and you will find that the milk will curdle and the whey will separate. The whey will become clear which is an indication that the milk has curdled completely. Immediately add about 10-12 ice cubes and turn off flame. Leave aside for 3-4 mts.\r\n2 Strain the whey and add the chenna to a damp cheese cloth or a light cotton cloth. Gather the four corners of the cloth and twist it gently and rinse under cold water to remove the sourness of the lemon juice. Tie the ends and hang it at a height and allow the whey from the chenna to drain completely. Leave aside for 30 mts.\r\n3  Remove the chenna onto a wide plate. Now knead it gently for 7 mts till there is no trace of moisture and is absolutely soft on touch. This is a very crucial step in the process of rasgulla making.\r\n 4 While you are kneading the chenna, prepare the sugar syrup. Place a pressure cooker on the stove and add water and sugar and allow the sugar to dissolve. Bring it to a rolling boil. Add a pinch of cardamom pwd.\r\n5 While the sugar syrup is cooking, make small smooth balls of the kneaded chenna. Ensure there are no cracks on the balls. Slowly add the chenna balls to the boiling sugar syrup. Place lid and pressure cook upto 1 whistle and continue to cook for another 4 mts.\r\n6 Turn off heat. Once the pressure is off, remove the lid. The balls will double in size and become light and springy on touch. If you feel that the balls are not cooked yet, place lid and cook for another 5 mts without the whistle at medium heat.\r\n7 Remove onto a serving dish, bring to room temp, refrigerate and serve chilled along with sugar syrup at room temp OR proceed to prepare rasmalai.\r\n\r\nRasmalai\r\n\r\nRasmalai Recipe\r\nPrep & Cooking Time: 2 1\/2 hrs\r\n. \r\n\r\nIngredients:\r\n\r\n15 small rasgullas, at room temp\r\n\r\n1 cup sugar syrup (from the rasgullas)\r\n\r\n3 cups milk\r\n\r\n1\/2 tsp cardamom pwd\r\n\r\n2 tbsps sliced pistachios\r\n\r\n2 pinches of saffron, mixed few tbsps milk\r\n\r\n\r\n\r\n1 Take a heavy bottomed vessel and add milk. Bring to a boil. Reduce to medium flame and go on stirring on a constant basis for a good 30 mts.\r\n2 Add the sugar syrup and continue to cook for another 20 mts. Add the cardamom pwd, pistachios and saffron and combine. Boil for another 5 mts.\r\n3 While the milk-sugar mixture is boiling, work on the rasagullas. Gently squeeze the rasgullas with a flat ladle such that it forms a patty shape and the syrup is drained out.\r\n4 Add the flattened rasgullas into the thickened milk and cook on low flame for 5 mts. They will absorb the sweet syrup and Rasmalai is ready. Turn off heat and cool.\r\n5 Refrigerate and serve chilled. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/rasgulla.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rasgulla-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rasgulla-300x300.jpg","main-ingredient":["milk","sugar"],"author":null,"type":"post","categories":["All Recipes","Bengali Food Recipes","Festival Foods","Indian Milk Recipes","Indian Paneer Recipes","Indian Sweets Recipes","Sweet Dessert Recipes"],"tags":["chenna","dessert","paneer","rasgulla","rasmalai","sweet"]}