{"id":6691,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/23\/methi-matar-malai\/","title":"Methi Matar Malai","content":"Methi Matar Malai\r\n\r\nFarm fresh, Methi and Matar, are available in abundance in our Rythu bazaar (Farmer's Market) at reasonable prices. The plump green peas and methi make a great combination with the rich familiar flavor of fresh cream that elevates this flavorful, creamy curry of North Indian origin. Black pepper and green chillis lend a savory note to this otherwise mildly sweet tasting curry that is modest in its appearance. A recipe that can be made ahead and works great for a get together or party. Makes for a good side with phulkas, rotis and Naan.\r\n\r\nFarm fresh green peas\r\n\r\n\r\nMethi Matar Malai Recipe\r\nRecipe Source: My old recipe files\r\nPrep & Cooking: 45 mts\r\nServes 4-5 persons\r\nCuisine: North Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n3\/4 cup fresh green peas\/pachi bataani\/matar, boiled \r\n\r\n1 1\/2 cup packed fresh methi leaves\r\n\r\n1 onion, finely chopped\r\n\r\n2 tomatoes, blanched, peel skin and chop\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1\/2 tsp black pepper pwd\r\n\r\n1\/4 cup low fat milk\r\n\r\n1 tbsp malai\/fresh cream\r\n\r\n6-7 cashewnuts + 1 tsp poppy seeds, soak 2-3 tbsps milk for 15 mts and grind to paste\r\n\r\ngaram masala pwd (2 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsps oil or ghee\r\n\r\nMake a paste:\r\n\r\n1 small onion\r\n\r\n4 green chillis\r\n\r\n1\" ginger\r\n\r\n3 cloves garlic\r\n\r\n\r\n\r\n1 Add big pinch salt+big pinch sugar to the methi leaves along with half a cup of water and let it rest for 15 mts. Squeeze water from methi and keep aside.\r\n2 Heat 2 tsps of oil in a vessel, add the methi leaves and saute of low to medium flame for 4 mts. Turn off heat and remove the methi leaves and keep aside.\r\n3 In the same vessel, add the remaining oil, add the cumin seeds and let them splutter. Add the chopped onions and saute till the onions turn transparent. Add the ground paste and saute for 5 mts.\r\n4 Add pepper pwd and combine. Add the chopped tomatoes and cook for  4 mts. \r\n5 Add the boiled green peas and methi leaves saute for a mt. Add cashew nut and poppy seeds paste and and cook for 2 mts on medium flame. Reduce flame, add milk and cook on simmer for another 5-6 mts till the gravy thickens, stirring on a constant basis. \r\n6 Add garam masala pwd and salt and combine well. Finally, add malai and combine well and turn off heat. Serve hot with rotis, paranthas or naan. \r\n\r\nHomemade Naan with Methi Matar Malai","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/methi-mattur-malai.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi-mattur-malai-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi-mattur-malai-300x300.jpg","author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Milk Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"],"tags":["malai","matar","methi"]}