{"id":6692,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/22\/how-to-make-naan-without-yeast\/","title":"How to make Naan (without yeast)","content":"All of us at home relish Naan. Most times we pick up at a take-away but in recent past I have been preparing Naan at home. Its almost close to the Naan prepared the traditional way using the tandoor (clay oven). Without the use of tandoor or an oven, and without yeast or egg, the popular Indian flatbread can be made at home with the help of our ever reliable iron tawa. It comes out wonderfully light and fluffy with a smoky flavor. I am yet to try the pressure cooker method of cooking Naan. Anyone had good results using a pressure cooker? Do let us know in the comments.\r\n\r\nOur Sunday Meal ~ Homemade Naan and Methi Matar Malai\r\n\r\nHow to prepare home style Naan:\r\n\r\n\r\nNaan Recipe\r\nDough resting: 2 hrs Prep & Cooking: 10 mts\r\nMakes approx 8-9 Naans\r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups all purpose flour\/maida\r\n\r\n1\/2 cup warm milk\r\n\r\n1\/2 cup curd\/yogurt\r\n\r\n1\/4 tsp salt\r\n\r\n1 tsp sugar\r\n\r\n3\/4 tsp baking pwd\r\n\r\npinch of baking soda\r\n\r\n1 tsp kalonji or chopped coriander or herbs of your choice (optional)\r\n\r\n1-2 tbsps butter\r\n\r\n\r\n\r\n1 Sieve flour, baking pwd, baking soda and salt two times. Place the sieved flour on a wide plate. Make a well in the center of the flour and pour sugar, milk, yogurt and slowly combine, to form a soft dough. Cover with damp cloth and let it rest for 2 hrs. \r\n2 After two hrs, knead the dough gently for 2 mts. Dust the working surface with some flour, pinch a large lemon sized dough and roll into a thick roti, slightly elongated in shape. Sprinkle a few onion seeds\/kalonji.\r\n3 Wet  your fingers with water and run your fingers along one side of the roti.\r\n4 Heat a iron tawa and once its hot, place the naan, wet side down and place a lid and cook for 40-45 secs on high flame. Remove the lid and you will find that the naan bubbles up. Now cook the other side of the naan over direct heat of the burner using tongs, spreading the naan all over the heat such that brown spots appear. Do this for a few secs only and not too close to the flame.\r\n5 Drizzle some butter over the naan and serve hot with any curry of your choice like Methi Matar Malai or Nilgiri Chicken Korma.\r\n\r\nNote: Alternately, you can pat the roti instead of rolling it, and stretch it using your fingers. \r\n\r\nHomemade Naan without yeast\r\n\r\nEarlier 'How to' articles:\r\nHow to make butter and ghee - photo tutorial\r\nHow to make rava dosa - photo tutorial\r\nHow to make ginger garlic paste\r\nHow to blanch tomatoes & onions\r\nHow to make Sambar Podi","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/naan.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/naan-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/naan-300x300.jpg","main-ingredient":["flour"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","How To Cook","Indian Bread Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["flatbread","naan"]}