{"id":67,"permalink":"http:\/\/www.sailusfood.com\/2006\/01\/03\/mutton-kurma-rich-creamy-meat-curry\/","title":"Mutton Kurma-Rich Creamy Meat Curry","content":"\r\n\r\nMost Indian Food recipes\/blends have been handed down through generations (from great-grandmom to grandmom to mom to daughter)and most curries\/dishes have always lent themselves to improvisation.Each home has its own formula or its own distinctive flavor and aroma for a particular dish depending on the spices used( spices which are freshly prepared each day for each dish).Each region of the country has its own spice blend in cooking a particular dish with each having its own distinctive flavor with variations in the spices and ingredients used in preparing that dish.\r\n\r\nThe dish am posting today is one which has the typical Mughlai flavor with a blend of spices which lends a certain exotic flavor to it.Mutton Kurma is a typical Mughlai or Hyderabadi dish cooked with yogurt ,almonds or fresh coconut.Its a mild lamb curry where mutton pieces are marinated in yogurt and mild spices and cooked in onion,tomato,poppy seeds and coconut based gravy resulting in a rich thick curry preparation. Garnish of blanched almonds,fresh cream and fresh coriander leaves further enhances the flavor of this rich tasty gosht kurma dish.\r\n\r\nIngredients:\r\n500 gms mutton ,cubed(gosht,lamb)\r\n2\" cinnamon stick\r\n5-6 cloves\r\n3 green cardamoms\r\n1 bay leaf\r\n1 tbsp poppy seeds\r\n2 tbsps grated fresh coconut\r\n2 large onions finely chopped\r\n1 medium tomato chopped\r\n1 1\/2 tbsp ginger garlic paste\r\n3-4 green chillies slit length wise(increase if you want more spice)\r\n1 tsp red chilli pwd\r\n1 1\/2 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1\/2 tsp garam masala pwd\r\n3\/4 cup thick yogurt (curd)\r\n1\/4 tsp turmeric powder\r\nsalt to taste\r\n2 tbsp oil\r\n1 tbsp ghee\r\nchopped coriander leaves for garnish\r\n\r\nOptional ingredients (for a richer creamy taste)\r\n10 blanched and sliced almonds\r\n2 tbsps warm milk\r\nfew strands of saffron\r\n1 tbsp cream\r\n\r\nClean mutton and add the curd,red chilli pwd,coriander pwd,cumin pwd,ginger garlic paste and green chillis to it.Keep aside the marinated mutton for an hour.\r\nSoak poppy seeds in a little warm water for 10 mts and grind both poppy seeds and grated coconut to a fine paste. Keep aside.\r\nHeat both oil and ghee in a heavy bottomed iron vessel and add whole spices and bay leaf and fry for 5-7 seconds. Add the chopped onions and fry till transparent.Add the chopped tomatoes and fry for 4- 5 minutes.\r\nNow add the marinated mutton and fry over medium heat with lid till the water from the meat and yogurt is absorbed.Check in between and stir.\r\nNow add the poppy seeds-coconut paste and salt to the mutton and mix well.Cover and cook for 3 mts.Add 2-3 cups of water and cook with lid till the mutton is tender and the gravy thickens.Adjust salt and add garam masala pwd and garnish with chopped coriander leaves.\r\n(You can even pressure cook the mutton for 10 minutes or till mutton is tender)\r\n\r\nIf you want a rich creamy taste,soak few strands of saffron in 2 tbsp of warm milk and add to the mutton towards the end of the cooking process.Garnish with blanched and sliced almonds and fresh cream.\r\nYour Shahi\/Mughlai Gosht Korma is ready to be relished with rotis\/naan\/paranthas , biryani or pulao,steamed white rice or dosas.\r\n\r\nFood and Drink Cooking\r\nRecipes Indian Cooking Indian Food Recipe","main-ingredient":["mutton"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes"]}