{"id":676,"permalink":"http:\/\/www.sailusfood.com\/2007\/08\/08\/tex-mex-baked-beans-and-dumplings\/","title":"Tex-Mex Baked Beans And Dumplings ","content":"I first prepared this Tex-Mex cuisine inspired dish from Nita Mehta's 'Mexican Vegetarian' cookbook, a few weeks ago along side a meal consisting of home made corn chips with mango salsa, mexican rice and watermelon agua fresca. I made it again last week on a special request from my blog visitors. \r\n\r\nThe soft swollen dumplings form a top layer by slowly simmering in a sort of rustic thick stew and made for a delectable bite. The creamy sauce has a strong garlic flavor with both savory and sweet notes. Best served piping hot, though tastes equally good at room temperature and makes a delicious side dish along with Mexican rice. A dependable and comforting recipe.\r\n \r\nDumplings in Baked Beans Sauce Recipe\r\nRecipe Source: adapted from Nita Mehta's Mexican Vegetarian Cookbook\r\nPrep & Cooking time: 40 mts\r\nServes 4-5 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 tin baked beans (450 gms)\r\n\r\n1 1\/2 tbsps olive oil\r\n\r\n2 onions, finely chopped\r\n\r\n2-3 green chillis, finely chopped\r\n\r\n8-10 garlic flakes, finely chopped\r\n\r\n1\/2 red chilli pwd\r\n\r\n1 large tomato, blanched, skinned and pureed smooth\r\n\r\n2-3tbsps tomato sauce\r\n\r\n1 tsp jaggery (optional)\r\n\r\nFor dumplings:\r\n\r\n3 tbsps makki ka atta (cornmeal)\r\n\r\n4 tbsps maida (all purpose flour)\r\n\r\nsalt and pepper to taste\r\n\r\n1 1\/2 tsps baking pwd\r\n\r\n2 egg whites\r\n\r\n3-4 tbsps milk\r\n\r\n\r\n1 Combine all the ingredients under 'dumplings' in a bowl, adding enough milk to form a dropping consistency and keep aside.\r\n2 Heat olive oil in a wide vessel, add the onions, green chillis and crushed garlic and saute till the onions turn transparent. Add chilli pwd and combine.\r\n3 Add tomato puree, salt and cook for 5-6 mts. Add the baked beans and tomato sauce and cook further for another 4-5 mts on medium heat.\r\n4 Add 2 1\/4 cups of water and jaggery and bring to a boil. When the sauce is boiling, drop a tbsp of the dumpling batter over the sauce. Repeat with the rest of the batter such that you drop 10-12 dumplings. Reduce flame and place lid.\r\n5 Let it cook on medium heat for 10-12 mts or till the dumplings cook. You will find that the dumplings will harden and remain on top. Garnish with fresh parsley. \r\nNote: Use a wide dish to cook this sauce as the dumplings should have enough room to cook. The original recipe calls for bell pepper which I didn't use since I didn't have them on hand while preparing this dish. If using bell peppers, chop them fine and add them once the onions have turned soft and saute the bell pepper for 2 mts and follow the rest of the procedure as mentioned above.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/water-melon-agua-de-fresca.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/water-melon-agua-de-fresca-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/water-melon-agua-de-fresca-300x300.jpg","main-ingredient":["baked beans"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Indian Curry Recipes","Indian Dal Recipes","Indian Vegetarian Recipes"],"tags":["summer_cooler","water_melon"]}