{"id":679,"permalink":"http:\/\/www.sailusfood.com\/2007\/08\/06\/spaghetti-in-tomato-yogurt-sauce\/","title":"Spaghetti In Tomato-Yogurt Sauce","content":"I love Italian cuisine and do prepare lasgnas and pizzas when the cravings for something cheesy sets in.:). Pasta is Satish's favorite food and he loves a variety of flavored sauces to go with it. I was in a mood to dish up a interesting flavored pasta sauce, something I hadn't prepared earlier. \r\n\r\nHaving just bought some fresh heirloom tomatoes from the farmers market, I decided on a tomato-yogurt based sauce using home made curd and a touch of cinnamom. With a great flavor combination, made for a simple, bright, healthy and satisfying meal.\r\n\r\nPasta In Tomato-Yogurt Sauce Recipe\r\nRecipe Source: Own\r\nPreparation: 30 mts\r\nServes 3-4 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n3 cups boiled spagetti \r\n\r\n2 tbsps olive oil\r\n\r\n1 large onion, finely chopped\r\n\r\n1 bay leaf\r\n\r\n1\" cinnamom stick\r\n\r\n6-7 garlic flakes, crushed\r\n\r\n4-5 large tomatoes, blanched, skinned and pureed smooth\r\n\r\n2-3 tbsps hung curd\/yogurt \r\n\r\n1 tbsp finely chopped fresh parsley or coriander\r\n\r\n1 tsp mixed dried herbs or oregano\r\n\r\n1\/4 tsp cinnamon pwd (optional)\r\n\r\nsalt to taste\r\n\r\nfreshly ground pepper as per taste\r\n\r\nparsley\/coriander for garnish\r\n\r\n1 tbsp grated cheese for garnish\r\n\r\n\r\n\r\n1 Cook spagetti in salted rapidly boiling water until al dente, drain and keep aside.\r\n2 Heat olive oil in a vessel, add the bay leaf, cinnamom stick, onions and crushed garlic and saute till transparent. Add tomato puree, chopped parsley, oregano, cinnamom pwd and salt. \r\n3 Cook for 6-8 mts, stirring once in a while. Turn off heat, remove three fourth of the cooked tomato sauce from the pan and keep aside. Once cool add the smoothly beaten hung curd\/yogurt and combine.\r\n4 In the same pan, (which has approx 6-7 tbsps of prepared tomato sauce) add a tbsp of olive oil and toss the spaghetti in the tomato sauce for 2-3 minutes stirring well to coat the spaghetti with the sauce. Adjust salt, season with freshly ground pepper and sprinkle some grated cheese. Turn off heat.\r\n5 Remove the spaghetti onto a serving dish and spoon the prepared herbed tomato sauce along the edges of the dish. Garnish with fresh parsley and grated cheese.\r\nNote: You can prepare this with fussili, macaroni or farfalle also. Remove bay leaf and cinnamom stick from the prepared tomato sauce before serving. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/spaghetti-in-tomato-yogurt-sauce.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/spaghetti-in-tomato-yogurt-sauce-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/spaghetti-in-tomato-yogurt-sauce-300x300.jpg","main-ingredient":["spaghetti"],"author":null,"type":"post","categories":["All Recipes","Easy Pasta Recipes","Indian Vegetarian Recipes"],"tags":["spaghetti"]}