{"id":6799,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/01\/indian-street-food-pani-puri-gol-gappa\/","title":"Indian Street Food ~ Pani Puri (Gol Gappa)","content":"Puchka aka Pani Puri\r\n\r\nMarch will be 'Indian Street Food' special on 'Sailu's Kitchen' where I will be featuring Chaat and snack recipes. I will try to cover as many recipes as I can prepare during this month. Chaats are India's National Snacks like hot dogs or burgers are to America or Tacos are to Mexico. The innumerable Chaats and snacks showcase a myriad of flavors and textures - sweet, salty, tangy, spicy, soft and crispy, that epitomize Indian food. \r\n\r\nToday, I'm blogging a tongue tickling crowd pleaser, popular all over the country. It is known by different names based on the region - Gol Gappa (East India), Pani Puri (West & South India) or Puchka (North India). This street food sensation is popular among all age groups as it adds a flavorful punch to the palate. Each region or home have their own version of Pani Puri, in terms of fillings. \r\n\r\nPuri\r\n\r\nBasically pani puris are small balls made of flour and semolina, rolled out into very small puris and deep fried to a golden shade, cooled and stored in air tight containers. The hollow puri is slightly crushed on the top and filled with a little each of mashed potatoes, chopped onions and sweet chutney, then dipped in a chilled mint flavored tangy water, and eaten as a whole, in one mouthful. As you savor the pani puri, you can literally feel the explosion of flavors in your mouth, an assortment of crisp, tangy, spicy tastes. \r\n\r\n\r\nPuri\/Puchka Recipe\r\nPrep: 10 mts, Sitting time: 30, Cooking time: 20-30 mts\r\nServes 8-10 persons\r\nCuisine: Indian\r\nSource: Recipe files\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/2 tbsp maida\/all-purpose flour\r\n\r\n2 tbsps urad dal flour\r\n\r\n1 1\/4 cups ravva\/semolina\/sooji (very fine variety)\r\n\r\nsalt to taste\r\n\r\nwater for kneading (bottled soda water prefered)\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Combine all the mentioned ingredients (except oil for deep frying), adding water slowly and make a dough. Leave aside covered with damp cloth for 15 mts. (very imp step)\r\n2 While the dough is resting. (i) Prepare the pani (water) required for the puchka. (ii) Boil two potatoes, peel and mash. Combine the mashed potato with little salt and red chilli pwd and keep aside until use. (iii) Chop a large onion finely and keep aside until use.\r\n3 Knead the dough again. Pinch off some dough and make very small balls. Roll out small thin rotis, using the rim of a container to cut out the round shape. Keep them covered.\r\n4 Heat enough oil for deep frying in a heavy bottomed vessel. It should be on medium high (the oil should not be piping hot) and once its hot, slide few rotis into the hot oil and using the back of the ladle, press in the center and along the edges and you will find it will puff. Flip over and fry the other side till light golden brown. Don't fry too much as it will turns too dark. Remove on to absorbent paper.\r\n 5 Cool and store in an air tight container and use when required.\r\n\r\nNote: Ensure the oil is hot enough before frying the puri. If the oil is not hot enough, the roti will absorb a lot of oil. If made ahead of time, lightly warm in oven for 3-4 mts before serving. Ensure to roll out very think puris. And use very fine sooji.\r\n\r\nPani Puri\r\n\r\n\r\nPani (Puri) Recipe\r\nPreparation: 10 mts\r\nCuisine: Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n6-7 cups cold water\r\n\r\n1\/2 cup packed pudina leaves\r\n\r\n1 green chilli\r\n\r\nsmall piece ginger\r\n\r\n1 tbsp amchur pwd\r\n\r\n1\/2 tsp chaat masala pwd\r\n\r\n1\/4 tsp cumin pwd\r\n\r\npinch of black salt (optional)\r\n \r\nfresh coriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Make a paste of mint leaves, green chilli and ginger and keep aside\r\n2 Take a vessel, add the cold water in it, followed by the green mint paste and combine well.\r\n3 Add cumin pwd, chaat masala pwd, amchur pwd, black salt, salt to taste. Garnish with coriander leaves. Chill in refrigerator till use.\r\n\r\nAssembling Pani Puri:\r\n\r\nTake a small puri in your palm and lightly press the top to make a hole in the puri. Stuff with a tsp of spiced mashed potato, 1\/2 tsp of chopped onions, 1 tsp of sweet chutney, pour 2 tbsps of the prepared chilled mint pani and stuff the whole puchka into your mouth. Then savor the explosion of flavors. :)\r\n\r\nGol Gappa\r\n\r\nUpdate: Due to heavy traffic, server crashed, hence the blog was not accessible. The issue has been fixed now and hopefully things will be smooth. Sorry for the inconvenience.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/puchka-pani-puri.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puchka-pani-puri-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/puchka-pani-puri-300x300.jpg","style":["easy","modern"],"course":["snack"],"special-diet":["nut free","eggless","dairy free","vegetarian","vegan","kid friendly"],"cuisine":["north indian"],"cook-time":"30","prep-time":"30","main-ingredient":["semolina","flour","atta","potato","onions"],"serves":"12","goes-well-with":["tea"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes"],"tags":["chaat","gol gappa","pan puri","puchka"]}