{"id":6800,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/09\/masala-puri-chaat\/","title":"Masala Puri Chaat","content":"Masala Puri ~ Ragda Puri\r\n\r\nChaat is the most fascinating culinary concoctions prepared in the street corners or gallis of every city\/town of our country. Isn't the smell of street food enticing? Isn't it exciting to watch the street food vendor swiftly assemble a plate of Chaat with all its colorful assortment of spices and chutneys? Just one mouthful is enough to relish the contrasting flavors with gusto. Its probably the best snack one has  devoured, leaving with an after taste that is hard to forget.\r\n\r\nMasala Puri Ingredients\r\n\r\nEach region has its version of Masala Puri aka Ragda Puri. A Chaat special that has curried peas aka ragda as a topping over crushed puris, a smothering of meeta chutney and green chutney and finished off with sev. A popular quick eat that is lip smacking delicious!\r\n\r\n\r\nRagda Recipe\r\nSoaking: 8 hrs Prep & Cooking: 40 mts\r\nServes 4-5 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n250 gms green or white peas, soak in water overnight and pressure cook till soft\r\n\r\n1 large onion, finely chopped\r\n\r\n1 large tomato, finely chopped\r\n\r\n3-4 green chillis, slit length wise\r\n\r\n1 tsp grated ginger\r\n\r\n1\/4 tsp asafoetida\/hing\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/2 tsp cumin pwd\r\n\r\ngaram masala pwd (2 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\n1 tbsp tamarind paste\r\n\r\nfresh coriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp ghee\r\n\r\n1 Heat oil in a vessel, add the cumin seeds and let them splutter. Add green chillis and grated ginger and saute for 4-5 seconds. Immediately add the asafoetida, followed by the onion. Cook on medium heat for 4-5 mts.\r\n2 Add the spice pwds (except garam masala pwd) and salt. Combine well. Add the tomatoes and cook until soft.\r\n3 Add the boiled peas (keep aside 3 tbsps of boiled channa and mash them). Add a cup of water and cook on high heat for another 3-4 mts. Reduce flame and cook on simmer for another 7-8 mts. Add the mashed channa and combine. Add the tamarind paste, combine and cook for another 3-4 mts. \r\n4 While the ragda is simmering add garam masala pwd. The gravy will begin to thicken.  Adjust the salt. Garnish with fresh coriander leaves.\r\n5 Serve hot with bhatura or rotis or proceed to prepare Ragda patties or Masala Puri. \r\n\r\nPuri\r\n\r\n\r\nPuri\/Puchka Recipe\r\nPrep: 10 mts, Sitting time: 30, Cooking time: 20-30 mts\r\nServes 8-10 persons\r\nCuisine: Indian\r\nSource: Recipe files\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/4 cup maida\/all-purpose flour\r\n\r\n1\/2 cup urad dal flour\r\n\r\n1 1\/2 cups ravva\/semolina\/sooji\r\n\r\nlittle less than 1\/4 cup atta\/whole wheat flour (those who are allergic to wheat can omit)\r\n\r\n1 tbsp oil or ghee\r\n\r\nsalt to taste\r\n\r\nwater for kneading\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Combine all the mentioned ingredients (except oil for deep frying), adding water slowly and make a dough. Leave aside covered with damp cloth for 30 mts. \r\n2 Knead the dough again. Pinch off some dough and make very small balls. Roll out small thin rotis, using the rim of a container to cut out the round shape. \r\n3 Heat enough oil for deep frying in a heavy bottomed vessel. It should be on medium high and once its hot, slide the roti into the hot oil and using the back of the ladle, press in the center and along the edges and you will find it will puff. Flip over and fry the other side till light golden brown. Don't fry too much as it will turns too dark. Remove on to absorbent paper.\r\n 4 Cool and store in an air tight container and use when required.\r\n\r\nNote: Ensure the oil is hot enough before frying the puri. If the oil is not hot enough, the roti will absorb a lot of oil. In case you do not have urad dal flour, replace it with 1\/2 cup of maida. If made ahead of time, lightly warm in oven for 3-4 mts before serving. Instead of water, you can use soda water (fizz) to make the dough. Ensure to roll out very think puris. And use very fine sooji.\r\n\r\n\r\nMasala Poori Chaat\r\n\r\nHow to make Masala Puri Chat:\r\n\r\nTake a wide serving plate. Crush some puris or papdi and prepare the first layer, next layer with mashed potato. Over that spoon the warm ragda along with enough gravy. Sprinkle chopped onion and tomato. Spoon some green chutney and sweet tamarind chutney. Spoon sweetened curd\/dahi (purely optional). Finally finish off with coriander leaves, a pinch of saunf pwd (optional) and sev. Serve immediately. Best savored when ragda is warm.\r\n\r\nGreen (Hari) Chutney Recipe\r\nSweet (Meeta) Chutney Recipe\r\nSev Recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/masala-poori-chaat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masala-poori-chaat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/masala-poori-chaat-300x300.jpg","style":["easy","modern"],"course":["snack"],"special-diet":["nut free","eggless","vegetarian","vegan","gluten\/wheat free","kid friendly","pregnancy","dairy free"],"cuisine":["indian"],"cook-time":"45","prep-time":"30","main-ingredient":["dried peas","papdi"],"serves":"8","goes-well-with":["tea","juice","lassi"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Dal Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes"],"tags":["chaat","masala-puri","ragda"]}