{"id":6801,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/08\/ragda-patties-aloo-tikki-chaat\/","title":"Ragda Patties ~ Aloo Tikki Chaat","content":"Wishing all my dear women readers and bloggers a Happy Women's Day!\r\n\r\nRagda Patties\r\n\r\nMumbai's popular fast food snack prepared with curried dried peas aka ragda that is spooned over Aloo Patties\/Cutlets along with an assortment of chutneys and garnished with onion, tomatoes, sev and fresh coriander leaves. Also known as Aloo Tikki Chaat in North India, where its prepared without ragda. A plate of ragda patties along with a glass of fresh juice or lassi makes for a filling, wholesome evening meal.\r\n\r\nRagda Patties Ingredients\r\n\r\n\r\nRagda Recipe\r\nSoaking: 8 hrs Prep & Cooking: 45 mts\r\nServes 4-5 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n250 gms green or white peas, soak in water overnight and pressure cook till soft\r\n\r\n1 large onion, finely chopped\r\n\r\n1 large tomato, finely chopped\r\n\r\n3-4 green chillis, slit length wise\r\n\r\n1 tsp grated ginger\r\n\r\n1\/4 tsp asafoetida\/hing\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1\/2 tsp cumin pwd\r\n\r\n1 tsp coriander pwd\r\n\r\ngaram masala pwd (2 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\n1 tbsp tamarind paste (optional)\r\n\r\nfresh coriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil\r\n\r\n1 Heat oil in a vessel, add the cumin seeds and let them splutter. Add green chillis and grated ginger and saute for 4-5 seconds. Immediately add the asafoetida, followed by the onion. Cook on medium heat for 4-5 mts.\r\n2 Add the spice pwds (except garam masala pwd) and salt. Combine well. Add the tomatoes and cook until soft.\r\n3 Add the boiled peas (keep aside 3 tbsps of boiled peas and mash them). Add a cup of water and cook on high for 3-4 mts. Reduce flame and cook on simmer for 7-8 mts. Add the mashed peas and combine. Add the tamarind paste, combine and cook for 4-5 mts. \r\n4 While the ragda is simmering, add garam masala pwd. The gravy will begin to thicken. Adjust the salt. Garnish with fresh coriander leaves.\r\n5 Serve hot with bhatura or rotis or proceed to prepare Ragda patties or Masala Puri. \r\n\r\nRagda Pattice\r\n\r\nHow to make Ragda Patties Chat:\r\n\r\nAloo Tikki Recipe - Combine 2 mashed potatoes (should be cooled completely), 2 bread slices (remove sides), pinch of red chili pwd, 1 tsp green chilli-ginger paste, salt to taste. Make small patties\/cutlets and shallow fry till golden brown on both sides.\r\n\r\nTake a wide serving plate. Place two aloo tikkis, spoon some warm ragda over the tikkis. Next spoon green chutney and sweet tamarind chutney. Spoon sweetened curd\/dahi (purely optional). Sprinkle some chopped onion and tomatoes. Finally finish off with  sev and coriander leaves. Serve immediately. Best savored when ragda is warm.\r\n\r\nGreen (Hari) Chutney Recipe\r\nSweet (Meeta) Chutney Recipe\r\nSev Recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/chat-ragda-patties.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chat-ragda-patties-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chat-ragda-patties-300x300.jpg","style":["easy","modern"],"course":["snack","meal"],"special-diet":["nut free","eggless","vegetarian","dairy free","gluten\/wheat free","healthy","vegan","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"45","prep-time":"15","main-ingredient":["potato","dried peas","onions"],"serves":"7","goes-well-with":["tea","juice"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","North Indian Recipes"],"tags":["aloo","chaat","patties","ragda","tikki"]}