{"id":6811,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/07\/sev-omapodi-sana-karapusa\/","title":"Sev ~ Omapodi (Sana Karapusa)","content":"Sev ~ Omapodi\r\n\r\n\r\nSev aka Omapodi\/Karapusa is an essential savory item along with Sweet chutney and Green chutney, forming an integral part of most Indian street food snacks. Sev is prepared with chickpea flour (besan) and rice flour. Usually sev that is used to garnish chaats is much thinner than what you see in the picture above. I used the smallest holes of my sev press which yielded a slightly thick sev than the usual chaat sev. \r\n\r\nTastes divine on its own over a cup of hot chai or can be garnished over homemade chaat or prepare a savory mixture.\r\n\r\nSanna Karapusa deep frying - Sev\r\n\r\nSev Recipe\r\nPrep & Cooking: 1 hr\r\n.\r\n\r\nIngredients:\r\n\r\n1 cup rice flour\r\n\r\n1 1\/4 cup chick pea flour\/besan\/senaga pindi\r\n\r\n1\/4 tsp red chilli pwd (optional)\r\n\r\n1\/2 tsp powdered vaamu\/ajwain (optional)\r\n\r\nsalt to taste\r\n\r\n1 tbsp hot ghee or oil\r\n\r\noil for deep frying\r\n\r\n\r\n\r\nMurukku press\/Janthikalu gottam or chatram\r\n\r\n1 Put together rice flour, gram flour, salt, hot ghee or oil, chilli pwd and ajwain and combine well. Slowly add water little by little to make a soft dough, just soft enough that it is pressed through easily with the janthikalu\/chakali press. Test the dough for salt before deep-frying.\r\n2 Heat a wide heavy bottomed vessel with enough oil for deep frying. Take the janthikalu gottam aka murukku press and use the disc with smallest holes. Fill half of the press with the dough and once the oil is hot, reduce to medium flame and using circular motion, press the jantikalu gottam to make concentric layers of the sev dough. As you press the dough into the hot oil, you will find the oil froths up in bubbles which will eventually subside as the sev turns to a golden shade. Remember the frying has to be done on medium flame to achieve that golden color and crispness.\r\n3 When the sev turns a golden color, turn over to the other side and let it also cook to a golden brown. Use a slotted ladle to remove onto an absorbent paper and cool. Repeat the same process till the rest of the dough is done. Cool completely before storing in an air tight metallic container.\r\n\r\nAndhra Traditional Pindi Vantakam - Jantikalu Recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/omapodi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/omapodi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/omapodi-300x300.jpg","style":["traditional"],"course":["snack"],"special-diet":["nut free","eggless","vegetarian","vegan","gluten\/wheat free","kid friendly","pregnancy","dairy free"],"cuisine":["indian"],"cook-time":"40","prep-time":"5","main-ingredient":["besan","rice flour"],"serves":"15","goes-well-with":["tea","chaat"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Flour Recipes","Indian Vegan Recipes","North Indian Recipes","South Indian Recipes"],"tags":["karapusa","omapodi","sev"]}