{"id":682,"permalink":"http:\/\/www.sailusfood.com\/2007\/08\/30\/tiffin-treats-baked-macaroni-and-cheese\/","title":"Tiffin Treats - Baked Macaroni And Cheese","content":"Preparing my son's evening tiffin\/dinner meals is always a challenging task. I have had numerous requests for tiffin varieties for toddlers and children and they all voice the same opinion - we need variety, variety or more variety of healthy and delicious tiffins\/meals! \r\n\r\n\r\nYesterday, I prepared a cheesy macaroni casserole for Nehal, a recipe I adapted from Sanjeev Kapoor's cookery show. Easy to prepare - a lively merger of sauteed onions, capsicum, garlic and tomatoes, combined with boiled macaroni, topped with white sauce, garnished with cheese and finally baked to perfection. A comforting hearty casserole sure to get your child asking for more.\r\nBaked Macaroni And Cheese Recipe\r\nRecipe Source: Adapted from Sanjeev Kapoor's Cookery Show\r\nPreparation: 40 mts\r\nServes 3-4 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups boiled elbow macaroni \r\n\r\n1 1\/2 tbsp olive oil\r\n\r\n1 large onion, finely chopped\r\n\r\n1 bell pepper, finely sliced\r\n\r\n6-7 garlic flakes, crushed\r\n\r\n1 large tomato\r\n\r\nfistful of boiled sweet corn (optional)\r\n\r\nsalt to taste\r\n\r\nfreshly ground pepper as per taste\r\n\r\nbig pinch mustard pwd (optional)\r\n\r\n1 tbsp grated cheese for garnish\r\n\r\n1 tbsp chopped fresh parsley for garnish\r\n\r\nFor white sauce:\r\n\r\n1 tbsp maida\r\n\r\n1 tbsp butter\r\n\r\n1 cup low fat milk (room temp)\r\n\r\n1 tbsp grated cheese\r\n\r\nsalt and pepper to taste\r\n\r\n\r\n\r\n1 Cook macaroni in salted rapidly boiling water until al dente, drain and keep aside.\r\n2 Heat olive oil in a vessel, add the onions, capsicum and crushed garlic and saute till transparent. Add the chopped tomato and salt. \r\n3 Cook for 8-10 mts, stirring once in a while. Add the boiled corn and combine.\r\n4 While the onion-tomato base cooks, prepare the white sauce. Heat a pan, on low flame, add the butter and let it melt. Add maida and keep stirring using a hand whisk over a low flame till well blended. Slowly add the milk, stirring continuously. Next add the grated cheese. On medium heat continue to stir until you have a nice smooth consistency sauce. Once in a while, remove the vessel away from the heat for a few seconds and place it back while stirring. Season with salt and pepper. Keep aside.\r\n5 Next add the boiled macaroni to the cooked onion-tomato base and toss for 2-3 minutes stirring well to coat. Adjust salt, season with freshly ground pepper, mustard pwd and sprinkle some grated cheese. Turn off heat.\r\n6 Remove macaroni onto a baking dish and spoon the prepared white sauce along the edges of the dish. Garnish with grated cheese. Bake in a pre-heated oven  at 200 degrees C for 10 mts.\r\nNote: You can prepare this with fussili or farfalle also. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2007\/08\/macaroni-cheese.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/macaroni-cheese-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/macaroni-cheese-300x300.jpg","main-ingredient":["macaroni"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Easy Pasta Recipes","Featured Recipes","Lunch Box Recipes"],"tags":["baked macaroni"]}