{"id":6830,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/21\/kitchen-essentials-measuring-cups-spoons\/","title":"Kitchen Essentials ~ Measuring Cups & Spoons","content":"Tablespoon & Teaspoon used for my daily Indian cooking\r\n\r\nKeeping in mind some of my dear readers predicament with regard to measurement of ingredients, on their request, I am doing this post on measuring cups and spoons that I use in my daily cooking and baking. The picture you see above of stainless spoons are the tablespoon and teaspoon that I constantly use for my Indian cooking. I should mention here that often my style of cooking is based on 'andaz' (eyeball) measurements and I could go wrong while mentioning the quantity of spices used in a particular recipe. You will have to use your own judgment while working on the recipe. :)\r\n\r\nMeasuring Cups &  Spoons\r\n\r\nThe red measuring cups and spoons you see above are standard American measurement from IKEA. I use the cups for both Indian cooking and baking while I use the spoons only for baking which requires precise measurement. They are convenient to store requiring less storage space and have the measurements embossed on the handles.\r\n\r\nAmerican Measurements:\r\n\r\n1 cup - 240 ml\r\n1\/2 cup - 120 ml\r\n1\/3 cup - 80 ml\r\n1\/4 cup - 60 ml\r\n\r\n1 tbsp - 15 ml\r\n1 tsp - 5 ml\r\n \r\nAre you like me where you eyeball the amount of spices\/ingredients that go into your cooking? Or do you follow the exact measurements as mentioned in the recipe? Do you also use the tablespoon and teaspoon that I use in my cooking? Do let me know in the comments.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/measuring-cup-sizes.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/measuring-cup-sizes-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/measuring-cup-sizes-300x300.jpg","author":null,"type":"post","categories":["All Recipes","Misc"],"tags":["measuring-cups","tablespoon","teaspoon"]}