{"id":686,"permalink":"http:\/\/www.sailusfood.com\/2007\/08\/23\/bhindi-do-pyaaza-okra-onion-stir-fry\/","title":"Bhindi Do Pyaaza - Okra-Onion Stir Fry","content":"One of my favorite culinary delights is savoring a meal of bhindi do pyaza with hot rotis and a spicy pickle on a monsoon day (not that I don't prepare it during the rest of the seasons:)). A comforting and satisfying meal during the monsoon season along with some deep-fried, crunchy fritters like pakodas or mirchi bhaji at tea time. These rainy day treats are a seasonal indulgence one can't help but succumb to.\r\n\r\nA popular dish in most restaurant menus, Bhindi do pyaaza, as the name suggests is okra cooked along with double measure of onions (do pyaza) generally meaning double the quantity of onions usually used in preparing a dish. Crisp stir fried okra is tossed in a semi-dry onion-tomato masala and seasoned with kasoori methi which gives this dish its unique flavor besides a liberal amount of sauted sliced onions which lends the otherwise bland okra a sweet taste. This is the kind of vegetable subzi I would reach out for a second and sometimes a third helping too.:)\r\nBhindi Do Pyaaza Recipe\r\nSource: My recipe files\r\nPrep & Cooking: 35 mts\r\nServes: 3-4 \r\nCuisine: North Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1\/4 kg fresh tender lady's finger, chop into 1\" inch pieces\r\n\r\n1\/4 kg onions, finely sliced\r\n\r\n1 large tomato, finely chopped\r\n\r\n3\/4 tsp cumin seeds\r\n\r\n1\" ginger piece, grated\r\n\r\nbig pinch turmeric pwd\r\n\r\npinch asafoetida\/hing(optional)\r\n\r\n1 1\/2 tsp coriander pwd\r\n\r\n1\/4 tsp garam masala pwd (optional)\r\n\r\n1\/2 tsp kasoori methi (dry fenugreek leaves)\r\n\r\nsalt to taste\r\n\r\n1\/4 tsp sugar\r\n\r\n2 tbsp coriander leaves\r\n\r\n1 1\/4 tbsp oil \r\n\r\n\r\n\r\n1 Wash and dry the okra thoroughly (dry with a kitchen towel). Trim the ends and cut them into one inch pieces.\r\n2 Heat one fourth tbsp of oil in a cooking vessel. Add the sliced okra pieces and stir fry them till they are three-fourth cooked. Constantly stir fry on medium to ensure they don't burn or stick to the pan. Add salt and turmeric pwd and remove.\r\n3 In the same pan, add the remaining oil. Add the cumin seeds and toss for 8-10 seconds. Add the asafoetida, grated ginger and immediately add the sliced onions and saute till they are transparent yet crisp.\r\n4 Add the chilli pwd, coriander pwd, garam masala pwd and saute for 2-3 mts. Add the chopped tomatoes and cook further for another 4-5 mts.\r\n5 Now add the stir fried okra and combine well and cook further uncovered for 12-15 mts. Add kasoori methi, sugar and lemon juice. Combine well and adjust salt. Turn off heat.\r\n6 Garnish with fresh coriander leaves and serve with hot rotis or rice. \r\nNote: I prepare another version of this dish where 2-3 tbsps of beaten curd is added towards the end of the cooking process. Keep stir frying on medium heat till the curd is well blended with okra and onions.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/bhindi-do-pyaaza.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bhindi-do-pyaaza-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bhindi-do-pyaaza-300x300.jpg","main-ingredient":["okra"],"author":null,"type":"post","categories":["All Recipes","Indian Fry Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"]}