{"id":689,"permalink":"http:\/\/www.sailusfood.com\/2007\/08\/28\/tomato-curry\/","title":"Tomato Curry","content":"Simplicity at its best! Quick, easy to prepare and a great tasting dish is this tomato curry, with the right balance of sweet, tangy, garlicy and spicy flavors. A regular curry at our home especially when I run out of vegetables. All you need are ripe tomatoes, onions, lots of garlic and fresh aromatic curry leaves and you have a perfect curry to go with rotis, dosas,  pulagam or khichdi.\r\n Tomato curry with khichdi\r\nThe tomato curry recipe is basic and you can play around with the spices and seasonings to suit your taste. Just one spice or herb can enhance the flavor of the curry and take it to another level. For example, a liberal dose of freshly chopped coriander as a garnish gives the curry a herby flavor. A touch of garam masala or kasoori methi (dried fenugreek leaves) or the use of asafoetida in place of garlic completely changes the flavor of the curry to transform a simple lunch time fare into something special.\r\n Garlicy Tomato Curry Recipe\r\nSource: Amma\r\nPrep & Cooking: 25 mts\r\nServes: 4-5\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1\/2 kg fresh tomatoes, finely chopped\r\n\r\n2 large onions, finely chopped\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n10-12 fresh curry leaves\r\n\r\n10-12 garlic cloves, slightly crushed\r\n\r\npinch of turmeric pwd\r\n\r\n1 tsp red chilli pwd (adjust)\r\n\r\n1\/2 tsp coriander pwd\r\n\r\nsalt to taste\r\n\r\n1 tbsp grated jaggery\r\n\r\n2 tbsp coriander leaves\r\n\r\n1 tbsp oil \r\n\r\n\r\n\r\n1 Heat oil in a vessel. Add the mustard seeds and let them pop. Add the crushed garlic and curry leaves and toss them for 8-10 seconds.\r\n2 Add the onions and fry till translucent. Add the chilli pwd, turmeric pwd, coriander pwd and salt. Combine well.\r\n3 Add the chopped tomatoes and cook on medium heat uncovered for 4-5 mts. Reduce heat and cook covered for another 5 mts.\r\n4 Add a glass of water, jaggery, adjust salt and cook covered till you get the desired gravy consistency.\r\n5 Garnish with fresh coriander leaves and serve with hot chapatis, rice, pongal, khichidi or dosas. \r\nNote: Boil eggs, make slits and add to the cooked tomato-onion mixture before adding the water. You can even add drumsticks for added flavor.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/tomato_curry.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tomato_curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/tomato_curry-300x300.jpg","main-ingredient":["tomato"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}