{"id":69,"permalink":"http:\/\/www.sailusfood.com\/2006\/01\/07\/kodi-gudu-pulusu-boiled-eggs-in-tamarind-gravy\/","title":"Kodi Gudu Pulusu - Boiled Eggs In Tamarind Gravy","content":"\r\n\r\nPulusu in Telugu means 'pulupu kura' meaning sour curry. Tamarind pulp (Chintapandu) is the main ingredient in Andhra pulupu kurallu which gives the dish a tangy flavour. Jaggery or sugar is also used in some of the pulupu dishes which imparts a sweet and sour flavour to the dish. Andhra cuisine consists of at least one such gravy dish as part of a regular meal, ike Pappu (lentil) Pulusu, Menthi (Fenugreek) Pulusu, Pesara Pappu (Split yellow moong dal) Pulusu, Kaakarakaaya (bitter gourd) Pulusu, Bhendakaaya (Ladies finger) Pulusu, Chepa (fish) Pulusu. Any vegetable or meat cooked in a sweet and sour gravy is generally called \"Pulusu\". Mind you, not all dishes call for jaggery or sugar. You can use most vegetables to prepare pulusu like lady's finger, egg plants, gherkins, bitter gourd, bottle gourd. Well, the list can go on, the choice is yours.\r\n\r\nI am using eggs in today's dish. Eggs are a regular in my kitchen and had earlier posted  'bagara anda masala' (eggs cooked in rich creamy sauce), a North Indian dish. 'Gudu (egg) Pulusu' is a typical Andhra dish where boiled eggs are cooked in onions and tamarind gravy and tempered with mustard seeds, methi seeds, garlic and curry leaves. It's generally served with hot rice but it goes well with rotis too.\r\n\r\nIngredients:\r\n\r\n6 boiled eggs make slits along the length of each egg and lightly fry them in 1 tbsp oil with a pinch of turmeric for approx 1-2 mts\r\n2 onions chopped finely\r\n3-4 green chillis slit length-wise\r\n1 tsp red chilli powder\r\nbig pinch of turmeric pwd\r\n3\/4 tsp coriander pwd\r\n1\/4 tsp cumin pwd\r\n1 tomato chopped (optional)\r\n1 big lemon sized tamarind (soaked in warm water and pulp extracted) or 2-3 tbsp of tamarind paste (this can vary according to the amount of tang you want)\r\n1\/2 tsp sugar or jaggery\r\n2 cups water\r\nchopped coriander leaves for garnish\r\n2 tbsp oil\r\n\r\nFor tempering: 1\/4 tsp mustard seeds, big pinch of methi seeds (fenugreek seeds), 3 flakes crushed garlic and few curry leaves\r\n\r\nHeat oil in a vessel and mustard seeds and let them splutter. Now add methi seeds, curry leaves and fry for few seconds till methi turns brown. Add garlic and let it fry for 5 seconds. Don't brown the garlic, lightly fry it.\r\nAdd chopped onions and green chillies and fry till they turn light brown.\r\nNow add chilli pwd, turmeric pwd, coriander pwd and cumin pwd, mix well and saute for few seconds.\r\nAdd chopped tomatoes and fry for 4-5 mts.\r\nAdd tamarind extract and 2 cups of water and bring to a boil. Add salt and sugar and reduce heat and let it simmer for 2-3 mts. Add the boiled and fried eggs and let it cook in the gravy for 10-15 minutes or till you get the required gravy consistency.\r\nGarnish with chopped coriander leaves. Serve this hot steamed rice or rotis.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2006\/01\/kodi-guddu-pulusu2.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kodi-guddu-pulusu2-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kodi-guddu-pulusu2-300x300.jpg","main-ingredient":["eggs"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Egg Recipes"],"tags":["egg","pulusu"]}