{"id":693,"permalink":"http:\/\/www.sailusfood.com\/2007\/09\/10\/broken-wheat-dalia-soya-chunks-khichdi\/","title":"Broken Wheat (Dalia) - Soya Chunks Khichdi","content":"When I am in a hurry and rushed for time, I like to prepare one pot meals that are quick to prepare, filling and nutritious too. One such meal I made was with broken wheat (godhuma ravva\/dalia), yellow moong dal and soya chunks. When a tin of soya chunks was staring at me, I decided to throw in some soya goodness to the already nutritious low-fat khichdi.:)\r\n\r\nNot a visually appealing dish but its more a matter of flavor and a good dose of nutrition. A medley of sorts, throw in some vegetables and sprouts and it couldn't get healthier than that. I tweak my khichdi each time I make it, sometimes its greens or a dash of lime juice or lots of coriander leaves. No rules here, just go along with what you have lying in your fridge. Serve alongside some yogurt, pickle and papad and you have a perfect lunch fare.\r\nDalia-Soya Chunks Khichri Recipe\r\nPrep & Cooking: 30-40 mts\r\nServes 5-6 persons\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups coarse wheat ravva, dry roasted for 3-4 mts\r\n\r\n1\/2 cup split yellow moong dal (pesara pappu) \r\n\r\n1\/2 cup soya chunks, soak in lukewarm water for 15 mts and drain\r\n\r\n1\/2 tbsp ghee\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1 tsp grated ginger \r\n\r\n4-5 green chillis, slit length wise\r\n\r\nfistful of sprouts\r\n\r\n1\/4 tsp garam masala pwd (optional)\r\n\r\nsalt to taste\r\n\r\n10-12 curry leaves\r\n\r\n4 1\/2 cups of water\r\n\r\n\r\n1 Wash the wheat ravva and dal and soak them together in water for 15-20 mts.\r\n2 Meanwhile in a heavy bottomed vessel or pot, heat ghee. Add the cumin seeds, let them splutter and turn slightly brown. Add the ginger, sprouts, curry leaves, green chillis and soya chunks and combine.\r\n3 Add the drained wheat ravva and dal mixture and stir fry with the rest of the ingredients for a minute.\r\n4 Add 4 1\/2 cups of water to the above mixture, bring to a boil, add garam masala pwd, cover and cook on medium to low heat till both the dal and wheat ravva are cooked. This could take approx 25-30 mts. Alternately you could pressure cook until 2 whistles.\r\n5 Serve it as a meal by itself with a pickle of your choice, yogurt and appadam (papad).\r\nNote:I have used the coarser variety of wheat ravva, which takes a longer time to cook than the finer variety and gives the right khichdi texture. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/wheat_ravva_soya_chunks_khichdi.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/wheat_ravva_soya_chunks_khichdi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/wheat_ravva_soya_chunks_khichdi-300x300.jpg","main-ingredient":["soya","broken wheat"],"author":null,"type":"post","categories":["All Recipes","Indian Dal Recipes","Indian Vegetarian Recipes","North Indian Recipes"]}