{"id":695,"permalink":"http:\/\/www.sailusfood.com\/2007\/09\/03\/crumbled-paneer-green-peas-subzi\/","title":"Crumbled Paneer - Green Peas Subzi","content":"Its raining cats and dogs and you can't step out of your home to pick up some fresh vegetables from the farmer's market. So what does one do in a situation like this, with hardly any vegetables and yes, NO onions and a small lump of paneer sitting in your refrigerator? Make a crumbled paneer subzi. \r\n\r\nI was lucky to have some frozen green peas, tomatoes and even some fresh coriander. So made a jhat-pat subzi with crumbled paneer without the usual onion-spice base i.e no-onion, no-garlic stuff - saatvic khana that is a good and flavorful and can easily be passed off as a party main course entree. This delightful paneer sabzi with a standard North Indian flair is extremely easy and quick to prepare. You can create your own variations with different vegetables and spice it up to suit your palate. Whatever you do, please  do garnish with lots of fresh coriander for that finishing touch.:) Serve with rotis or pita for a nutritious quick meal.\r\nCrumbled Paneer Matar Sabzi Recipe\r\nRecipe Source: My recipe files\r\nPreparation: 20 mts\r\nServes 3-4 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup crumbled paneer\r\n\r\n1\/2 cup fresh green peas\r\n\r\n1 tomato, chopped\r\n\r\n1\/2 cup low fat milk\r\n\r\n1\/4 tsp garam masala \r\n\r\nbig pinch coriander pwd (optional)\r\n\r\n1\/4 tsp kasoori methi (dried fenugreek leaves)\r\n\r\nsalt and pepper to taste\r\n\r\n1 tsp oil\r\n\r\n1 1\/2 tbsps chopped fresh corainder for garnish\r\n\r\n\r\n\r\n1 Heat oil in a vessel, add the chopped tomatoes and peas and cook on low heat till soft, approx 3-4 mts. Add salt and combine.\r\n2 Add crumbled paneer and stir well to combine and cook for 2-3 mts.\r\n3 Add pepper, coriander pwd, garam masala and kasoori methi and combine and cook further for another minute.\r\n4 Add the milk and go on stirring constantly till the subzi reaches a semi-wet consistency. This could take approx 7-8 mts. Finally garnish with fresh coriander leaves and serve hot with rotis.\r\n\r\n\r\n\r\nNote:You can add any vegetable of your choice like bell peppers, carrots and beans and onions. The images I have put up above was taken when I prepared the subzi with onions, last week. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/paneer_subzi_roti.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/paneer_subzi_roti-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/paneer_subzi_roti-300x300.jpg","main-ingredient":["paneer","green peas"],"author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Milk Recipes","Indian Paneer Recipes","Indian Vegetarian Recipes","North Indian Recipes"]}