{"id":70,"permalink":"http:\/\/www.sailusfood.com\/2006\/01\/08\/weekend-herb-blogging-14-red-sorrel-leaves-gongura-pachadi\/","title":"Weekend Herb Blogging #14 - Red Sorrel Leaves (Gongura Pachadi)","content":"\r\nFor this Weekend Herb Blogging hosted by Kalyn's Kitchen, I am blogging about a very interesting sour leaf called Red Sorrel.Hibiscus cannabinus aka red sorrel leaves,roselle,gongura (telugu)pulicha keerai (Tamil),Ambad bhaji,ambada,ambadi(Hindi) are popular sour greens here in the Southern State of Andhra Pradesh.Red Sorrel comes in two varieties, one is green leaf and the other being red variety which is more sour than the green\/white stem variety.The leaves are bitter and mildly astringent and have a predominantly acidic taste.The Caribbeans prepare an exotic deep red sorrel punch, a sweet fruit drink with a wild tanginess from the flowers of the red sorrel plant (\"sorrel\" to Jamaicans) that form its base. These leaves and flowers have a cooling effect and act as an appetizer.\r\n\r\nRed Sorrel has some health benefits too and is useful in relieving symptoms of fever. The leaves of this herb are useful in the prevention and treatment of scurvy which is a deficiency caused by lack of vitamin C. Fresh leaves of the plant are useful in stimulating the stomach and aiding its action. These leaves are beneficial in the treatment of jaundice and a tablespoon of fresh red sorrel juice mixed with butter-milk (made from cow's milk) is recommended once daily in the treatment of jaundice.\r\n\r\nGongura is available in abundance here and Gongura pachadi\/pickle is a very popular authentic Andhra pickle variety on the lines of aavakai (raw mango pickle).These greens are used to prepare curries, stews, dals, and spicy pickles.In Andhra ,Gongura is used to prepare dishes such as Gongura Pappu (lentil),Gongura Vepudu(stir fry),Gongura royallu(prawns),gongura mamsam(mutton)and gongura pachadi,the recipe of which I am posting today.The recipe source is amma (my mother)who prepares excellent authentic andhra pickles.\r\n\r\nIngredients:\r\n4 big bunches fresh gongura leaves (red sorrel)\r\n7-8 whole dry red chillis(de-seeded)\r\n1 tsp methi seeds (fenugreek)\r\n7-8 green chillis(less spice ones)\r\n1 tbsp minapppapu (black gram dal)\r\n1 tbsp senaga pappu (bengal gram dal)\r\n1 tbsp coriander seeds\r\n12-15 cloves garlic (peeled and lightly crushed)\r\n4 tbsps oil\r\nsalt to taste\r\n\r\nTempering:\r\n3 tbsp oil (yes,its 3 tbsps as its a pickle)\r\n1 tsp mustard seeds\r\n2 whole dry red chillis\r\n10 curry leaves\r\n\r\nSeperate the gongura leaves from the stalks and leave them in an open cool and dry place for 2 days so that the leaves wither.After 2 days wash the leaves.Spread over kitchen towel.\r\nHeat 2-3 tbsp oil in a thick bottomed vessel.Add the leaves and fry them till rawness disappears and it becomes soft.Remove and cool.The fried leaves should look like shown in the picture.\r\n\r\nIn the same vessel add 1 tbsp oil and add methi seeds and fry till light brown and then add coriander seeds,urad dal(black gram),channa dal (bengal gram lentil) and dry red chillis and fry stirring constantly till light brown.Add the slit green chillis and fry for 2 minutes.Remove from fire and cool.\r\nGrind these above ingredients with salt.Now add crushed garlic and the fried gongura leaves and grind very coarsely.It should not be soft.\r\n\r\nNow heat 3 tbsps of oil in a pan and add the mustard seeds and let them splutter.Now add the whole dry chillis and curry leaves and fry for 20 seconds.Remove from fire and add to the ground gongura pachadi along with the oil.This pachadi does require a wee bit more oil like most pickles.\r\n\r\nThis particular pickle can be stored in the refrigerator upto 3-4 weeks and goes well with hot steamed rice and a liberal dose of ghee and sliced raw onions.\r\n\r\nNote:I have used the red stemmed variety of leaves which is more sour than the white stemmed.If you are using the leaves of the white stemmed variety,you can add approx 1-2 tbsp tamarind extract while grinding the ingredients.\r\n\r\nFood,Cuisine,Cooking,Andhra Recipes,Weekend Herb Blogging","main-ingredient":["red sorrel leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes"]}