{"id":700,"permalink":"http:\/\/www.sailusfood.com\/2007\/09\/26\/set-dosa-with-saagu\/","title":"Set Dosa with Saagu","content":"Dosa is my all time favorite tiffin and any kind of dosa at that. I first tasted set dosai in Mysore and thereafter in Bangalore. I never ventured to try them at home until a few months ago when I found the set dosa and sagu (vegetable kurma) recipes in a cooking magazine. I tweaked the recipe after a few trials and finally settled at this one. With RCI- Karnataka cuisine underway this month, I decided to blog Karnataka's famous tiffin for this event. \r\nSet dosai with saagu and coconut chutney\r\nSet dosai as the name suggests is a set of 2 or 3 or 4 thick, fluffy, spongy small dosas usually served with sagu, a mixed vegetable curry prepared with a spice base of poppy seeds, green chillis, coconut and roasted channa dal. There are quiet a few variations of set dosa recipe. The recipe I'm blogging today calls for the basic dosa batter of rice and urad dal along with par-boiled rice, methi seeds and poha (rice flakes). Its all in the fermentation, better the fermentation, fluffier the dosa. Just remember, that as you pour the batter on the hot tawa, don't spread it in concentric circles. Just leave it and let it cook like an thick pancake. \r\nSet Dosai Recipe\r\nSoaking: 6-8 hrs, Fermentation: overnight\r\nCuisine: Karnataka\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups rice\r\n\r\n1 cup parboiled rice\r\n\r\n3\/4 cup urad dal\r\n\r\n3\/4 cup poha\/rice flakes\r\n\r\n1 tsp methi seeds\r\n\r\nsalt\r\n\r\nbig pinch sugar (optional)\r\n\r\n\r\n\r\n1 Soak raw rice, parboiled rice, urad dal and methi seeds in enough water for 6 hours. Seperately soak the poha or beaten rice for 1-2 hours.\r\n2 Grind all the ingredients along with poha adding enough water to form a pouring consistency. Leave it overnight to ferment.\r\n3 Add salt and a pinch of sugar just before preparing the dosas and combine well.\r\n4 Pre-heat a tawa till really hot, sprinkle little water, pour 2 laddles of batter (do not spread the batter) and let it cook gradually over medium heat. It should look like a thick pancake. Drizzle some oil along the edges and let it cook for 2 mts or till nicely roasted.\r\n5 Flip the dosa over (this is optional) and let it cook further for less than a minute or till it is slightly roasted. Serve hot with chutney and saagu.\r\n\r\nSaagu Recipe\r\nPreparation: 30 mts\r\nCuisine: Karnataka\r\n.\r\n\r\nIngredients:\r\n\r\n2-3 cups cubed mixed vegetables (carrots, beans, peas, potatoes, capsicum)\r\n\r\n1 onion, finely sliced\r\n\r\nfew curry leaves\r\n\r\n1\/2 tsp mustard seeds\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil\r\n\r\ncoriander leaves for garnish\r\n\r\nFor the wet masala:\r\n\r\n1 tbsp grated coconut\r\n\r\nsmall piece ginger\r\n\r\n1 tbsp coriander leaves\r\n\r\n3-4 green chillis\r\n\r\nFor the dry masala:\r\n\r\n1 tbsp poppy seeds\r\n\r\n1 tbsp coriander seeds\r\n\r\n1\" cinnamon stick\r\n\r\n2 cloves\r\n\r\n1 1\/2 tbsps roasted channa dal\r\n\r\n\r\n1 Heat oil in a vessel, add the mustard seeds and let them splutter. Add the onions and curry leaves and saute till transparent.\r\n2 Add the mixed vegetables and combine well. Add salt and turmeric pwd and cook on medium heat for 3-4 mts. Add one-fourth cup of water and pressure cook till half cooked. While its pressure cooking, prepare the wet masala. \r\n3 Once is half-cooked, add the ground masala paste and combine and let it cook for 1-2 mts. Add a cup of water and bring to a boil. Reduce flame and add the ground masala powder and cook further for another 4-5 mts or it forms a thick gravy consistency. Garnish with fresh coriander leaves.\r\n4 Serve hot with dosas, rotis or puris.\r\n\r\nMore versions of set dosai recipe at Ruchi's, Seema's and Tee's blogs.\r\nMy entry to RCI - Karnataka  hosted by the lovely Asha of Foodie's Hope.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/08\/poha_dosa_tomato_chutney.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/poha_dosa_tomato_chutney-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/poha_dosa_tomato_chutney-300x300.jpg","main-ingredient":["urad dal","carrots"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Curry Recipes"]}