{"id":7020,"permalink":"http:\/\/www.sailusfood.com\/2010\/02\/27\/egg-masala-curry\/","title":"Egg Masala Curry","content":"Egg Masala Curry with Chicken Pulao\r\n\r\nI do not follow any standard (masala) recipe while preparing an egg curry. Each time I venture to prepare an egg curry, to serve as a side with rice or pulao, I tend to tweak an old favorite and experiment with spices. A friend visited us recently and  I had prepared this egg masala which came out a winner. Despite all of the mesmerizing flavors of egg masala, the key factor that really put it over the edge was the ground paste made from ordinary ingredients like poppy seeds, coconut and curry leaves! Addictive taste, warming and satisfying! Serve with rotis, rice or pulao.\r\n\r\nEgg Masala Recipe\r\nPrep & Cooking: 40 mts\r\nServes 4 persons\r\n.\r\n\r\nIngredients:\r\n\r\n3-4 boiled eggs\r\n\r\n2 cloves, \r\n\r\n1\/2\" cinnamon\r\n\r\n1 elaichi\r\n\r\n1\/4 star anise\r\n\r\npinch of mustard seeds\r\n\r\n1 large onions, chopped\r\n\r\n1\/2 tsp ginger garlic paste\r\n\r\n1 large tomato, blanched, peeled and pureed\r\n\r\n1 tsp coriander pwd\r\n\r\n1 tsp red chilli pwd\r\n\r\npinch of garam masala pwd\r\n\r\nsalt to taste\r\n\r\n2 tbsps oil\r\n\r\ncoriander leaves for garnish\r\n\r\nMake paste:\r\n\r\nlittle less than 1\/4 tsp cumin seeds, lightly roast for 2 mts\r\n\r\n2 tbsps fresh coconut\r\n\r\n3\/4 tsp khus khus, soak in a tbsp of water for 15 mts\r\n\r\n2-3 cashew nuts\r\n\r\n4-5 curry leaves\r\n\r\n1 green chilli\r\n\r\n\r\n\r\n1 Heat 2 tsps oil in a heavy bottomed vessel, add the boiled eggs and saute of low to medium flame for 2-3 mts. Add a pinch of turmeric pwd and combine. Remove and keep aside.\r\n2 In the same pan, add the remaining oil and add the cloves, cinnamon, elaichi and star anise and mustard seeds and saute for a few secs till the mustard splutters. Add chopped onions and saute till onions turn transparent. Add ginger garlic paste and saute for 4 mts.\r\n3 Add chilli pwd, coriander pwd and salt and combine. Add the tomato puree and cook for 3-4 mts. \r\n4 Add the ground paste and cook for 8-10 mts. Add 1\/4 to 1\/2 cup of water and bring to boil.\r\n5 Add the boiled eggs and let it cook in this masala for 7-8 mts on medium flame. Reduce flame and cook till you get the desired curry consistency.  \r\n6 Add garam masala pwd and combine. Garnish with coriander leaves. Turn off heat and serve hot with rotis or white rice.\r\n\r\nEgg Curry","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/02\/egg-masala-curry.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-masala-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-masala-curry-300x300.jpg","main-ingredient":["eggs"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Egg Recipes"],"tags":["anda","egg","masala"]}