{"id":71,"permalink":"http:\/\/www.sailusfood.com\/2006\/01\/09\/matar-paneer-paratha-indian-bread-stuffed-with-cottage-cheese-green-peas\/","title":"Matar Paneer Paratha -  Indian Bread Stuffed with Cottage Cheese &amp; Green Peas","content":"\r\nWe were fortunate to have good Punjabi neighbours (in our growing years) who made some of the best paranthas and who taught us the art of preparing authentic Punjabi parathas.I grew up eating different varieties of stuffed parathas prepared with almost all vegetables and greens I can ever think of ..carrots,radish,potatoes,cauliflower, spinach,methi leaves,coriander,mint, onions, paneer, sprouts..and more.In fact, I relished eating parathas stuffed with left over dal,rice and veggies for breakfast, brunch or dinner.\r\n\r\nParatha which is basically a N.Indian fare are unleavened flat breads similar to tortillas .The art of cooking up a paratha is something that is mastered over time..practice,practice and more practice.I must appreciate Paz of \" The Cooking Adventures of Chef Paz\" in her maiden attempt at preparing parathas.She sure did a great job...keeping in mind Indian Cuisine is absolutely new to her.I am yet to master the art making a perfect parantha like amma.\r\n\r\nParathas serve as a healthy wholesome food for growing children and for kids who dont eat their veggies,giving them stuffed parathas is a smart way to get them to eat their veggies.I get my child to eat his vegetables with stuffed paranthas and make it for breakfast and also pack it as a tiffin for him to eat at play school.Speaking of breakfast,Meena of Hooked on Heat is hosting yet another very interesting theme ...\"breakfast\". \"Matar Paneer Paranthas\" is the entry \"From My Rasoi\" for this month's breakfast theme.\r\n\r\n\r\n\r\nFor the dough:\r\n3\/4 cup maida (all purpose flour)\r\n1 cup atta (whole meal flour)\r\n1 tbsp ghee (clarified butter)\r\nsalt to taste\r\n3\/4 cup buttermilk (whisk 2 tbsp yogurt with enough water to make 1 cup of buttermilk)\r\n\r\nFor the stuffing:\r\n1 small cup boiled peas lighly mashed\r\n1 small cup grated panner (cottage cheese)\r\n\r\n\r\n1\" ginger\r\n2-3 minched green chillis(you can reduce if you want less spice)\r\n2 tbsp of chopped coriander leaves\r\n1 tsp garam masala pwd\r\nsalt to taste\r\n\r\nMix the two flours,salt and ghee.Add enough buttermilk to the flours and knead a soft dough.Set aside covered with a thin wet cloth (so that the dough doesnt dry) and let it sit for an hour.\r\n\r\nMix together minced ginger and chopped coriander leaves and make paste.Mix the mashed green peas and this paste and stir fry for 2 mts in a little ghee.Add garam masala and a pinch of salt and mix.Finally add the grated cottage cheese and mix well and make small balls and keep aside.\r\n\r\nDivide the dough into small portions(shape into lemon sized balls) and flatten each ball (approx 3\"-4\" in diameter) and put a small ball of the stuffing in the center.Cover the mixture by drawing the edges towards the center and mould into a ball again. \r\n\r\nTake each of these stuffed balls and by pressing on a floured board ,roll into a round (pancake shape) (approx 6\"-7\" diameter) paratha with a rolling pin. Pre-heat a griddle or tawa and place a rolled out parantha and cook till small bubbles appear on top and then flip the paratha and cook it again for a few seconds or so by pressing with a spatula or kitchen towel.Brush little ghee\/oil on both the sides along the edges and fry on both sides until brown patches appear.Keep flipping over both the sides and make sure that both the sides of the parantha are cooked well till golden brown.While preparing the paranthas ,keep the fried paranthas warm by placing them in a towel-lined basket or bowl and fold over the sides of the towel.\r\nNote:Any left over dough can be refrigerated upto 3-4 days.The parathas taste just as good if not better and since the dough has been rested the paranthas can be rolled out easier.\r\n\r\nServe hot with yogurt,green chutney or any curry of your choice.So here I am indulging myself to a hot parantha with mango pickle(aam ka achaar)and my favorite beverage,masala chai, to bring down the chill of a winter morning!\r\n\r\nFood,Cooking,Recipes,Indian Cooking,North Indian Recipes","main-ingredient":["paneer","green peas"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Indian Bread Recipes","Indian Milk Recipes","Indian Vegetarian Recipes","North Indian Recipes"]}