{"id":710,"permalink":"http:\/\/www.sailusfood.com\/2007\/09\/24\/kodi-guddu-beerakaaya-kura-egg-ridgegourd-curry\/","title":"Kodi Guddu Beerakaaya Kura - Egg - Ridgegourd Curry","content":"Boiled eggs are cooked in combination with vegetables like ridgegourd, drumsticks, potatoes, tomatoes and minced meat (kheema) and fresh prawns in our parts. One delectable combination is the pairing of ridge gourd with boiled eggs, a delicious Andhra style curry. Today's milk based gravy dish, with very few ingredients, transforms a simple egg curry into a delicious meal along with hot rotis or rice. \r\n\r\nThe subtle sweet flavor of the ridge gourd simmered in milk gives sweetish overtones to the dish but the use of dry red chillis as well fresh green chillis lends the egg curry a bit of spice too. So all those who think Andhra cuisine is spicy, this recipe should prove them wrong.:)\r\n\r\nKodi Guddu Beerakaya Kura Recipe\r\nPrep & Cooking: 40 mts\r\nServes 4 persons\r\n.\r\n\r\nIngredients:\r\n\r\n250 gms ridge gourd, peeled and chopped\r\n\r\n4 boiled eggs, make 3 slits along the sides\r\n\r\n1 large onion, finely chopped\r\n\r\n1\/2 tbsp oil\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n2 dry red chillis, de-seed and tear\r\n\r\n2-3 green chillis, slit length wise\r\n\r\n4-5 garlic flakes, slightly crushed\r\n\r\n12-15 fresh curry leaves\r\n\r\nbig pinch turmeric pwd\r\n\r\nsalt to taste\r\n\r\n3\/4 cup low-fat milk\r\n\r\n\r\n\r\n1 Drizzle half a tsp of oil in a vessel, add pinch of turmeric pwd, add the slit boiled eggs, roast them for a mt, remove and keep aside.\r\n2 In the same vessel add the remaining oil. Add the mustard seeds, let them splutter, next add the cumin seeds and let them turn slightly brown. Add the crushed garlic, dry red chillis, curry leaves, green chillis and combine.\r\n3 Add the chopped onions and saute till transparent. Add the chopped ridge gourd and combine. Cook for 8-10 mts on low to medium heat, stirring once in a while. You will find it leaves water, let it cook in its water.\r\n4 Add salt and cook for another 4-5 mts on medium flame. Add the milk and increase flame and go on stirring while it cooks and you get the curry consistency. This should take about approx 8-10 mts. \r\n5 Reduce flame, add the boiled eggs, place a lid and simmer for 5 mts. Turn off heat and serve hot with rotis or white rice.\r\n\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/egg-ridgegourd-curry.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-ridgegourd-curry-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-ridgegourd-curry-300x300.jpg","main-ingredient":["eggs","ridgegourd"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Egg Recipes","Indian Milk Recipes"],"tags":["egg","ridge_gourd"]}