{"id":712,"permalink":"http:\/\/www.sailusfood.com\/2008\/01\/29\/godhuma-rava-palakura-pongal-broken-wheat-spinach-medley\/","title":"Godhuma Rava Palakura Pongal - Broken Wheat Spinach Medley","content":"A one pot meal that is nourishing and comforting using broken wheat, yellow moong and spinach is Godhuma rava palakura pongal. Ideal for brunch or lunch with a refreshing glass of fresh juice or buttermilk and you have a quick healthy meal ready for your family. On days when I am  caught up with things and pressed for time in the kitchen I prepare easy meals like this with a salad and yogurt as a side.\r\n\r\n\r\n\r\nGodhuma Ravva Palakura Pongal Recipe\r\nSoaking time: 15 mts, Prep & Cooking: 40 mts\r\nServes 4-5 persons\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups coarse wheat ravva, dry roasted for 6-7 mts\r\n\r\n1\/2 cup cooked split yellow moong dal (pesara pappu) \r\n\r\n1 cup packed chopped spinach\r\n\r\n1\/2 tbsp ghee\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1 tsp grated ginger \r\n\r\n1 tsp peppercorns\r\n\r\n2-3 green chillis, slit length wise\r\n\r\n1-2 dry red chillis, de-seed and tear\r\n\r\npinch of hing (inguva\/asafoetida)\r\n\r\nsalt to taste\r\n\r\n10-12 curry leaves\r\n\r\n5 cups of water\r\n\r\n\r\n1 Wash the wheat ravva and dal and soak them together in water for 15-20 mts.\r\n2 Meanwhile in a heavy bottomed vessel or pot, heat ghee. Add the cumin seeds, let them splutter and turn slightly brown. Add the ginger, curry leaves, green chillis, red chillis and pepper corns and combine. Add the asafoetida. Add the spinach leaves and saute for 5-6 mts.\r\n3 Add the drained wheat ravva and dal mixture and stir fry with the rest of the ingredients for a minute. \r\n4 Add 5 cups of water and salt to the above mixture, bring to a boil, cover and cook on medium to low heat till both the dal and wheat rava are cooked. This could take approx 30 mts. Alternately you could pressure cook until 2 whistles.\r\n5 Serve it as a meal by itself with a pickle of your choice, curd and appadam (papad).\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/godhuma_ravva_palakura_pongal1.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/godhuma_ravva_palakura_pongal1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/godhuma_ravva_palakura_pongal1-300x300.jpg","main-ingredient":["broken wheat"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Vegetarian Recipes","Lunch Box Recipes"]}