{"id":713,"permalink":"http:\/\/www.sailusfood.com\/2007\/09\/28\/chintachiguru-kobbari-pachadi-tender-tamarind-leaves-coconut-chutney\/","title":"Chintachiguru kobbari pachadi - Tender tamarind leaves coconut chutney","content":"I chanced upon some fresh tender tamarind leaves while on a visit off the city limits. Its no longer available in the local subzi mandis\/rythu bazaar and when I saw some fresh leaves, I just couldn't resist the temptation. So with home grown freshly grated coconut, delicate raw tender leaves and a seasoning you can't go wrong with, I made a simple pachadi to go with white rice.\r\ntender tamarind leaves, chinta chiguru, imli ke patte\r\nA pachadi with a pleasing sweet-tart flavor, a sort of compelling taste that makes one salivate and ask for more. The most nourishing, comforting and tantalizing tastes are brought forth through raw food and the simplest of ingredients and perfect for the nutrition conscious, reminding that they are eating right and light.:)\r\nChintachiguru Kobbari Pachadi Recipe\r\nPreparation: 8-10 mts\r\nServes 3-4 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups tender tamarind leaves\r\n\r\n1 cup grated coconut\r\n\r\n1-2 green chillis\r\n\r\nsalt to taste\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\npinch of hing\/asafoetida (optional)\r\n\r\n8-10 fresh curry leaves\r\n\r\n1\/2 tsp split black gram (minappa pappu) \r\n\r\n1-2 dry red chillis, de-seed and tear (optional)\r\n\r\n1\/2 tsp oil\r\n\r\n1 Grind green chillis, tender tamarind leaves, grated coconut and salt. Sprinkle a tbsp of water only.\r\n2 Heat oil in a pan. Add mustard seeds and let them pop, add the split gram dal and let it turn red. Add the curry leaves, red chillis and asafoetida and toss for a few seconds. \r\n3 Pour this seasoning over the pachadi and combine. Serve with hot steamed rice and ghee.\r\n\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/chinta_chiguru_tender_tamarind_leaves.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chinta_chiguru_tender_tamarind_leaves-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/chinta_chiguru_tender_tamarind_leaves-300x300.jpg","main-ingredient":["tender tamarind leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes"]}