{"id":725,"permalink":"http:\/\/www.sailusfood.com\/2008\/01\/16\/majjiga-pulusu-vegetables-cooked-in-buttermilk\/","title":"Majjiga Pulusu - Vegetables cooked in buttermilk","content":"\r\n\r\nThere are numerous ways to prepare Majjiga Pulusu, our Andhra version of Kadhi, a buttermilk based stew. This pale yellow colored stew calls for vegetables cooked in a delectable combination of fresh coconut-green chillis paste and well beaten sour curd. Vegetables like okra, bottle gourd and drumsticks are usually used to prepare this sweet-sour flavored sauce with a tinge of spice that tickles your taste buds, though you could also use sweet potatoes, tomatoes, greens and potatoes. \r\n\r\n\r\nYou can tweak this recipe, giving it a herby flavor by adding fresh coriander leaves to the coconut-green chilli paste. You can omit asafoetida and add a crushed garlic in the tempering. Try to limit to two to three varieties of vegetables and not more and use slightly sour curd. Fresh, warm and comforting, a delicious stew. \r\n\r\n\r\nMajjiga Pulusu Recipe\r\nPreparation: 25 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups cubed vegetables (bottle gourd\/ladyfingers\/drumsticks\/potatoes\/sweet potatoes)\r\n\r\n1 onion, sliced (optional)\r\n\r\nbig pinch turmeric pwd\r\n\r\n2 cups thick curd (slightly sour curd)\r\n\r\n1 cup water\r\n\r\nsalt to taste\r\n\r\nFor Paste:\r\n\r\n4 tbsps grated fresh coconut\r\n\r\n3 green chillis\r\n\r\n1-2 tbsps fresh coriander leaves (optional)\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/4 tsp methi seeds \r\n\r\n1\/2 tsp cumin seeds\r\n\r\npinch of hing\/asafoetida (optional)\r\n\r\n10-12 fresh curry leaves\r\n\r\n2 dry red chilli, de-seed and tear (optional)\r\n\r\n1\/2 tbsp oil\r\n\r\n\r\n\r\n1 Make a paste of grated coconut, green chillis and coriander leaves without adding any water. \r\n2 Beat the curd well adding water to form a smooth sauce like consistency.\r\n3 Combine the ground paste with the beaten curd and keep aside.\r\n4 Add half a cup of water to the cubed vegetables (1\/2 tsp salt) except the onions and cook till they are half-cooked. Keep aside.\r\n5 Heat oil in a pan, add mustard seeds and let them pop, add the cumin seeds, methi seeds and let them turn slightly brown. Add the curry leaves, red chillis and asafoetida, turmeric pwd and toss for a few seconds. Add the onions and saute for 4 mts before adding the cooked vegetables (along with left over water if any) and combine well.  \r\n6 Add the curd-coconut mixture to the vegetables and on low heat, cook stirring continuously, otherwise it might curdle. Adjust the salt and cook till the vegetables absorb the flavors and the gravy thickens. Do not boil. Turn off heat. Cover lid and let it sit for a few minutes before serving for the flavors to absorb.\r\n7 Serve with white rice.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/majjiga_charu2.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/majjiga_charu2-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/majjiga_charu2-300x300.jpg","main-ingredient":["buttermilk","drumsticks"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Milk Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}