{"id":739,"permalink":"http:\/\/www.sailusfood.com\/2007\/12\/24\/christmas-delights-eggless-cookies\/","title":"Christmas Delights - Eggless Cookies ","content":"Its been quite a while (actually a very long break) since I've been away from blogging to take care of things which required my immediate attention. Thank you for your concerned emails and comments, enquiring about me and my family, appreciate it very much.:)\r\n\r\nYay! its that time of the year again.:) Wishing all my readers, visitors and friends a Merry Christmas and a Happy New Year. I also like to take this opportunity to thank all my readers from the world over for your continued support and sweet comments. Thank you very much!\r\n\r\nThese past few days, I baked and baked and baked for Christmas and New Year. Made batch after batch of cookies and cakes for family and friends.\r\n\r\nDay 1 - Rich fruit cakes\r\nDay 2 - Chocolate Brownies\r\nDay 3 - Chocolate Chip and Almond Cookies\r\nDay 4 - Tutti-frutti Cookies &amp; Oats and Cocoa Cookies (eggless)\r\nDay 5 - Cornflakes Cookies (eggless)\r\nDay 6 - Russian Tea Cakes\/Snowballs (eggless)\r\nDay 7 - Gift wrapping all of them:)\r\n\r\nToday, I am sharing three types of cookie recipes and sending them off to Susan of Foodblogga who is hosting  Eat Christmas Cookies Event.\r\nEggless Tutti-Frutti Cookies\r\n\r\nCustard powder and tutti frutti are the main ingredients that add oomph and flavor to this basic cookie recipe. With a colorful topping, these delicious goodies are an absolute favorite at our home with a wonderful mouthfeel.\r\n\r\n\r\nEggless Tutti-Frutti Cookies Recipe\r\nPreparation: 10-12 mts, Baking: 12 mts\r\nMakes approx 28-30 cookies\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups all purpose flour (maida)\r\n\r\n1 cup vegetable oil\r\n\r\n1 cup powdered sugar\r\n\r\n1\/2 cup custard pwd\r\n\r\n3\/4 tsp baking pwd\r\n\r\nbig pinch of baking soda\r\n\r\n1 tsp vanilla essence\r\n\r\ntutti frutti for garnish\r\n\r\n\r\n\r\n1 Sieve maida, baking pwd, baking soda and custard pwd.\r\n2 Blend the sugar and oil till smooth. Add the sieved ingredients to the sugar-oil mixture. Add vanilla essence and mix well to form a dough. If the dough doesn't become stiff enough to roll out into balls, add a few tbsps of cold milk or water and chill for a few minutes.\r\n3 Pinch bits of dough and shape into balls and slightly flatten. Or you could alternately pipe the dough into small balls. Garnish with tutti frutti, by slightly pressing into the dough. Place on a greased tray and bake at 180 C for about 10 -12 mts or till done. Once baked, the cookie will feel soft on touch but once cool it will harden. If you over bake beyond the mentioned time limit, you will have a very crunchy cookie.\r\n4 Cool on a wire rack and store in airtight container.\r\n\r\nEggless Cornflakes Cookies\r\n\r\nThis recipe I have adapted from a cooking magazine and its the first time that I am making it as a trial batch. The cookie has a sweet crunchy bite of cornflakes and granulated sugar and it tastes better with age.\r\n\r\n\r\nEggless Cornflakes Cookies Recipe\r\nPreparation: 15 mts, Baking : 22-25 mts\r\nMakes approx 18 cookies\r\n.\r\n\r\nIngredients:\r\n\r\n3\/4 cup crushed cornflakes\r\n\r\n1\/2 cup sugar\r\n\r\n1 cup all-purpose flour (maida)\r\n\r\n1\/2 cup butter, melted\r\n\r\n3\/4 tsp baking pwd\r\n\r\n1 tsp vanilla essence\r\n\r\n\r\n\r\n1 Blend the sugar and butter till smooth. Add maida, baking pwd, vanilla essence and crushed cornflakes and mix well to form a dough. If the dough doesn't become stiff enough to roll out into balls, add a few tbsps of milk and chill for a few minutes.\r\n2 Be careful when shaping out the dough into small balls, as it does take effort to hold it together to form small balls and slightly flatten them. IF the dough is crumbly, its alright. Take care and shape into slightly flattened balls. Place on a greased tray and bake at 175 C for about 25 mts or till golden brown.\r\n3 Cool on a wire rack and store in airtight container.\r\n\r\nEggless Oats-Cocoa Cookies\r\n\r\nThis recipe which calls for oats and cocoa, crumble quickly and have a soft and melt in the mouth feel with a intense chocolate flavor and the oats compliments the chocolate with a bit of crumbly crunch. But after a day of sitting the flavors of the cookie really came together well. Those who love a strong chocolate flavor will love these not-so-good looking, cracky cookies. Don't go by the looks, its downright delicious!:)\r\n\r\n\r\nEggless Oats-Cocoa Cookies Recipe\r\nPreparation: 10 mts, Baking : 10-12 mts\r\nMakes approx 20 cookies\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup oats (I use Quakers)\r\n\r\n1\/2 cup vegetable oil + 1 tbsp oil\r\n\r\n1\/2 cup all-purpose flour (maida)\r\n\r\n1 cup powdered sugar\r\n\r\n1 1\/2 tbsps unsweetened cocoa pwd (adjust according to your taste)\r\n\r\n3\/4 tsp baking pwd\r\n\r\nbig pinch of baking soda\r\n\r\n1 tsp vanilla essence\r\n\r\n\r\n\r\n1 Sieve maida, baking pwd, baking soda and cocoa pwd.\r\n2 Blend the sugar and oil till smooth. Add the sieved ingredients to the sugar-oil mixture. Add vanilla essence and oats and mix well to form a very soft dough. If the dough doesn't become stiff enough to roll out into balls, add a few tbsps of milk and chill for a few minutes. Be careful when shaping out the dough into small balls, as it does take effort to hold it together to form small balls and slightly flatten them.\r\n3 Place on a greased tray and bake at 180 C for about 10-12 mts or till done.\r\n4 Cool on a wire rack and store in airtight container.\r\n\r\n \r\nWishing all my visitors, readers, family and friends a blessed Christmas and a Happy New Year!\r\n \r\n\r\n ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/eggless-cookies.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/eggless-cookies-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/eggless-cookies-300x300.jpg","main-ingredient":["sugar","flour"],"author":null,"type":"post","categories":["All Recipes","Cookie Recipes","Flour Recipes"],"tags":["eggless_cookies"]}