{"id":7447,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/18\/samosa\/","title":"Samosa - Indian Snack","content":"Samosa\r\n\r\nIndia's popular snack that finds a place in almost every bakery or chaat shop - our very own Samosa. Savory comfort food at its best, a crisp exterior filled with a savory potato stuffing that goes very well over a hot cup of chai especially on a rain filled, cold day. Samosa is always store bought and on rare occasions prepared at home, like today. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nSamosa Recipe\r\nPrep & Cooking: 1 hr 15 mts\r\nMakes approx 12 Samosas\r\n.\r\n\r\nIngredients:\r\n\r\n\r\n1 cup maida (all-purpose flour)\r\n\r\n2 tbsp oil\r\n\r\nlarge pinch ajwain (optional)\r\n\r\nenough water to knead the maida\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\nFor the filling:\r\n\r\n2 boiled potatoes, crumble\r\n\r\n1\/4 cup boiled peas\r\n\r\n1\/4 tsp grated ginger\r\n\r\n1 tsp red chilli pwd\r\n\r\n1\/2 tsp coriander pwd\r\n\r\npinch cumin pwd\r\n\r\npinch kasuri methi\r\n\r\ndash of lemon juice\r\n\r\npinch of garam masala\r\n\r\nchopped coriander leaves\r\n\r\nsalt to taste\r\n\r\n\r\n1 Mix the maida with salt, oil, ghee and ajwain, combine to form a crumbly mixture. Now slowly add enough water to make a pliable dough, not too soft. Divide the dough and shape into balls. Keep aside covered with moist cloth for 15-20 mts. \r\n2 Meanwhile, heat a vessel, add oil, add cumin seeds and allow to brown. Add the ginger, spice powders and a tbsp of water and saute for a few secs. Add the crumbled potato and boiled peas and cook over medium flame for a few minutes, approx 3-4 mts. Add kasuri methi and lemon juice, combine. Add the coriander leaves and turn off heat.\r\n3 Now that the stuffing is ready, prepare the outer layer for the samosas.\r\n4 Roll each ball with the rolling pin into a slightly thin puri, slightly elongated in shape as shown in the image. Take a knife and divide the rolled puri into two by cutting through the center.\r\n5 Now take a semi-circle piece of the roti, and make a fold in the shape of a triangle as shown in the image. Seal along the fold. Now place this cone between your thumb and index finger and place a ball of the stuffing inside. Wet your finger and run it along the edges of the dough with water and seal to enclose the stuffing.\r\n6 Press the ends firmly so that the filling does not come out during the deep frying process. Prepare with the rest of the dough in the same manner.\r\n7 Heat enough oil in a wide vessel to deep fry the samosas. Heat the oil till hot but not piping hot. Reduce flame to low medium and drop 2-3 samosas into the oil slowly and deep fry them till golden brown, turning them carefully to the other side so that it cooks on all sides. Deep fry on low to medium heat and not piping hot oil.\r\n8 Remove onto absorbent paper and serve warm over a cup of chai.\r\n\r\nNote: Its better to make samosas in batches. Roll out, stuff and deep fry 3-4 samosas at a time (batch-wise). While preparing the next batch of samosas, reduce the stove flame and carry out the process. When deep frying the next batch, see that the oil is hot enough to deep fry. Keep the prepared samosas covered through out the preparation process. \r\n\r\nIndian Snack - Samosas with Sweet Chutney","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/samosas.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/samosas-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/samosas-300x300.jpg","style":["modern"],"course":["appetizer","snack"],"special-diet":["nut free","eggless","vegan","vegetarian","kid friendly","pregnancy","dairy free"],"cuisine":["north indian"],"cook-time":"45","prep-time":"30","main-ingredient":["maida","potato"],"serves":"6","goes-well-with":["tea","sweet chutney"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["samosa","snack"]}