{"id":7476,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/11\/papdi-papri-chaat-recipe\/","title":"Papdi (Papri) Chaat","content":"Papdi Chaat \r\n\r\nIndians love their favorite chaat wala and spend many a evening eating their favorite masala puri or pani puri, relishing its magical, addictive flavors like there's no tomorrow. And why not? Its comforting food that warms the palate, delicious and economical on the wallet.\r\n\r\nRolled out Papdi ~ Papdi\r\n\r\nIn the realm of chaat recipes, Papdi Chaat, is a favorite. The green and sweet chutney drizzled on a bed of papdi, lends a sweet, tangy and savory note, further fortified with beaten yogurt and finished with chopped onions, tomatoes, coriander leaves and sev, adding crunch to the hearty chaat. A crowd-pleasing appetizer recipe that is quick to fix provided you have done some preparation work ahead. Wow your guests by artfully arranging the papdi with zesty toppings and vibrant garnishes for an impressive beginning to a dinner. :)\r\n\r\n\r\nPapdi Recipe\r\nPrep: 20 mts, Sitting time: 15 mts, Cooking time: 20 mts\r\nServes 10-12 persons\r\nCuisine: Indian\r\nSource: Recipe files\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 cup maida\/all-purpose flour\r\n\r\n1\/2 tsp kalonji\/onion seeds (optional)\r\n\r\n1 tbsp oil or ghee\r\n\r\nsalt to taste\r\n\r\nwater for kneading\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Take a wide plate and add the maida, oil, kalonji and salt and combine. Slowly add water and make a smooth dough. Leave aside covered with damp cloth for 15 mts. \r\n2 Knead the dough again for a mt. Pinch off some dough and make very small balls. Roll out small thin rotis. Make deep dents in the roti using a fork or knife.\r\n3 Heat enough oil for deep frying in a heavy bottomed vessel. It should be on medium high and once its hot, slide the roti into the hot oil and allow to cook. Flip over and fry the other side till light golden brown. Don't fry too much as it will turns too dark. Remove on to absorbent paper.\r\n 4 Cool and store in an air tight container and use when required.\r\n\r\nNote: Ensure the oil is hot enough before frying the papdi. If the oil is not hot enough, the papdi will absorb a lot of oil. Alternately, you can roll out a big sized roti and cut it into diamonds as shown in the image above. \r\n\r\nPapri Chaat\r\n\r\nHow to make Papdi Chaat\r\n\r\nTake a wide serving plate. Place 4-5 papdis, layer each papdi with chopped or mashed boiled potato and boiled chickpeas. Next spoon green chutney and sweet tamarind chutney. Spoon sweetened curd\/dahi. Sprinkle some chopped onion. Finally finish off with  sev and coriander leaves. Serve immediately. \r\n\r\nGreen (Hari) Chutney Recipe\r\nSweet (Meeta) Chutney Recipe\r\nSev Recipe","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/papdi-chaat-recipe.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/papdi-chaat-recipe-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/papdi-chaat-recipe-300x300.jpg","style":["easy","modern"],"course":["snack","appetizer"],"special-diet":["nut free","eggless","dairy","vegetarian","kid friendly","pregnancy"],"cook-time":"30","prep-time":"30","main-ingredient":["all purpose flour","potato"],"serves":"10","goes-well-with":["juice","tea"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Featured Recipes","Indian Snacks and Starter Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["chaat","papdi"]}