{"id":75,"permalink":"http:\/\/www.sailusfood.com\/2006\/01\/13\/paramannam-sweet-rice-pudding-naivedyam\/","title":"Paramannam-Sweet Rice Pudding ( Naivedyam )","content":"\r\nAnnam Payasam or Paramannam (Food Of The Gods) is a sweet dish which is prepared as an offering to God in almost every home in Andhra on most special occasions and festivals. According to Hindu tradition & spiritual customs, by offering Naivedyam to God in the form of sweets like chakripongal, payasam, paramannam and fruits the devotees acknowledge the good things that come from God. After God partakes of the offering the naivedyam becomes prasadam. Prasadam is consumed after performing puja or worship and consuming the delicious prasadam symbolizes the bliss of self-realization.\r\n\r\nParamannam can be served hot or cold as a dessert and is prepared with rice, milk and sugar or jaggery and garnished with raisins and cashewnuts. We prepared Paramannam as 'Prasadam'(offering to God) this morning on the occassion of Bhogi,the first day of Sankranti Festival and this is the recipe as prepared by Amma.\r\n\r\nIngredients:\r\n\r\n1\/2 cup raw rice washed and drained\r\n1\/2 cup sugar or grated jaggery\r\n1 lt milk\r\npinch of salt\r\n1\/4 tsp ground green cardamom\r\nfried cashewnuts and raisins for garnish\r\n1 tbsp ghee(clarified butter)for frying cashewnuts and raisins\r\n\r\nWash and soak rice in water for about fifteen minutes.\r\nHeat a pan and bring milk to a boil.Lower heat and add the rice to the milk.Cook until the rice is soft and the mixture looks thick.Remove from heat and cool.\r\nAdd the sugar and mix well and keep stirring till it mixes well.\r\nHeat ghee in a skillet and add cashew nuts. Fry for 1-2 mts till the cashewnuts turn light brown. Add raisins and stir for a few seconds.Add this along with the remaining ghee to the cooked rice.Add cardamom powder and a pinch of salt and mix well.Turn off heat and keep covered for 5 minutes.Serve hot or cold.\r\n\r\nNote:If you are using jaggery in place of sugar you must follow this method.Heat a small pan and boil 1\/2 cup water and add grated jaggery.On slow fire let the jaggery cook till it melts and is sticky (if you touch a drop of the jaggery between the thumb and fore finger it should feel sticky).Dont let it heat too much,it should basically melt...approx 4-5 mts. Remove from heat and keep aside.Let it cool for 3-4 minutes and then add to the cooled cooked rice otherwise the milk might split.\r\n\r\nMasala Vadas are popular South Indian deep fried crisp lentil dumplings prepared with channa dal(bengal gram lentil),onions and Indian spices.The outer crust is crisp,tastes great and is generally eaten as a snack.It can be eaten as it is or served with green chutney or coriander chutney.Paramannam,Masala Vada with masala chai ....our festive breakfast menu  for Bhogi after offering prayers .\r\n\r\nMasala Vada\r\nIngredients:\r\n\r\n1 cup soaked and drained channa dal(split bengal gram)\r\n1 tsp raw rice\r\n1\/2 tsp cumin seeds\r\n4-5 flakes garlic\r\n1\" ginger chopped\r\n5-6 curry leaves\r\n4 green chillis\r\n1 large chopped onion\r\n1-2 tbsp chopped fresh coriander leaves\r\npinch of garam masala (optional)\r\n1 tsp chopped mint leaves (optional)\r\nsalt\r\noil for frying\r\n\r\nSoak channa dal and rice in water for 2 hours.Drain.Keep aside a fistful of drained channa dal and grind the rest of the channa dal and rice,green chillis,cumin seeds,ginger and garlic coarsely.To this coarse mixture, add chopped onions, curry leaves, coriander leaves,salt and garam masala and mix well.Add the remaining channa dal and mix well. Make small lemon-sized balls and pat it lightly on your palm or on butter paper and slide into hot oil and deep fry until golden brown.\r\n\r\nFood,Desserts,Amma,South Indian Cooking,Andhra Recipes,Recipes","main-ingredient":["rice","jaggery"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Festival Foods","Indian Dal Recipes","Indian Festivals","Indian Sweets Recipes","Indian Vegetarian Recipes","Sweet Dessert Recipes"]}