{"id":753,"permalink":"http:\/\/www.sailusfood.com\/2007\/12\/26\/fruit-cake\/","title":"Fruit Cake","content":"Every time, I venture to prepare a fruit cake, it feels like I am making it for the first time. Honestly, its the making of caramel which gives me some tense moments, getting it to that dark golden brown color without it going bitter.:)\r\n\r\n\r\n\r\nThis fruit cake recipe is adapted from an old magazine. Loaded with dried fruits steeped in rum and wine, richly flavored with aromatic spices, nicely balanced flavors, not too sweet and slightly dense fruit cake is a keeper with flavor, color and texture improving with age.\r\n\r\n\r\nFruit Cake Recipe\r\nBaking: approx 1 hr\r\nMakes 2 cakes (8\" cake tin and 8\" loaf tin)\r\nSource: An old magazine\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 3\/4 cups all purpose flour\/maida\r\n\r\n1 cup butter\r\n\r\n1 1\/2 cups powdered sugar\r\n\r\n2 tsps baking pwd\r\n\r\n2 tsps vanilla essence\r\n\r\n5 eggs\r\n\r\n3\/4 tsp cinnamon pwd\r\n\r\n1\/4 tsp clove pwd\r\n\r\n1\/4 tsp cardamom pwd\r\n\r\n3\/4 tsp shahjeera pwd\r\n\r\n1 cup caramel\r\n\r\nPreparing dried fruits:\r\n\r\n2 1\/2 - 3 cups dried fruits (tutti frutti, dried currants, figs, dates, candied lemon & orange peel, golden raisins, preserved cherries, cashewnuts and almonds)\r\n\r\n1\/2 tsp nutmeg pwd\r\n\r\n1\/4 tsp clove pwd\r\n\r\n3\/4 cup dark rum\r\n\r\n1\/2 cup red wine\r\n\r\nFor caramel:\r\n\r\n1 cup sugar\r\n\r\n1 tbsp water\r\n\r\n1\/2 cup water\r\n\r\n\r\n\r\nPreparing dried fruits: I prepared the dried fruits a week ahead before baking. Finally chop all the dried fruits and nuts and soak in enough dark rum and red wine in a large jar such that half of the jar is filled. There should be enough room in the jar once the fruits and rum are added, as they will almost double in size. Secure cap tight and keep away for at least a minimum of 24 hours. You can make this a year ahead, 2-3 months ahead or even a week before baking the cake. Do shake the jar once in a while. Longer the fruits steep, better the flavor.\r\n\r\nPreparing Caramel: Heat a heavy bottomed vessel and cook the sugar and a tbsp of water on medium high heat. You will find that the sugar will melt and start to change color. Don't stir, you can swirl the vessel, once or twice. When you find that the color has changed to a little darker golden brown color, turn off heat and place the vessel near the kitchen sink. Immediately, pour half a cup of water very carefully into the caramel and stir to mix well. You will find that the liquid will splash when you pour the water into the hot caramel. So make sure there are no children around the kitchen when are making the caramel and protect your hand by wearing a thick glove. Cool the caramel before adding to the cake batter.\r\n\r\nI made 2 batches of caramel, where one batch was a shade lighter than the other. The cake pieces in the second picture of the post is the one made with the lighter golden brown color caramel.\r\n\r\nProcedure:\r\n1 Sieve maida and baking pwd.\r\n2 Seperate egg yolks from the whites. In a seperate bowl, whisk egg yolks with vanilla.\r\n3 Beat the butter and powdered sugar till smooth and creamy. Add the egg yolk mixture little by little, alternating with a tbsp of the sieved flour and combine till smooth.\r\n4 Add the spice powders and caramel, combine till well blended.\r\n5 Add the sieved flour in 4-5 batches and combine till well blended.\r\n6 Add the dried fruits (toss the dried fruits in two - three tbsp of flour) and using a spatula, fold it gently into the batter.\r\n7 Finally, whisk egg whites till it forms peaks and gently fold into the cake batter till well combined. \r\n8 Grease the cake tins and line with parchment paper. Pour batter  up to half of the prepared cake tins and bake in a pre-heated oven at 325 degrees F (165 degrees celcius) for 1 hour. Keep checking from 50 mts itself. Sometimes you might have to bake beyond an hour. So bake at 250 degrees (130 degrees celcius) for another 5 to10 mts till the cake is brown and when you insert a knife into the cake, it should come through clean.\r\n9 Once done, cool on a wire rack for 15 mts before removing the cake from the tin and carefully peel the paper. Cool the cake completely before wrapping in a clear plastic wrap. Keep away the cake for a minimum of 24 hours before serving. Slice the cake with a serrated knife.\r\n\r\n\r\n\r\nNote: 1. The cake tastes best if it ripens for at least a week. 2. Caramel can be made ahead and stored in the refrigerator for a few days. 3. All the ingredients should be at room temperature. 4. Dust dried fruits in flour before adding into the cake batter. This will ensure that they do not sink to the bottom of the baked cake but spread evenly through out the cake. 5. You can substitute rum\/wine with apple juice or pineapple juice. 6. Use fresh spices. 7. Line the greased cake tins along the sides also.\r\nCheck out more fruit cake recipes at Annita, Shammi, Archana, Bee, Mishmash, Shilpa and Meeta.\r\n\r\nMy entry to A Fruit A Month - Dry Fruits event hosted by Latha and Lakshmi of 'The Yum Blog' and 'Think Spice - Cinnamom' event hosted by Sunita.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2007\/12\/christmas-fruit-cake1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/christmas-fruit-cake1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/christmas-fruit-cake1-300x300.jpg","main-ingredient":["flour","dry fruits","sugar"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes"]}