{"id":767,"permalink":"http:\/\/www.sailusfood.com\/2008\/01\/07\/methi-chole-bhatura\/","title":"Methi Chole - Bhatura","content":"Chole Bhatura, popular Punjabi street food fare is one of my favorite brunch items. Our Sunday brunch was Methi Chole and deep-fried indulgence, Batura. A comforting brunch you'd want to eat on a cold winter morning to nuture your body and soul. Its the first time I prepared this winning combination of kabuli channa and methi, and I have Sri. Hemantji to thank for sharing this 'no onion-no garlic' Rajasthani Methiwale Kabuli Chole recipe. \r\n\r\nKabuli channa (chickpeas) and fresh methi leaves, simmered together in a spice-tomato base, while exuding an alluring aroma has a flavor that is earthy, soothing and irresistable. Bhatura recipe is a tried and tested one that never fails to please and works well for me.\r\n\r\n\r\n\r\n\r\nBhature Recipe\r\nPrep: 10 mts, Sitting time: 4 hrs, Cooking time: 20 mts\r\nServes 5 persons\r\nCuisine: Punjabi\r\nSource: Recipe files\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups maida\/all-purpose flour\r\n\r\n1 tbsp semolina\/sooji\r\n\r\n2 tbsps curd\r\n\r\n1 tsp salt\r\n\r\n1\/2 tsp sugar (optional)\r\n\r\n1 tsp baking pwd\r\n\r\nwater to knead into a dough\r\n\r\n\r\n1 Combine all the mentioned ingredients and make a soft dough.\r\n2 Cover with a wet cheesecloth and keep aside for at least 3-4 hrs.\r\n3 Pinch off some dough and make lemon sized balls and roll into thick oval shaped rotis, approx 1\/8\" thickness.\r\n4 Heat enough oil for deep frying in a heavy bottomed vessel. It should be on medium high and once its hot, slide the batura into the hot oil and using the back of the ladle, press in the center and along the edges and you will find it will puff. Flip over and fry the other side till light golden brown. Don't fry too much as it will turns too dark. The bature should cook on the inside and puff up. Remove on to tissue paper.\r\n5 Serve hot with methi chole, sliced fresh onions and salad of your choice.\r\nNote: Ensure the oil is hot enough before frying the batura. If the oil is not hot enough, the batura will absorb a lot of oil. The dough can be stored in the refrigerator overnight. Let the dough ferment for at least 4 hours.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/methi_chole_bature.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi_chole_bature-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi_chole_bature-300x300.jpg","main-ingredient":["methi","white chickpeas"],"author":null,"type":"post","categories":["All Recipes","Flour Recipes","Green Leafy Vegetables","Indian Bread Recipes","Indian Curry Recipes","Indian Dal Recipes","Indian Vegetarian Recipes","North Indian Recipes"],"tags":["chole","features"]}