{"id":7919,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/24\/khasta-kachori-chaat\/","title":"Khasta Kachori (Chaat)","content":"Khasta Kachori\r\n\r\nSmall, crisp, golden puri, stuffed with a dry, spiced filling is how I'd describe a Kachori that has its origins in Rajasthan. Makes for an addictive tea time snack or appetizer. There are different fillings that go into Kachori making and today its Khasta Kachori that calls for a lentil filling. I tried to re-create this street food at home and am quite happy with the outcome, both texture and flavor wise. Like most chaats, Kachori chaat combines a variety of textures and tastes, balancing sweetness with spice and tang. Deeply satisfying! :)\r\n\r\n\r\nKachori Filling ~ Stuffed Kachori before deep frying\r\n\r\nKhasta Kachori ~ Kachori Chaat\r\n\r\n\r\nKhasta Kachori Recipe\r\nPrep & Cooking: 1 hr 15 mts\r\nMakes approx 8-10 Kachoris\r\n.\r\n\r\nIngredients:\r\n\r\n\r\n1 cup maida (all-purpose flour)\r\n\r\n1 tbsp rice flour\r\n\r\n2 tbsps oil\r\n\r\nenough cold water to knead the maida\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\nFor the filling:\r\n\r\n1\/4 cup yellow moong dal, soak for 3 hrs, drain, lightly dry and coarsely ground\r\n\r\n1\/4 cup urad dal, soak for 3 hrs, drain, lightly dry and coarsely ground\r\n\r\npinch of hing\r\n\r\n1\/4 tsp cumin pwd or crushed cumin seeds\r\n\r\n1 tsp ginger-green chilli paste\r\n\r\n1\/2 tsp red chilli pwd\r\n\r\n1\/2 tsp coriander pwd or crushed coriander seeds\r\n\r\nlarge pinch of amchur\r\n\r\nlarge pinch of fennel pwd\r\n\r\npinch of garam masala\r\n\r\n1 tbsp besan\r\n\r\n1\/2 tbsp oil\r\n\r\nsalt to taste\r\n\r\n\r\n1 Mix the maida, rice flour with salt and oil, combine to form a crumbly mixture. Now slowly add enough water to make a pliable dough, not too soft. Divide the dough and shape into balls. Keep aside covered with moist cloth for 15-20 mts. \r\n2 While the dough is resting prepare the filling. Heat a vessel, add oil, add crushed cumin seeds and asafoetida allow the cumin to brown. Add the ginger-green chilli paste, besan and spice powders and saute for a mt. Add coarsely ground dal and saute for 7-8 mts and turn off heat.\r\n3 Now that the stuffing is ready, prepare the outer layer for the kachori.\r\n4 Roll each ball with the rolling pin into a slightly thick puri and place a tbsp of the filling in the center. Enclose the filling by gathering the outer edge of the puri to form a pocket. Pinch off extra dough and shape into a flat ball by gently pressing your thumb in the center.\r\n5 Prepare with the rest of the dough in the same manner. Keep them covered through out the preparation process.\r\n6 Heat enough oil in a wide vessel to deep fry the kachoris. Heat the oil till hot but not piping hot. Reduce flame to low medium and drop 2 kachoris into the oil slowly and deep fry them till golden brown, turning them carefully to the other side so that it cooks on both sides and puff up. Deep fry on low heat and not piping hot oil.\r\n7 Remove onto absorbent paper and serve warm along with a cup of chai.\r\n\r\nNote: Its better to make kachoris in batches. Roll out, stuff and deep fry 2 kachoris at a time. Keep the prepared kachoriss covered through out the preparation process. \r\n\r\nKachori Chaat\r\n\r\nHow to make Khasta Kachori Chaat\r\n\r\nPlace a kachori on a plate, make a hole in the centre of it. Spoon 2 tbsps of yogurt into the kachori. Spoon a tbsp of green chutney and a tbsp of khajur imli chutney. Sprinkle pinch of chilli pwd, cumin pwd, chopped onions and a tbsp of chopped coriander on the top of the kachori. Finish off with sev and serve immediately. (Vegans can omit yogurt)\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/kachori-chaat.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kachori-chaat-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kachori-chaat-300x300.jpg","style":["traditional"],"course":["snack","appetizer"],"special-diet":["nut free","eggless","vegetarian","vegan","kid friendly","pregnancy"],"cuisine":["indian","rajasthani"],"cook-time":"30","prep-time":"30","main-ingredient":["maida","dal"],"serves":"5","goes-well-with":["tea"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["kachodi","kachori","khasta-kachori"]}