{"id":8066,"permalink":"http:\/\/www.sailusfood.com\/2010\/03\/29\/batata-vada-vada-pav\/","title":"Batata Vada & Vada Pav","content":"Batata Vada\r\n\r\nMumbai's popular fast food snack, Batata Vada, is a deep fried indulgence. Spiced mashed potatoes are dipped in chickpea batter, deep fried to a golden shade and served with mint-coriander chutney or garlic chutney. When Batata Vada is sandwiched between green chutney smeared pav, it becomes a Vada Pav, another of Mumbai's famous street food snack. \r\n\r\nThere are quite a few variations to prepare the potato stuffing. I like to season with spices, saute onions and ginger garlic paste before combining with mashed potatoes.\r\n\r\n\r\nBatata Vada Recipe\r\nPrep & Cooking: 45 mts\r\nServes 6-8 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 large potatoes, lightly mashed\r\n\r\n1\/4 tsp cumin seeds \r\n\r\n1\/2 tsp mustard seeds\r\n\r\nfew curry leaves\r\n\r\n1 onion, finely chopped\r\n\r\n2 green chillis, finely chopped\r\n\r\n1\/2 tsp ginger garlic paste\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n1 tbsp lemon juice\r\n\r\nfresh coriander leaves for garnish\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil\r\n\r\nFor batter:\r\n\r\n1 cup besan\/chickpea flour\/senaga pindi\r\n\r\n2 tbsps rice flour\r\n\r\nsalt to taste\r\n\r\n1\/2 tsp red chilli pwd\r\n\r\npinch of cooking soda\r\n\r\nwater as required\r\n\r\n\r\n\r\n1 Heat oil in a vessel, add the mustard seed and allow them to splutter. Add the cumin seeds and let them brown lightly. Add green chillis, curry leaves and ginger-garlic paste and saute for a mt. Immediately add the onions and saute for 3 mts.\r\n2 Add the salt, turmeric pwd and combine. Add the mashed potatoes and combine and cook for a mt. Add coriander leaves and lemon juice and turn off heat. Cool and make small balls and keep aside.\r\n3 Place a heavy bottomed vessel on the stove, add enough oil for deep-frying and allow it to heat on low flame. While the oil is heating prepare the batter.\r\n4 In a bowl, add the ingredients required for making the batter. Slowly add water and make a slightly thick, flowing batter. Dip the potato ball in the batter and coat it well and place in the hot oil. Cook on medium high flame till golden brown. Remove onto absorbent paper.\r\n5 Serve hot with chutney or tomato sauce and a cup of masala chai OR proceed to prepare Vada Pav.\r\n\r\nVada Pav\r\n\r\nHow to assemble Vada Pav ~\r\n\r\nCut pav bread horizontally in the center. Spread a tsp of green chutney and garlic chutney (optional) on one of the halves of the pav, layer with onion slices, place a batata vada and cover with the other half of pav. Gently press using your palm and serve along with lemon wedges.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/03\/batata-vada.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/batata-vada-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/batata-vada-300x300.jpg","style":["easy","modern"],"course":["snack","appetizer"],"special-diet":["nut free","eggless","vegetarian","dairy free","kid friendly","pregnancy"],"cuisine":["indian","maharastrian"],"cook-time":"30","prep-time":"15","main-ingredient":["potato","chickpea flour","pav"],"serves":"8","goes-well-with":["chutney","tea"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["batata-vada","vada-pav"]}