{"id":829,"permalink":"http:\/\/www.sailusfood.com\/2008\/02\/20\/chocolate-chip-and-almond-cookies\/","title":"Chocolate Chip and Almond Cookies","content":"\r\nFor Christmas I had prepared quite a few varieties of cookies and one of them was chocolate chip and almond cookies, a recipe adapted from allrecipes, absolutely simple to make. I tweaked the recipe and added coarsely powdered toasted almonds for the extra nutty flavor. Golden brown treats flecked with spots of black chocolate chips and toasted almond pieces, intensely rich, slightly nutty and crumbly - in other words, they taste heavenly. Must mention that they make a great match with a cup of masala chai.\r\n\r\nChocolate Chips and Almond Cookies Recipe\r\nPreparation: 15 mts, Baking: 20 mts\r\nMakes approx 28 cookies\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 cups all purpose flour (maida)\r\n\r\n3\/4 cup unsalted butter, melted\r\n\r\n1\/4 tsp salt\r\n\r\n1 cup brown sugar\r\n\r\n1\/2 cup white sugar\r\n\r\n3\/4 tsp baking soda\r\n\r\n1 egg\r\n\r\n1 egg yolk\r\n\r\n2 tsps vanilla essence\r\n\r\n1 cup chocolate chips\r\n\r\n1 cup powdered almonds (roast almonds and coarsely pwd)   \r\n \r\n\r\n\r\n1 Sieve together flour, baking soda and salt. Keep aside. \r\n2 In a bowl, cream together the melted butter, brown sugar and white sugar until well blended. Beat in the vanilla, egg and egg yolk until light and creamy. \r\n3 Mix in the seived ingredients until just blended. Stir in the chocolate chips and toasted almond pwd using a wooden spoon. \r\n4 Drop cookie dough using a tablespoon onto prepared cookie sheet. Cookies should be about 2 1\/2 - 3 inches apart.\r\n5 Bake in a pre-heated oven at 170 C for about 20-22 mts till the edges are slightly toasted or till done. Once baked, the cookie will feel soft on touch but once cool it will harden. If you over bake beyond the mentioned time limit, you will have a very crunchy cookie.\r\n6 Cool on a wire rack. Repeat with remaining dough. Store in airtight container.\r\n\r\n\r\nCookies in a jar, gifted wrapped\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/cookies_in_a_bowl.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/cookies_in_a_bowl-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/cookies_in_a_bowl-300x300.jpg","main-ingredient":["chocolate"],"author":null,"type":"post","categories":["All Recipes","Cookie Recipes","Easy Pasta Recipes","Flour Recipes"]}