{"id":8357,"permalink":"http:\/\/www.sailusfood.com\/2010\/04\/12\/apple-streusel-cake\/","title":"Apple Streusel Cake","content":"Apple Streusel Coffee Cake\r\n\r\nNehal's done with his exams a week ago and is having his friends drop by. Yesterday, while they played, cycled and screamed their lungs off, I got myself to bake in the sultry weather, quickly took pictures of the final outcome before they barged in with hunger pangs.\r\n\r\nI had some red apples with an unusual tart flavor sitting in the refrigerator for more than 2 weeks. Obviously they were no takers. Put them to good use by preparing a bookmarked Apple Streusel Cake recipe from Sheba's lovely blog. Do check out her awesome bakes. Made a few changes to the original recipe and am satisfied with the outcome. Cinnamon flavored, tender, perfectly laced with apples and not an overly sweet cake. The boys were more than happy to devour the cake (and muffins) alongside Iced cocoa.\r\n\r\n\r\nApple Streusel Cake Recipe\r\nPreparation: 15 mts, Baking: 1 hr\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup all purpose flour\/maida\r\n\r\npinch of salt\r\n\r\n1 1\/2 tsp baking pwd\r\n\r\n1\/2 cup white sugar\r\n\r\n1\/4 cup butter\r\n\r\n2 eggs\r\n\r\n1\/2 tsp cinnamon pwd\r\n\r\n4 tbsps low fat milk\r\n\r\n1 large apple (tart), peeled, cored and sliced\r\n\r\nFor topping:\r\n\r\n1\/4 cup maida\r\n\r\n2 1\/2 tbsps butter\r\n\r\n1\/4 cup brown sugar \r\n\r\n1\/4 tsp cinnamon pwd\r\n\r\n\r\n\r\n1 Preheat oven to 175 C. Grease and flour a round baking pan. Prepare the topping by combining brown sugar, cinnamon pwd and maida well. Cut the butter into this mixture using a fork until it appears crumbly. You can also add a few tbsps of chopped walnuts. Keep aside.\r\n2 Sieve maida, baking pwd and salt in a bowl. \r\n3 In another bowl, cream butter and sugar. Use a hand blender to make a smooth creamy mixture. Add the beaten eggs and combine well. Add cinnamon pwd and combine.\r\n4 Fold in the maida mixture little by little alternating with milk. Do not over beat, just fold the dry till there is not trace of any flour.\r\n5 Pour batter into the greased and floured pan. Smooth the top using a spatula. Arrange the apple slices on top. Sprinkle the streusel topping liberally. Bake in preheated oven for 1 hr or till a toothpick inserted into the cake comes out clean. Place on a wire rack to cool, slice and serve at room temperature.\r\n\r\n\r\n\r\nFor muffins ~ Spoon a tbsp of cake batter in a muffin liner. Top with peeled and chopped apple, sprinkle topping and bake for 25-27 mts at 175 C.\r\n\r\nApple Streusel Muffin","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/04\/apple-streusel-coffeecake.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/apple-streusel-coffeecake-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/apple-streusel-coffeecake-300x300.jpg","style":["easy"],"course":["dessert"],"special-diet":["nut free","dairy","kid friendly","pregnancy"],"cuisine":["german"],"cook-time":"60","prep-time":"15","main-ingredient":["apple","all purpose flour","butter","eggs","sugar"],"goes-well-with":["coffee","tea"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes","Sweet Dessert Recipes"],"tags":["apple","cake","streusel"]}