{"id":852,"permalink":"http:\/\/www.sailusfood.com\/2008\/02\/07\/methi-matar-subzi\/","title":"Methi-Matar Subzi","content":"\r\n\r\nThis recipe comes from the table of one of my North Indian friend's mother who dishes out delicious North Indian food. One the many reasons I love winters is green peas. Sweet plump green matar (peas) and fresh methi leaves make for a delectable combination. With undertones of tart from the tomatoes, a faint whisper of spice and good measure of sweetness, methi-matar, makes for a modest subzi to go with rotis and can be prepared in less than 30 mts.  Our meal today ~ Gobi Paratha, Methi Matar subzi, curd and salad.\r\n\r\n\r\nMethi Matar Subzi Recipe\r\nPreparation: 30 mts\r\nServes 4-5 persons\r\nCuisine: North Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n3\/4 cup fresh green peas\/bataani\/matar \r\n\r\n1 1\/2 cup packed fresh methi leaves, add little salt and sugar and leave aside for few mts\r\n\r\n2 onions, finely chopped\r\n\r\n1 tomato, finely chopped\r\n\r\n1 tsp cumin seeds\r\n\r\n1\" grated ginger\r\n\r\nbig pinch of asafoetida\/hing\/inguvva\r\n\r\n1 1\/2 tsp red chilli pwd\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n2 tsps coriander pwd\r\n\r\n1\/2 tsp cumin pwd\r\n\r\n2 tbsps curd\r\n\r\n7-8 cashewnuts, soak in little milk and grind to paste\r\n\r\ngaram masala pwd (2 cloves, 1\/2\" cinnamon, 1 cardamom)\r\n\r\nsalt to taste\r\n\r\n1\/2 tbsp oil or ghee\r\n\r\ncream for garnish\r\n\r\n\r\n1 Add big pinch salt+ big pinch sugar to the methi leaves and let it rest for a few mts. Squeeze excess water from methi and keep aside.\r\n2 Heat ghee or oil in a vessel, add the cumin seeds and let them splutter. Add grated ginger and asafoetida and saute for 4-5 seconds. Add chopped onions and saute till the onions turn transparent. Add the methi leaves and stir fry for another 4-5 mts on medium heat.\r\n3 Add the spice pwds  (except garam masala pwd) and salt. Combine well. Add the tomatoes and cook until soft. \r\n4 Add the green peas and saute for a minute. Add a cup of water and cook on high heat for 3-4 mts. Reduce flame, cover with lid and cook on simmer for another 6-7 mts. Next, add the curd and go on stirring till its well combined, approx 5-7 mts or till it reaches required gravy consistency. \r\n5 Add garam masala pwd and cashewnut paste and combine well. Adjust the salt, garnish with cream and serve hot with rotis\/paranthas. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/methi_matar_subzi_gobi_paratha.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi_matar_subzi_gobi_paratha-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/methi_matar_subzi_gobi_paratha-300x300.jpg","main-ingredient":["methi","green peas"],"author":null,"type":"post","categories":["All Recipes","Green Leafy Vegetables","Indian Curry Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"]}