{"id":855,"permalink":"http:\/\/www.sailusfood.com\/2008\/02\/11\/dondakaaya-vepudu-tindora-stir-fry\/","title":"Dondakaaya Vepudu - Tindora Stir Fry (2)","content":"I had some fresh tender, plump, dondakayalu (tendli, tindora, kovakkai, ivy gourd) that I had picked up from the rythu bazaar (Farmers Market) this morning. I prepared quite a few varieties with this nutritious vegetable (I'm an ivy gourd fan!) especially stir fries and today, I decided to make a stuffed dry saute with them and came up with this recipe. All you have to do is stuff the tindora and saute them in a tempering base till soft yet with a bit of crunch. \r\n\r\n\r\nWe enjoyed the stir fry with its well balanced flavors. Another variation, give a tangy twist by squeezing some fresh lemon juice towards the end of cooking process. \r\n\r\n\r\nDondakaya Vepudu Recipe\r\nPrep & Cooking: 35 mts\r\nServes 3-4 persons\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/4 kg dondakaayalu\/tindora\/ivy gourd, trim ends, make + slit till three fourth of dondakaya\r\n\r\nFor stuffing:\r\n\r\n2 onions, very finely chopped\r\n\r\n1 tsp ginger garlic paste\r\n\r\n1 tsp chilli pwd (adjust)\r\n\r\n3\/4 tsp coriander pwd\r\n\r\nbig pinch cumin pwd\r\n\r\n1\/4 tsp saunf pwd (fennel seeds)\r\n\r\n1 1\/4 tbsp peanuts, coarsely powdered\r\n\r\n1 tbsp chopped coriander leaves\r\n\r\nsalt to taste\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1 tsp mustard seeds\r\n\r\n1\" cinnamon stick\r\n\r\n1 tbsp split black gram dal (urad dal\/minapappu)\r\n\r\nfew fresh curry leaves\r\n\r\n1 tbsp oil\r\n\r\n\r\n\r\n1 Combine all the ingredients for stuffing. Stuff the + slit dondakayalu with the stuffing mixture and keep aside.\r\n2 Heat oil in a cooking vessel, add the mustard seeds and let them splutter, followed by the urad dal, let the dal turn red. Add the curry leaves and cinnamon stick and saute for a few seconds.\r\n3 Add the stuffed dondakayalu (if any stuffing is left over add it too). Cook on medium heat, turn once in a while for 6-7 mts.\r\n4 Reduce flame, cover with lid and cook. Once in a while, stir the dondakayalu such that they cook all over. Remove lid after 15 mts. Continue to stir fry for a few more mts till the dondakayalu are soft yet have a bit of crunch. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/dondakaaya_masala_vepudu.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dondakaaya_masala_vepudu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/dondakaaya_masala_vepudu-300x300.jpg","main-ingredient":["tindora"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Fry Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}