{"id":867,"permalink":"http:\/\/www.sailusfood.com\/2008\/02\/25\/capsicum-pachadi\/","title":"Capsicum Pachadi","content":"This morning, there was no way I could pass up the capsicums sitting in the refrigerator screaming for attention. I set out to prepare a pachadi in combination with green chillis to mellow down the sweetness of capsicums. Capsicum and green chilli pieces are sauteed in oil, ground to a coarse paste and slow cooked in a tempering spice base along with tamarind to create an amazingly well balanced flavored pachadi - sweet, sour and spicy. Once you devour it with rice and a dash of ghee, its hard to imagine cooking and relishing capsicums in any other way.:)\r\n\r\n\r\nCapsicum Pachadi Recipe\r\nPrep &amp; Cooking: 30-35 mts\r\nServes 7-8 persons\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n3 big capsicums, washed and cubed\r\n\r\n8-10 green chillis, chop into big pieces (adjust)\r\n\r\n2-3 tbsps tamarind paste (adjust)\r\n\r\n1 large onion, finely sliced\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds (optional)\r\n\r\n1 tbsp split black gram dal (urad dal\/minapappu)\r\n\r\n1\/2 tbsp channa dal (senaga pappu)- optional\r\n\r\n1-2 dry red chillis\r\n\r\nbig pinch asafoetida\/inguva\/hing\r\n\r\nfew fresh curry leaves\r\n\r\n1 tbsp oil\r\n\r\n1 Heat two tsps oil in a cooking vessel, add green chillis and fry on medium heat for 4-5 mts, stirring it constantly. Remove from pan and cool.\r\n2 In the same pan, add the capsicum pieces and stir fry on medium heat for 3 mts. Remove and cool.\r\n3 Once cool, grind the sauteed green chillis, capsicum and tamarind paste to a coarse paste. Keep aside.\r\n4 Add the remaining oil to the cooking vessel, add mustard seeds and let them pop, add cumin seeds and dals. Let the dals turn red, add curry leaves and dry red chillis. Add the asafoetida and stir fry for a few seconds.\r\n5 Add the sliced onions and fry for 4 mts or till they turn transparent. Add the ground capsicum-green chilli paste to the sauteed onions and stir fry for atleast 15-18 mts on low to medium flame.\r\n6 Add salt and combine. Ensure that the capsicum-green chilli paste is thoroughly fried in oil. This pachadi stays fresh for a few days if stored in the refrigerator.\r\n7 Serve with hot rice and a dollop of ghee.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/capsicum-pachadi.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/capsicum-pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/capsicum-pachadi-300x300.jpg","main-ingredient":["capsicum"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["features"]}