{"id":868,"permalink":"http:\/\/www.sailusfood.com\/2008\/02\/13\/arati-kaya-plantain-chips\/","title":"Arati Kaya (Plantain) Chips","content":"Its been raining here in Vizag for the past few days, unseasonal weather and a strange way to welcome summer! I love the rains but when they are intermittent without any trace of sunlight for days together, it takes the crisp flavor of home-made plantain chips to lift my spirits on such gloomy days. A favorite cold-weather comfort snack, Aratikaaya chips are good on their own without any frills. If you are one who loves spice, you'd want to sprinkle some red chilli pwd along with a dash of salt. \r\n\r\n\r\n\r\n\r\nAratikaya Chips Recipe\r\nPrep & Cooking: 20-30 mts\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 raw green plantains, firm and unripe\r\n\r\noil for deep-frying\r\n\r\nsalt to taste\r\n\r\nchilli pwd to taste OR 1-2 dry red chillis de-seeded (optional)\r\n\r\n\r\n\r\n1 Peel the plantains, cut into thin slices. You can even cut each slice into quarters (optional). Alternately, you could use a chip grater\/mandolin and slice the plantain directly into the hot oil. I wouldn't recommend the second method for beginners.\r\n2 Heat oil in a heavy bottomed vessel. To test if oil is hot enough for deep frying plantain slices, drop a slice into the oil, if the oil bubbles around it with a sizzling noise, the oil is ready.\r\n3 Into the hot oil, drop the sliced plantain quarters (depending on the size of vessel used for deep frying, drop just enough plantain slices such that the vessel isn't overcrowded) into the hot oil. On medium flame, deep fry.\r\n4 Use a slotted stainless steel ladle to stir the chips gently. When they reach golden brown color, remove them onto a paper towel to absorb any excess oil. Repeat with the remaining batch of plantain slices. \r\n5 Season with salt and chilli pwd. Store them in an air tight container when cool. They can be stored for a few days.\r\n\r\n","main-ingredient":["raw plantain"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["plantain"]}