{"id":8714,"permalink":"http:\/\/www.sailusfood.com\/2010\/05\/01\/summer-coolers-nimbu-pani-lemonade\/","title":"Summer Coolers ~ Nimbu Pani - Lemonade","content":"During summer months I avoid long hours in the kitchen. Usually in the month of May, our mid day meals are quick to prepare, light, healthy and refreshing, mostly fruits, smoothies, coolers and light meals like wraps, salads and lightly sauteed vegetables. The meals in summer mostly seasonal vegetables\/fruit-centric as they heal and cool down our system. So May will focus on light summer meals and coolers. \r\n\r\n\r\n\r\nVitamin C rich, Nimbu Pani aka Lemon water, a refreshing thirst quencher is a common summer drink in Indian homes. Basic recipe involves lime juice, water, sugar and pinch of salt. For a deeper lemony flavor, add the squeezed out lemons to the prepared lemonade and allow to sit for an hour or so. Strain and serve. For variation, add pinch of cardamom OR pinch of chat masala powder OR pinch of jaljira powder to a glass of Nimbu Pani. Will blog more lemonade versions using ginger, mint and herbs in future posts.\r\n\r\nCardamom flavored Nimbu Pani ~ Nimbu Pani\r\n\r\nPrepare sugar syrup first by simmering a cup of water to which 2\/3 cup sugar or brown sugar is added. Allow sugar to dissolve completely and cool. Extract juice from 9-10 limes or approx 1 cup of lime juice. Strain and discard the seeds. Keep aside.\r\n\r\nTake a pitcher and add 10 cups of cold water, add the extracted lime juice and cooled sugar syrup and combine. Add 1 tsp of salt and combine. If you find it to be less sweet, add more sugar syrup and if it needs to be more tart, add more lime juice. Serve with ice in tall glasses.\r\n\r\nFor those who want to avoid sugar, replace sugar syrup with a cup of honey.\r\n\r\nHerbal Sugar ~ Stevia Concentrate\r\n\r\nI have used Stevia as a sweetner for Nimbu Pani, tea and juice and am happy with the taste. It is an acquired taste and needs getting used to. The liquid form of Stevia is the best and does not have a bitter aftertaste. I prepare Stevia concentrate (liquid) by simmering 1 cup of Stevia powder and 4 cups of water till at least a cup of water evaporates. Then allow to cool for 12-15 hours, strain through a cheesecloth and refrigerate and use as required. The liquid can be refrigerated upto 4 weeks. Just a few drops of Stevia concentrate is enough for a glass of Nimbu Pani or a cup of tea.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/05\/lemon-juice.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/lemon-juice-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/lemon-juice-300x300.jpg","style":["easy","modern","quick"],"course":["drink"],"special-diet":["nut free","eggless","vegetarian","vegan","dairy free","kid friendly","pregnancy"],"cuisine":["indian"],"cook-time":"10","prep-time":"10","main-ingredient":["lemon","lime","sugar"],"serves":"10","author":null,"type":"post","categories":["All Recipes","Indian Drink - Sharbat Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["lemon","lemonade","lime","nimbu"]}