{"id":876,"permalink":"http:\/\/www.sailusfood.com\/2008\/02\/27\/sorakaya-kootu-bottle-gourd-lentil-stew\/","title":"Sorakaya Kootu - Bottle gourd lentil stew","content":"Kootu is a popular South Indian lentil based vegetable stew that is thick in texture. Kootus usually comprise of lentils (channa dal\/moong dal) and vegetables like bottle gourd, potatoes, plantains, brinjals, cabbage, carrots and beans that are cooked in a blend of fresh coconut and green chillis. There are many variations to the kootu in terms of preparation where the blends include either tamarind or coconut or sour buttermilk. \r\n\r\n\r\n\r\nSorakai kootu is prepared with bengal gram dal and bottle gourd which are simmered in a blend of fresh coconut, green chillis and cumin seeds which brings a warm flavor to the earthy dal. Further, the tempering of mustard seeds, fresh curry leaves, redolent with the exotic aroma of asafoetida, adds another dimension to the flavor of the simmering kootu. Sorakaaya kootu is a simple to execute, nutritious and full of flavor that goes well with rice or rotis. \r\n\r\n\r\nbottle gourd (cubed), channa dal, coconut-green chilli paste\r\n\r\n\r\nSorakai Kootu Recipe\r\nPrep & Cooking: 25 mts, soaking:1\/2 hour\r\nServes 4-5 persons\r\nCuisine: South Indian\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 small cup sengapappu\/bengal gram\/channa dal, washed and soaked in water for 1\/2 hr\r\n\r\n1 1\/2 cup sorakaya\/bottlegourd, peeled and cubed\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\nsalt to taste\r\n\r\nMake a paste:\r\n\r\n1 small cup grated coconut\r\n\r\n3-4 green chillis (adjust)\r\n\r\n1\/2 tsp cumin seeds\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1 tsp mustard seeds\r\n\r\n1 tbsp split black gram dal (urad dal\/minapappu)\r\n\r\n1-2 dry red chillis\r\n\r\n1 tsp grated coconut (optional)\r\n\r\nbig pinch asafoetida\/inguva\/hing\r\n\r\nfew fresh curry leaves\r\n\r\n2 tsps oil\r\n\r\n\r\n\r\n1 Pressure cook channa dal, bottle gourd cubes, half cup of water and turmeric pwd upto two whistles. The dal and bottle gourd should be just cooked and not become too mushy.\r\n2 Add the coconut paste and salt to the cooked dal-bottle gourd mix and combine well. Cook on medium flame for 12-15 mts. The texture should be thick and not watery.\r\n3 In a pan, add oil, add mustard seeds and let them pop, add urad dal and let it turn red. Add curry leaves and dry red chillis, followed by asafoetida and stir fry for a few seconds. Add the grated coconut and stir fry for 4-5 secs. \r\n4 Add the tempering to the dal mixture and combine. Turn off heat and place lid and leave covered for a few mts.\r\n5 Serve with hot rice.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/anapakaaya_senaga_pappu_kootu.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/anapakaaya_senaga_pappu_kootu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/anapakaaya_senaga_pappu_kootu-300x300.jpg","main-ingredient":["bottle gourd"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Dal Recipes","Indian Lentil Recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes"]}