{"id":882,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/11\/vermicilli-semiya-upma\/","title":"Vermicelli (Semiya) Upma","content":"\r\nHonestly, I have a blissful relationship with 'vermicelli' - always there to comfort me during crisis times. A blessing in my pantry and a life-saver during times when I run out of dosa or idli batter. Doesn't need much to work on, just add vegetables for some nutrition and you have a one pot meal ready for lunch or dinner in less than 20 mts. \r\n\r\nI made an easy, tasty and light breakfast dish, Semiya Upma, this morning. I like to add tomatoes and coriander to vermicilli upma and also a cinnamon stick during the seasoning process, giving the semiya just the right amount of spice and aroma. For those of you who dislike vermicelli, maybe it's time to overcome your fears and give it the attention it deserves.\r\n\r\nSemiya Upma Recipe\r\nPrep & Cooking Time: 20 mts\r\nServes 4-5 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n2 cups vermicilli, roast in a tsp of ghee for 4-5 mts till golden brown\r\n\r\n1 finely sliced large onion\r\n\r\n3-4 slit green chillis\r\n\r\n1\" ginger finely chopped\r\n\r\n1 large tomato, chopped\r\n\r\n1 tbsp chopped coriander leaves (optional)\r\n\r\n1\/2 tbsp oil\r\n\r\n1 tsp ghee or butter\r\n\r\nsalt \r\n\r\nFor seasoning:\r\n\r\n1 tsp mustard seeds\r\n\r\n1\/2 tbsp split blackl gram\r\n\r\n1\/2\" cinnamon stick (optional)\r\n\r\n12-15 curry leaves\r\n\r\n\r\n1 Boil 4 cups of water and add the vermicelli along with 1\/4 tsp salt and 1 tsp oil. Once the vermicelli is cooked (it should be just soft and not mushy), turn off heat, pour the vermicilli into a colander to drain completely and pour cold water over it and keep aside.\r\n2 Heat oil in a cooking vessel, add the mustard seeds and let them splutter. Add the black gram, cinnamon stick and curry leaves and saute them till the dal turn slightly brown and a nice aroma emanates the kitchen.\r\n3 Add the sliced onions, green chillis and ginger and saute for 2 mts.\r\n4 Add the chopped tomatoes and saute on medium heat for 4 mts. Add salt to taste (remember you have already added salt to the boiling vermicilli, so add accordingly).\r\n5 Now, add the cooked semiya to the sauteed onion-tomato base and mix it lightly and see that no lumps form and it combines well. Add a tsp of ghee or butter and combine well. Garnish with coriander leaves.\r\n6 Serve hot with chutney or pickle of your choice.\r\nNote: For variation, garnish with grated coconut and add 1\" cinnamom stick (during seasoning). You can added roasted cashews too. \r\n ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/vermicilli_upma.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vermicilli_upma-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vermicilli_upma-300x300.jpg","main-ingredient":["vermicelli"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["features","semiya","vermicilli"]}