{"id":885,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/03\/godhuma-wheat-rava-tomato-upma\/","title":"Godhuma (Wheat) Rava - Tomato Upma ","content":"\r\nThis past week has been flu time at our home. My to-do list never seems to end. Summer is officially here, its HOT and HUMID (Vizag being a coastal city) and its only early March. So its comfort food for me this week to ease the stress. Comforting, wholesome and filling is how I'd describe wheat rawa upma. This is one of the simplest and quickest breakfast foods you can prepare. Using cracked wheat to prepare upma is a refreshing change from the monotony of semolina which is more fast-cooking than cracked wheat. Upma is very versatile and is receptive to so many possible variations. \r\n\r\nI prepared it with the standard upma seasoning redolent with the fresh flavor of curry leaves and green chillis, and tomatoes being the flavor enhancer. You can also have a citrus-infused upma by adding a tbsp or two of lemon juice and omit the tomatoes. How do you like your upma? A gooey creamy mass or a more dry, loose texture upma (it goes by the term 'vidi vidi upma' in telugu)? I enjoy both types.:) \r\n\r\nWheat Ravva Tomato Upma Recipe\r\nPrep & Cooking Time: 25 mts\r\nServes 3-4 persons\r\nCuisine: South Indian\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/2 cups wheat rava\r\n\r\n1 finely sliced large onion\r\n\r\n1 large tomato, finely chopped\r\n\r\n3-4 slit green chillis\r\n\r\n1\" ginger finely chopped\r\n\r\n1 tbsp ghee or oil\r\n\r\n1 tbsp chopped coriander leaves\r\n\r\n3 3\/4 to 4 cups water\r\n\r\nsalt to taste\r\n\r\nFor seasoning:\r\n\r\n1 tsp mustard seeds\r\n\r\n1 tbsp bengal gram\r\n\r\n1 tbsp black gram dal\r\n\r\n12-15 curry leaves\r\n\r\n\r\n\r\n1 Heat oil or ghee in a cooking vessel, add the mustard seeds and let them splutter. Add bengal gram, black gram, curry leaves and saute them till the dals turn red and a nice aroma emanates the kitchen.\r\n2 Add the sliced onions, green chillis and ginger and saute for 2 mts.\r\n3 Add the chopped tomatoes and saute on medium heat for 4 mts. Add salt and water and bring to a boil before adding the wheat ravva. \r\n4 Now, reduce heat and slowly add the wheat ravva to the water and mix it continuously so that lumps don't form and it combines well with the water.\r\n5 Cover with lid and let it simmer for 12 mts. Turn off heat. Combine well. Garnish with chopped coriander leaves.\r\n6 Serve hot. You can also serve with chutney, sugar or pickle of your choice.\r\n\r\nVariations:\r\nYou can use mixed vegetables of your choice like beans, potatoes, carrots, peas\r\nTop off with grated coconut\r\nToasted cashewnuts or roasted peanuts\r\nDrizzle some lemon juice after turning off heat\r\n\r\nNote: Oil can replace the ghee. Wheat rawa requires more water to cook than semolina\/sooji and the ratio is 1:2 1\/2, i.e 1 cup wheat rawa requires 2 1\/2 cups of water to cook. For a more gooey upma, add another half a cup of water.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/08\/wheat_rava_upma1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/wheat_rava_upma1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/wheat_rava_upma1-300x300.jpg","main-ingredient":["wheat rava"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Breakfast Recipes","Indian Vegetarian Recipes","South Indian Recipes"],"tags":["godhuma_rava","upma"]}