{"id":89,"permalink":"http:\/\/www.sailusfood.com\/2006\/02\/05\/drumstick-shrimp-curry-royallu-munaga-kaaya-kura\/","title":"Drumstick Shrimp Curry - Royallu Munaga Kaaya Kura","content":"Drumsticks or Munaga Kaaya are one of my favourite vegetables and I use them liberally in my everyday cooking be it to make a pickle,mixed vegetable curry or with shrimps,or add them to my favorite sambar(lentil based stew),thiyal or avial.I will be writing more about 'The Moringa Miracle Tree' for the Weekend Herb Blogging event after I post this recipe and you can read more about this remarkable discovery which can make a tremendous difference to one's health and how each and every part of the tree benefits mankind.\r\n\r\nThe flavour of the cooked succulent interior of the drumsticks with the seeds is sweet and we use our teeth to scrap away the soft center and discard the outer hard skin.I love to chew upon the outer skin before I discard it..:).The outer skin is scrapped and the drumsticks are cut into finger length pieces (as show in the picture) and then used in our cooking.Today I am sharing with you a curry dish using drumsticks and shrimps(prawns).\r\nDrumstick Shrimp Curry(Royallu Munaga Kaaya Kura)\r\nIngredients:2 drumsticks (peel outer skin and cut into finger length pieces and stir fry them for 3-4 mintes in a vessel adding a 1 tsp of oil)\r\n500 gms of shrimps or prawns (shelled and deveined)\r\n2 big onions finely chopped\r\n1 tsp ginger garlic paste\r\n4 green chillis slit length wise\r\n1 tsp red chilli pwd\r\n1 tsp coriander pwd\r\n1\/2 tsp cumin pwd\r\n1\/4 tsp turmeric pwd\r\ngaram masala (pound 1 green cardamom,1\" cinnamon stick and 3 cloves)\r\n2 tomatoes finely chopped\r\n1 tbsp coconut paste(optional)\r\nsalt\r\noil\r\n1 tbsp chopped fresh coriander for garnish\r\n\r\nHeat 3 tbsp oil in a vessel and add the chopped onions and green chillis and fry till transparent.Add the ginger garlic paste and fry till oil seperates.\r\nAdd all the powders and mix well.Add the tomatoes and stir fried drumstick pieces and cook further for another 3-4 minutes.\r\nAdd the prawns and stir well till its well coated with the masala.Let it cook for 2 minutes and then add the coconut paste and salt and add 1 cup of water.\r\nCook covered for 5 minutes till you get the desired curry consistency.Turn off heat.\r\nGarnish with chopped coriander leaves and serve hot with steamed rice or rotis.\r\n\r\nFood,Food Blogs,Indian Recipes,Andhra Recipes,South Indian Cooking, Flickr","main-ingredient":["prawns"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Curry Recipes","Indian Non-Vegetarian Recipes","Indian Seafood Recipes"]}