{"id":904,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/04\/palakura-bobbarlu-vadalu-spinach-black-eyed-peas-fritters\/","title":"Palakura Bobbarlu Vadalu - Spinach Black-eyed Peas Fritters","content":"\r\n\r\nI was craving something deep-fried last evening but stopped myself from preparing anything at that moment. So, I soaked some alasandalu (lobia\/black-eyed peas\/bobbarlu) this morning to make some fritters with our evening tea. \r\n\r\nAbsolutely crunchy on the outside and soft and chewy in the middle, these fritters have a wonderful mouth-feel and are an anytime treat when you crave for something warm and crispy. Works great as an appetizer, finger food or an evening snack to go with tea. Easy recipe and adaptable to many variations, I added chopped spinach to the coarsely ground lobia for added flavor and we enjoyed these green-speckled, deep-fried indulgence over a cup of masala chai.\r\n\r\nPalakura Bobbarlu Vadalu Recipe\r\nPrep & Cooking: 30 mts, soaking: 6-8 hours\r\nMakes approx 30 vadas\/fritters\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup bobbarlu, soaked in water for 6-8 hrs and drained\r\n\r\n1 cup chopped spinach\/palakura\r\n\r\n1 large finely chopped onion\r\n\r\n3-4 green chillis finely chopped\r\n\r\n2\" ginger finely minced\r\n\r\n1 tsp cumin seeds \r\n\r\n2 tbsps coriander leaves finely chopped\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n\r\n\r\n1 Grind the soaked and drained black eyed peas to a coarse paste adding about 1-2 tbsps of water. Add the chopped onions, chopped spinach, green chillis, ginger, coriander leaves, cumin seeds and salt and mix well.\r\n2 Take some of this mixture to form a lemon sized ball. Flatten it on your palm to make a patti shape. Prepare patties with the rest of the mixture.\r\n3 Heat oil for deep frying. Once its hot, reduce flame to medium and place these patties in the oil and fry them to a golden brown color.\r\n4Serve hot with tomato sauce or any chutney of your choice. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/bobbarlu_vada.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bobbarlu_vada-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/bobbarlu_vada-300x300.jpg","main-ingredient":["spinach","black eyed peas"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Green Leafy Vegetables","Indian Dal Recipes","Indian Snacks and Starter Recipes"],"tags":["features"]}