{"id":91,"permalink":"http:\/\/www.sailusfood.com\/2006\/02\/07\/arf-6-bisi-bele-bath-rice-lentils-cooked-with-vegetables-and-spices\/","title":"ARF #6- Bisi Bele Bath - Rice &amp; Lentils Cooked With Vegetables and Spices","content":"\r\n\r\nBisi (means hot) Bele (means lentils) Bath (means sauce mixed with rice) is a Karnataka (S.India) speciality rice dish.Don't get carried away by the simple looks of this dish..:) because the preparation of the masalas which bring out the aromatic tangy-spicy flavour of this rich dish is an extravagant and tedious affair.Besides this rich dish,I also prepared Curd rice or Daddojanum (as we Andhras call it) or Thayir sadam (as called in Tamil Nadu) which is generally eaten towards the end of the meal because it has a calm,soothing effect after eating spicy food.\r\nRice is our staple and also reigns high among my favourite foods and I enjoy making exotic rice dishes for our weekend rendezvous,a change from the monotony of steamed white rice fare..:).Some of the rice dishes I prepared earlier are  lemon rice,tamarind rice, sprouts fried rice, andhra pulao(mixed vegetable rice), jeera rice  (cumin rice) and coriander rice ..well my kind of warm comforting rice dishes..:).Bisi Bele Bath ,a wholesome traditional meal of the Kannada people, requires slow cooking of yellow lentils, rice and vegetables with aromatic spices.This rice dish is infused with carbohydrates(rice),proteins(lentils),antioxidants and vital nutrients (vegetables like onions,peas,beans,carrots,potatoes) and as an astringent, tamarind aids digestion. I thought it would fit the Antioxidant Rich Foods category and would make an apt entry for ARF # 6 Tuesday.\r\n\r\nIngredients:\r\n\r\n1 cup long-grained rice (cook the rice till soft and mushy)\r\n1 small cup tur dal (Red gram)(cook the dal till soft and well cooked)\r\n2 cups mixed vegetables cubed(carrots, beans, potatoes, peas)\r\n1 cup tamarind juice (soak lemon sized ball of tamarind in 1 cup of warm water for 20 minutes and extract the juice)\r\n2 onions finely sliced\r\nsalt to taste\r\n1 tbsp oil\r\n1 tbsp ghee\r\n1 tbsp grated coconut\r\n\r\nMasala:\r\n1 tbsp ghee (clarified butter)\r\n1 tbsp coriander seeds\r\n1\/2 tsp cumin seeds\r\n5 dry red chillies\r\n1 tbsp raw rice\r\n1\/2 tsp urad dal (black gram dal)\r\n1\/2 tsp channa dal (bengal gram dal)\r\n3\/4 tsp aniseed\/fennel seeds(saunf)\r\n1\" stick cinnamon\r\n2 green cardamoms\r\n4 cloves\r\n6 marathi moggu (Tokamiriyalu,Badi Laung)\r\n5 peppercorns\r\n1\/4 tsp turmeric powder(haldi,pasupu)\r\n10 curry leaves\r\n1\/2 tsp mustard seeds\r\n1 tbsp grated fresh coconut(you can use dessicated coconut)\r\n1\/4 tsp asafoetida (hing,inguva)\r\nHeat 1 tbsp ghee in a vessel and add all the above spices except asafoetida and fry them on low heat for 2 mts stirring constantly.\r\nAdd asafoetida just before you remove the spices off the heat.Cool and make a coarse powder of the spices.\r\n\r\nHeat 1 tbsp oil and 1 tbsp ghee in a vessel and fry the onions till transparent and then add the vegetables,salt and pinch of sugar and cook them under steam till almost cooked or 3\/4th cooked.\r\nNow add the cooked rice and dal and mix well.\r\nAdd tamarind extract,2 tsps of the ground masala pwd,salt and grated coconut and mix thoroughly.Let it sit covered for 40-45 minutes on low heat so that the masalas and flavours are well absorbed.\r\nAdd 3 cups of water and mix well and pressure cook for 3 minutes or one whistle.If you dont have a pressure cooker,cover with a lid and cook on low flame.\r\nGenerally the consistency of the rice is like a thick dosa batter.I like mine to be a little watery so I add a little more water than required..its matter of choice actually.If you like to have the rice thick reduce the water quantity to 2 cups.\r\n\r\nServe hot with melted ghee,papadam and pickle of your choice.More the ghee more the taste..forget the calories and relish this dish.Overwhelmed by the blend & flavor of aromatic spices anyone will devour Bisi Bele Bath in moments and thats not an exaggeration..:)\r\n\r\nCurd Rice\r\nIngredients:\r\n\r\n1 cup raw rice (cook rice till very soft and mushy and cool it)\r\n3 cups fresh curd (yogurt)\r\n1\/4 cup milk\r\n2 green chillies slit length wise\r\n2\" ginger piece finely grated\r\n\r\nTempering:\r\n1 tsp oil\r\n1\/2 tsp mustard\r\n2 dry red chillis\r\n8 curry leaves\r\n1\/4 tsp asafoetida\r\nsalt to taste\r\nchopped coriander leaves for garnish\r\n\r\nMix the yogurt to the cooled cooked rice and all the ingredients except the tempering ingredients.Mix well.\r\nHeat oil in a pan and add mustard seeds and let them splutter.Now add the red chillies,curry leaves and asafoetida and immediately add to the curd rice. Stir and mix again.Adjust salt.\r\n\r\nNote:If you eat the curd rice immediately on preparing it then there is no need for milk.But if you have prepared the curd rice well in advance, then add 1\/4 cup milk to the curd rice 10 minutes before serving so that it doesnt taste sour.You can garnish with finely chopped onions and fruits of your choice like pomegrante or grapes.Its again individual choice.\r\nFood,Food Blogs,Indian Recipes,South Indian Cooking, Flickr","main-ingredient":["rice","tur dal"],"author":null,"type":"post","categories":["All Recipes","Indian Dal Recipes","Indian Rice recipes","Indian Vegetarian Recipes","Recipes Vegetable Dishes","South Indian Recipes"]}