{"id":913,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/10\/kobbari-senagapappu-kura-coconut-chana-dal-stir-fry\/","title":"Kobbari Senagapappu Kura - Coconut Chana dal Stir-fry","content":"\r\nCooking a dal dish atleast 4-5 times a week for lunch is a normal routine but on days when tur dal (usually with greens\/tomato) is not cooked, its a dry saute dish like today's recipe which calls for bengal gram and coconut. The thing to take care in this recipe is to not let the chana dal overcook, it should hold shape and soft on bite. Garlic adds another layer of taste and is crucial along with fresh grated coconut. Sweet, spicy, flavorful dry saute that absorbs the tempering beautifully and goes well with rice and rasam. \r\n\r\n\r\nKobbari Senaga Pappu Kura Recipe\r\nPrep & Cooking: 30 mts\r\nServes 4-5 persons\r\nAndhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 small cup chana dal\/senaga pappu\r\n\r\n2-3 tbsps grated fresh coconut\r\n\r\n1 onion, finely chopped\r\n\r\n2 green chillis\r\n\r\n1 carrot or few beans (diced and par-boiled) - optional\r\n\r\n1\/2 tbsp oil\r\n\r\nFor seasoning\/popu\/tadka:\r\n\r\n1 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1\/2 tsp split gram dal\r\n\r\n4-5 garlic cloves, crushed\r\n\r\n2 dry red chillis, tear and de-seed\r\n\r\nfew fresh curry leaves\r\n\r\n\r\n\r\n1 Pressure cook the dal till it turns soft but not mushy. Par boil the beans or carrots and keep aside.\r\n2 Heat oil in a cooking vessel, add the mustard seeds and let them splutter, followed by the urad dal and cumin seeds, let the dal and cumin change color. Add the curry leaves, dry red chillis, garlic and stir fry for a few seconds.\r\n3 Add the green chillis and chopped onons and saute till the onions  turn transparent. (At this stage add the carrots or beans and stir fry for 3-4 mts.) If not using vegetables, add the cooked chana dal once the onions turn transparent.\r\n4 Add the cooked dal and salt and combine well and let it simmer for 2-3 mts. Add the grated coconut and stir fry for 4-5 mts.\r\n5 Serve with rice and rasam.\r\n\r\nNote Vegetables like carrots and beans are optional and can be slightly par-boiled and added.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/carrot_senaga_pappu_kura.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/carrot_senaga_pappu_kura-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/carrot_senaga_pappu_kura-300x300.jpg","main-ingredient":["coconut","chana dal"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Dal Recipes","Indian Fry Recipes","Indian Lentil Recipes","Indian Vegetarian Recipes"],"tags":["coconut","stir_fry"]}