{"id":919,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/31\/beerakaya-kothimira-pachadi-ridge-gourd-coriander-chutney\/","title":"Beerakaya Kothimira Pachadi - Ridge gourd Coriander Chutney","content":"This pachadi is pure vegetarian food sans the onion-garlic twosome. Saatvik khana - fresh, healthy and light. Ridge gourd is a vegetable that is vata pacifying according to ayurveda and one of my favorites. I am always looking for recipes of sweet-flavored ridge-gourd, known as beerakai in Telugu, peerkangai in Tamil and torai\/dodka in Hindi\/Marathi. \r\n\r\nI first tasted this pachadi at my friend's home and enjoyed it very much and its been a regular at our home ever since. It was definitely a new take on a familiar and abundantly available vegetable. The addition of sesame seeds, coriander leaves and lemon juice makes it slightly special with a unique flavor and adds a nutritional punch. The advantage of using lentils and sesame seeds in the preparation of this pacchadi is, it gives a thick texture (as ridge gourd tends to be watery) and also a richer and fuller taste. The inclusion of fresh coriander leaves not only gave a herby flavor but also worked wonders in transforming the pale shade of ridge gourd into a vibrant green shade. Serve with white rice and you have a vegan meal. Left over pachadi works great as a spread over toasted brown bread. \r\n\r\nBeerakaya Kothimira Pachadi Recipe\r\nPrep & Cooking: 20 mts\r\nServes 4-5 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n2 medium sized ridge gourds, washed and chopped into pieces with skin \r\n\r\n1\/2 cup chopped coriander leaves\r\n\r\n3 green chillis, chop into big pieces (adjust)\r\n\r\n1 tbsp bengal gram\/senaga pappu\/chana dal\r\n\r\n1 tsp split gram dal\/minappa pappu\r\n\r\n1\/4 tsp cumin seeds\r\n\r\n1\/2 tbsp sesame seeds\/nuvullu\/til\r\n\r\n1 1\/2 tbsps lemon juice\r\n\r\n2-3 tsps oil\r\n\r\nFor seasoning\/poppu\/tadka:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\npinch cumin seeds (optional)\r\n\r\n1-2 dry red chillis\r\n\r\nbig pinch asafoetida\/inguva\/hing (optional)\r\n\r\nfew fresh curry leaves\r\n\r\n1\/2 tsp oil\r\n\r\n\r\n\r\n1 Heat a tsp of oil in a cooking vessel, add bengal gram, split gram dal, cumin seeds and stir fry for a few seconds till the dals turn red. Remove and keep aside.\r\n2In the same vessel, add sesame seeds and fry on medium heat for 2-3 mts. Remove and keep aside. \r\n3In the same vessel, add the green chillis and coriander leaves and fry on medium heat for 3 mts, stirring constantly. Remove from pan and cool.\r\n4 In the same pan, add another tsp of oil, add the chopped ridge gourd pieces and stir fry for 4-5 mts till the rawness of the vegetable goes. Remove and cool. \r\n5 Once cool, grind the dals first till coarsely ground, add the rest of the sauteed ingredients along with lemon juice and salt and grind to a coarse paste. \r\n6 Heat a tsp of oil in a pan, add mustard seeds and let them pop, add curry leaves and dry red chillis followed by asafoetida and stir fry for a few seconds. \r\n7 Pour the seasoning over the ground pachadi and serve with hot rice.\r\n\r\n\r\nAdditional reading:\r\n\r\nWhat is Vata dosha?\r\nVata pacifying diet\r\nVata food choices","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/beerakai_kothimira_pachadi.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/beerakai_kothimira_pachadi-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/beerakai_kothimira_pachadi-300x300.jpg","main-ingredient":["ridge gourd"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes","Recipes Vegetable Dishes"],"tags":["vata_diet","vegan"]}