{"id":926,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/17\/kobbari-pachadi-coconut-chutney\/","title":"Kobbari Pachadi - Coconut Chutney","content":"When starting out to cook on my own, one of the first recipes I learnt was, Kobbari Pachadi. I am not talking about the regular coconut chutney that goes with our South Indian breakfast fare. What I'm talking about is a coconut pachadi that is prepared only to be eaten with rice during meal times. Its preparation involves red and green chillis, cumin, bengal gram, tamarind and fresh coconut. Very simple recipe that you can hardly go wrong with. Its all in the texture of the pachadi which should be coarsely gound and not into a smooth paste. You should be able to bite into toasted bits of the spices and dals which gives a nice mouth-feel. Of course, not to mention the magic touch of curry leaves-mustard seeds seasoning. A delicious pachadi to go with rice. \r\n\r\n\r\n\r\nKobbari Pachadi Recipe\r\nPreparation: 15-18 mts\r\nServes 3-4 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup of freshly grated coconut \r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1 tsp split gram dal\/minappa pappu\/urad dal\r\n\r\n1 tbsps chana dal\/senaga pappu\/bengal gram\r\n\r\n2 dry red chillis, tear and de-seed\r\n\r\n2 green chillis, cut each into two\r\n\r\n4 garlic flakes\r\n\r\ngooseberry sized tamarind\r\n\r\n2-3 tsps oil\r\n\r\nsalt to taste\r\n\r\n1\/2 tsp sugar (optional)\r\n\r\nFor popu\/tadka\/seasoning:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1 tsp split gram dal\/minappa pappu\r\n\r\n14 -15 curry leaves\r\n\r\n1\/2 tsp oil\r\n\r\n\r\n\r\n1 Heat oil in a pan. Add cumin and toast them for a few seconds, add the dals and let them turn red. Next add the garlic, red chillis and green chillis and fry them for half a minute on low heat. Lastly add the coconut pieces (or grated) and stir fry for a minute. Remove from pan and cool.\r\n2 Once cool, grind the toasted ingredients, tamarind, salt and sugar to a slightly coarse paste by adding very little water (few tbsps). You shouldn't make it into a smooth paste. A stone mortar is recommended to crush them but you can use a blender too. \r\n3 Heat oil in a small pan. Add the mustard seeds and let them pop. Add the split black gram and let it brown. Add the curry leaves and toss them for a few seconds till the flavors come out.\r\n4 Turn off heat and add the seasoning to the ground kobbari pachadi and combine.\r\n5 Serve with hot steamed rice and ghee. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/kobbari_chutney.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kobbari_chutney-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/kobbari_chutney-300x300.jpg","main-ingredient":["coconut"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Chutney Recipes - Pachadi","Indian Vegetarian Recipes"],"tags":["coconut","pachadi"]}