{"id":927,"permalink":"http:\/\/www.sailusfood.com\/2008\/06\/27\/basic-white-bread\/","title":"Basic White Bread","content":"There is joy in bread making. I'm a beginner in bread making and its only recently that I have discovered the wonderful joys of baking fresh bread at home. My friendly neighborhood baker has been kind enough to teach me the nuances of baking bread as well as providing me with fresh yeast on demand. How lucky am I?!-:) There's nothing to beat the wonderful aroma of baking bread and savoring the taste of fresh, warm bread with a generous amount of homemade butter. \r\n\r\nBread making is not as difficult as I imagined it to be. It does take practice, good yeast and a lot of kneading to achieve a reasonably good loaf of bread. I'm satisfied at the outcome of my second attempt at bread making but definitely need to improve and work on my bread making skills to produce that perfectly risen loaf with a perfect crumb and crust.\r\n\r\n\r\n\r\n\r\n\r\n\r\nPreparation time: 20 mts\r\nRising of dough: 1 1\/2 - 2 hrs\r\nBaking: 1\/2 hr\r\n\r\nIngredients for White Bread Recipe:\r\n\r\n1 kg all-purpose flour\r\n2 tbsps (20 gms) fresh yeast\r\n1 1\/2 tbsps granulated sugar\r\n1 tbsp olive oil\r\n1 tsp salt\r\n1 cup lukewarm milk (as warm as a baby's milk bottle)\r\n1 3\/4 - 2 cups lukewarm water (approx)\r\nwater for brushing\r\nmelted butter for greasing and brushing\r\n\r\nPlace the all-purpose flour and salt on a flat work surface and combine. Make a well in the center. Add luke warm milk, sugar and fresh yeast and leave it for a few minutes for the yeast to prove. Use your fingers to bring the dough together. From the inside of the well, slowly bring in the flour to combine with the wet ingredients. Add the olive oil and continue to bring in the dry flour till you reach the outer edge of the flour well adding lukewarm water as required. \r\n\r\nKnead the dough using the heel of your hand to push the dough away from you and lift it and fold over towards you. Turn the dough into a quarter turn and repeat. Continue to knead this way. This is very therapeutic and believe me you will begin to feel a sense of calm and inner peace. Knead for 10 minutes or until smooth and springy.\r\n\r\nShape the dough into a ball. Grease a large bowl with the melted butter. Place the dough in the bowl and turn it over so that it coats the dough surface as well (will help the dough from drying as it sits). Cover the bowl with plastic wrap and place it in a warm area of your kitchen to allow the dough to rise to double its size. It should take about 45 mts to 1 hr 15mts for the dough to rise. The dough took over an hour to rise. You know the dough is ready when it leaves a finger imprint when lightly pressed.\r\n\r\nNow punch down in the centre of the risen dough with your fist. This \"punching\" down the dough, releases excess carbon dioxide produced by the yeast during the rising process and we don't end up with a yeasty flavored bread. Place the dough on a lightly floured surface and knead again for 2-3 minutes or until smooth and elastic and returns to its original size. Let it rest to rise again until almost double for about another 30 minutes. \r\n\r\nPreheat oven to 375Â°F. Grease a loaf pan and keep aside. Use a knife to cut a quarter part of the dough and shape each into a smooth round. Shape the dough into an rectangular shaped long roll and place in the greased loaf pan. Brush lightly with the melted butter. Place the loaf pan in a warm place  for 30 mts or until the dough has risen slightly above the top of the pan. Gently brush the loaf with a little water or egg white and bake in the preheated oven for 30 minutes or until it reaches a golden color and cooked. When you tap the base of the pan it should sound hollow (it means the bread is done). \r\n\r\n\r\n\r\nImmediately turn the loaf onto a wire rack and cool. Once cool, store the loaf at room temperature. This bread is best eaten on the day it is made. However, it tastes equally good after 1-2 days of baking. \r\n\r\n\r\n Note: Yeast ferments and grows when combined with flour, sugar and warm milk. Carbon dioxide is produced and trapped in the dough as tiny air bubbles which make the bread rise during cooking and gives its texture. Salt adds flavor. Kneading distributes the yeast evenly through the dough, develops and strengthens the gluten in the flour. \r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/homemade-bread.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/homemade-bread-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/homemade-bread-300x300.jpg","main-ingredient":["flour"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Easy Pasta Recipes","Flour Recipes"],"tags":["features","white_bread"]}