{"id":94,"permalink":"http:\/\/www.sailusfood.com\/2006\/02\/14\/recipes-galore-savour-the-taste-of-fellow-bloggers-food\/","title":"Recipes Galore! Savour the taste of fellow bloggers food","content":"\r\n\r\nI am learning so much about different kinds of foods, recipes, different cultures and people from across the globe by reading some amazing food blogs and I must say that its time well spent and each day I always look forward to learning something new which keeps me challenged and inspired. The single common factor binding us all together in this blogosphere is love for cooking. \r\n\r\nThis past week I tried out some recipes from the kitchens of fellow food bloggers and must thank them for sharing some great food recipes. Last night I baked a simple basic chocolate cake with chocolate icing on the occasion of Valentine's Day, the recipe of which I got from Saba's Meating Point and it was all over this evening, thanks to my toddler and friends. But I did manage to take a picture of it before it was devoured. Thanks Saba for an easy-to-make yet tasty chocolate cake.\r\n\r\n\r\n\r\nAn egg curry I tried was Eggs in Spicy Onion Sauce which Tina of Tina's Cooking shares with us. Its basically a recipe from a cookbook by Maya Kaimal. I didnt make any changes to the recipe and made it exactly the way Tina presented it. Though she didn't mention which region of India this curry originated from, certainly this looked like a Kerala traditional curry preparation with an exotic blend of spices like fennel, cloves, cinnamom, cardamom and black pepper and coconut milk. An absolutely tasty dish which goes great with white rice and rotis. Thanks Tina for sharing this recipe.\r\n\r\n\r\n\r\nLove rice and a great rice dish I tried over the weekend was Paneer Pilaf from Nupur's kitchen.This is an authentic North Indian recipe with the use of garam masala (cloves, cinnamom, cardamom)and kasoori methi (dried fenugreek leaves). This dish is versatile in the fact that you can play around with the spices and add some veggies along with the paneer and rice to whip up an absolutely healthy, tasty and wholesome meal by itself.\r\n\r\nTo accompany the pilaf I made Tomato Kurma from Kay's Kitchen (it's her mother's recipe) and must say this curry blend is versatile and would taste great with any vegetable, with or without tomatoes. A great tasting Kurma recipe and goes great with dosas and flavoured rice. Thanks Nupur and Kay for sharing your recipes.\r\n\r\n\r\n\r\nIts Tuesday and its time for ARF\/5-A-Day  and my entry for this week is Cardamom Tea or Elachi Chai, an antioxidant rich tea.\r\n\r\n\r\n\r\nWanna join to have some fun this Thrusday as its the Cheese Sandwich Day in our food blogosphere. Also check out this blog which is dedicated to The Cheese Sandwich.\r\n\r\nAnd Happy Valentine's  Day! :)\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2006\/02\/egg-onion-sauce.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-onion-sauce-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/egg-onion-sauce-300x300.jpg","author":null,"type":"post","categories":["All Recipes","Indian Curry Recipes","Indian Egg Recipes","Indian Milk Recipes","Indian Rice recipes","Sweet Dessert Recipes"],"tags":["recipes"]}