{"id":940,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/19\/thotakoora-chauli-vepudu-amaranth-leaves-stir-fry\/","title":"Thotakoora (Chauli) Vepudu - Amaranth leaves stir fry","content":"\r\n\r\nNehal is always complaining that I cook greens every day and its always a challenge to get him to enjoy the flavor of greens in any form. Amaranth leaves are available almost all year round in our parts and its a very regular green at our home. There are quite a few varieties that we make with these greens, one of them, in combination with lentils (pesara pappu\/moong) and another, a tangy stew (pulusu). Vepudu or stir fry or poriyal is another wonderful way to eat these nutritious greens. Today's recipe, a low-fat, healthy stir fry made from Thota kura aka Amaranth leaves\/Chinese spinach was thoroughly relished by both father-son duo.\r\n\r\n\r\n\r\nThotakoora Vepudu Recipe\r\nPrep & Cooking: 30 mts\r\nServes: 3-4\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n4 big bunches fresh amaranth leaves (picked, use tender stalks) chopped\r\n\r\n1 onion, finely chopped (optional)\r\n\r\nbig pinch turmeric pwd\r\n\r\nsalt to taste\r\n\r\n2-3 tsps oil\r\n\r\nMake a coarse paste:\r\n\r\n2 tbsp coriander leaves\r\n\r\n2 green chillis\r\n\r\n1 tbsp coconut (optional)\r\n\r\nFor popu\/tadka\/seasoning:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1\/2 tsp cumin seeds\r\n\r\n1 tsp split gram dal\r\n\r\n1 dry red chillis de-seeded\r\n\r\n1 sprig curry leaves\r\n\r\npinch of asafoetida\/hing\r\n\r\n\r\n1 Boil the chopped amaranth leaves in just enough water (half a cup of water, approx) for 8-10 mts. Drain the left over water and use it to prepare chapati dough. \r\n2 Heat oil, add the mustard seeds and once they splutter, add the cumin seeds, split gram dal, red chillis, curry leaves and saute for half a minute. Add asafoetida and stir for 2-3 seconds.\r\n3 Add the onions and saute till transparent. Add salt and turmeric pwd and saute further for a minute. Add the ground paste and stir fry for 5-6 mts.\r\n4 Add the boiled amaranth leaves and saute for 12-15 mts (without lid) or till done. Serve hot with rice.\r\n\r\nNote: Another option is to soak 1 tbsp yellow moong dal for a few mts and drain and grind it along with green chillis and coriander leaves.\r\nInfo on Amaranth greens - very good source of vitamins including vitamin A, vitamin B6, vitamin C, riboflavin, folate, dietary minerals including calcium, iron, magnesium, phosphorus, potassium, zinc, copper and manganese. More info on the nutritional values of amaranth leaves - cooked, boiled and drained. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/thotakura_chauli_mulai_keerai.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/thotakura_chauli_mulai_keerai-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/thotakura_chauli_mulai_keerai-300x300.jpg","main-ingredient":["amaranth leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Green Leafy Vegetables","Indian Fry Recipes","Indian Vegetarian Recipes"],"tags":["amaranth_leaves","thotakura"]}