{"id":944,"permalink":"http:\/\/www.sailusfood.com\/2008\/03\/25\/mamsam-pulusu-mutton-curry\/","title":"Mamsam Pulusu - Mutton Curry","content":"\r\nIf you want to experience the 'kaaram' (spicy hot) ruchi that Andhra food is known for, then you should taste the non-vegetarian fare which is sure to get taste buds tingling and set your tongue on fire. The fiery hot flavor is there and not in the vegetarian food which is definitely not spicy rather 'mildly spiced'. \r\n\r\nA most sought after meat dish for the carnivores in Andhra is Mamsam (mutton) pulusu, a traditional Andhra meat curry. A very simple recipe with very few basic ingredients. The meat pieces are cooked in a ginger-garlic-green chilli-onion base, spiced with only red chilli powder and then simmered in tamarind, the most important ingredient, that exquisitely enhances the flavor and takes it to another level. The appetizing aroma as the mutton pieces simmer in the flavorful alliance of spice and tamarind is simply irresistable and addictive. This classic all-time favorite Indian meat recipe is a perfect accompaniment to rice.\r\n\r\n\r\nMamsam Pulusu Recipe\r\nPreparation: 40 mts\r\nServes 5-6 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 kg mutton, washed and drained\r\n\r\n1\/4 tsp turmeric pwd\r\n\r\n3\/4 tbsp red chilli pwd (adjust)\r\n\r\nlarge lemon sized tamarind, extract pulp \r\n\r\nsalt to taste\r\n\r\n1 1\/2 tbsps oil\r\n\r\nMake a coarse paste:\r\n\r\n3 medium sized onions\r\n\r\n3 green chillis\r\n\r\n10-12 garlic flakes\r\n\r\n1 1\/2\" ginger piece\r\n\r\n\r\n\r\n1 Heat oil in a heavy bottomed vessel. Add the ground onion paste and stir fry for 5-6 mts. Add the washed mutton pieces and combine well. Cook for 8-10 mts or till oil seperates.  \r\n2 Add turmeric pwd and chilli pwd, combine. Cook for 2 mts. Add 2 cups water and salt and cook till the meat is three-fourth cooked. (you can use a pressure cooker)\r\n3 Add the extracted tamarind pulp, along with a cup of water and combine well. Let the mutton pieces simmer in this tamarind base for 20-25 mts or till the meat is cooked and you get the desired gravy consistency.\r\n4 Adjust salt. Garnish with coriander leaves.\r\n6  Serve hot with white rice.\r\n\r\nNote: Note: The cooking time will depend on the quality of mutton used. If its tough meat, it takes longer to cook. Adjust spice to suit your palate. The consistency of gravy should be more like a kurma gravy consistency.","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/mamsam_pulusu.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mamsam_pulusu-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/mamsam_pulusu-300x300.jpg","main-ingredient":["mutton"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Meat Recipes","Indian Non-Vegetarian Recipes"],"tags":["features","mutton"]}