{"id":948,"permalink":"http:\/\/www.sailusfood.com\/2008\/04\/23\/chocolate-brownies\/","title":"Chocolate Brownies","content":"Who can resist chocolate and a brownie at that.:) I first tasted brownies a few years ago at a friends home whose mother used to run a home-based bakery business. I could never resist brownies, the fudgy kind, which can be terribly addictive especially over a cup of coffee. I've never tried preparing them at home till recently when I ate a warm piece of chocolate fudge brownie at Cafe Day. I wanted to re-create the same at home and decided on this recipe (from allrecipes) for homemade chocolate brownies and its a winner. A basic easy chocolate brownie recipe where nuts are optional and so is the frosting. I like brownies without nuts, just plain simple chocolatey flavor, chewy and with a bit of fudge. \r\n\r\n\r\n\r\n\r\nChocolate Brownies Recipe\r\nPreparation: 10 mts, Baking: 30 mts\r\nRecipe Source: Allrecipes\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1\/2 cup butter\r\n\r\n1 cup brown sugar\r\n\r\n2 eggs\r\n\r\n1 teaspoon vanilla extract\r\n\r\n1\/3 cup unsweetened cocoa powder\r\n\r\n1\/2 cup all-purpose flour\r\n\r\npinch of salt\r\n\r\n1\/4 tsp baking powder   \r\n \r\n\r\n\r\n1 Preheat oven to 175 degrees C. Grease and flour an 8 inch square pan and line with butter paper.\r\n2 Place a medium heatproof bowl over a pan of simmering water. Place butter in the bowl and let it melt. Remove the bowl from the simmering water and stir in the sugar. It will appear grainy at this point.\r\n3Whisk in eggs, one after the other and add the vanilla essence before adding the flour. Mix in cocoa, flour, salt and baking powder until no trace of flour is left, using a wooden spoon. Spread batter into prepared pan.\r\n4 Bake in preheated oven for 30 minutes. Do not overcook. When you find that the edges have gone slightly dry and the top is cracked, you know its cooked. \r\n5 Cool on a wire rack. Cut into squares at room temperature and top with walnut (I sprinkled some brown sugar on top). Store in an airtight container.\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/rich_chocolate_brownies.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rich_chocolate_brownies-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rich_chocolate_brownies-300x300.jpg","main-ingredient":["chocolate","flour"],"author":null,"type":"post","categories":["All Recipes","Cake Recipes","Flour Recipes"],"tags":["chocolate_brownie","features"]}