{"id":9564,"permalink":"http:\/\/www.sailusfood.com\/2010\/06\/23\/flax-seeds-curry-leaf-karam-podi\/","title":"Flax Seeds Curry Leaf Karam Podi","content":"Masala Dosa with Flax Seeds Curry Leaf Karam Podi\r\n\r\n\r\nOne of nature's best health food which is a valuable source of omega 3 and dietary fiber is flax seed. Known for its nutritional benefits, which include lowering of cholesterol, protection against cancer and regulating of blood pressure, there is a growing popularity of flax seeds among the health conscious. I try to incorporate flax seeds into my family's diet on a regular basis and relish it in a South Indian style avatar, Podi. Makes for a delectable podi with idli, dosa, or with rice and a dollop of ghee.\r\n\r\nFlax Seeds go by the name Avise Ginjalu or Aviselu in Telugu and Alsi  in Hindi. They are available at Fab India outlets and Nilgiris stores.\r\n\r\n\r\nFlax Seeds Curry Leaves Karam Podi Recipe\r\nPreparation: 20-30 minutes\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n\r\n2 tsps oil\/ghee for roasting \r\n\r\n1\/2 cup flax seeds\r\n\r\n1 cup packed curry leaves, washed and dried\r\n\r\n1\/2 cup bengal gram dal\/senaga pappu\r\n\r\n2 tbsps cup black gram dal\/minappapu\r\n\r\n1 tbsp coriander seeds\/dhaniyalu\/dhania\r\n\r\n1 tsp cumin seeds\/jeera\/jeelakara\r\n\r\n8-10 dried red chillies, tear into two and de-seed (adjust to suit your spice level)\r\n\r\n8 garlic cloves OR 1\/4 tsp asafoetida\r\n\r\nsalt to taste\r\n\r\n\r\n\r\n1 Drizzle oil in a heavy bottomed vessel and roast the channa dal on low to medium heat for 3-4 mts. Add split gram dal, coriander seeds, cumin seeds and dry red chillis to the roasting channa dal and continue to roast till the dals release their flavor and turn golden. Remove and cool.\r\n2 In the same vessel, add the flax seeds and roast on low flame till they give a crackling sound like sesame seeds. Remove and keep aside.\r\n3 In the same vessel, drizzle little oil and add the curry leaves and roast on low flame till crisp. Remove and keep aside.\r\n4 Place the cooled dals-spices mixture, curry leaves, flax seeds and salt in a blender and grind to make a coarse powder. Add the garlic towards the end and grind for a few seconds. \r\n5 Store in an air tight container and place in refrigerator. Serve with tiffins like dosas and idlis with a generous helping of ghee or oil.\r\n\r\nNote: There are many variations to this podi. One variation, add a small gooseberry sized tamarind to the above ingredients to get that tangy flavor. Add the tamarind at the time of grinding the ingredients. Another variation is to replace garlic with a little less than 1\/4 tsp asafoetida. Always grind the ingredients only after they are completely cool, otherwise they will a form a lump and you will not achieve the desired powder consistency if ground when still hot. Always store in dry air tight bottles and use a dry spoon to remove the podi. Podis are best consumed within 3-4 weeks of preparation, as they don't retain the freshness after a month or so. You can also refrigerate for a longer shelf life and freshness. \r\n\r\nFlax Seed Karam Podi","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/06\/flax-seeds-spiced-powder.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/flax-seeds-spiced-powder-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/flax-seeds-spiced-powder-300x300.jpg","style":["easy","modern","quick"],"course":["side"],"special-diet":["eggless","vegetarian","vegan","dairy free","kid friendly","pregnancy"],"cuisine":["andhra"],"cook-time":"25","prep-time":"5","main-ingredient":["flax seeds","lentils","curry leaves"],"goes-well-with":["idli","dosa","rice","cereal","pancake"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Podi Recipes"],"tags":["alsi","avise-ginjalu","curry-leaves","flax-seeds","podi"]}