{"id":961,"permalink":"http:\/\/www.sailusfood.com\/2008\/04\/02\/karivepaku-annam-spiced-curry-leaf-rice\/","title":"Karivepaku Annam - Spiced Curry Leaf Rice","content":"\r\n\r\nCurry leaves are indispensable in my kitchen, for that matter, every South Indian kitchen and you will find virtually every home growing their own karivepaku plant in their backyards. I get emails from my readers who live abroad asking if they can substitute curry leaves in a recipe as they are unable to find them in most stores. I'm afraid there is no substitute for curry leaves. Either grow the curry leaf plant in your backyard or beg, borrow, steal, if you want to savor the real flavor of recipe which calls for curry leaves.:). It not only enhances the flavor but also imparts a magical nutritional effect. \r\n\r\nIts a captivating experience each day watching the aromatic curry leaves sizzle in the hot oil alongside the tempering companions. I look forward to that enticing sensory pleasure of dropping the leaves into hot oil and watch the leaves dance, swirl and sizzle and fill the kitchen with a bewitching aroma. If I were asked, what is the most beautiful sensory culinary experience I have had in my kitchen, my answer would be 'the sizzle and aroma of curry leaves in hot oil', the promise of delicious food in the making.:)\r\n\r\nHow would I describe 'Karivepaku Annam'? A colorful, aromatic, unique savory rice dish that is nutrition-packed, mildly flavored without being overpowered by the aroma of curry leaves. Now, close your eyes and imagine the aroma!-:) \r\n\r\nA favorite at our home and prepared only with fresh curry leaves.\r\n\r\nSpiced Curry Leaves Rice Recipe\r\nPrep & Cooking: 30 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n3 cups cooked and cooled white rice (each grain should be seperate)\r\n\r\n1 1\/4 cups fresh curry leaves\r\n\r\n1 tbsp split gram dal\r\n\r\n1\/2 tbsp bengal gram\r\n\r\n8-9 black pepper corns\r\n\r\npinch of turmeric pwd\r\n\r\n2 tsps oil\r\n\r\nsalt to taste\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1 tsp oil \r\n\r\n1 tsp mustard seeds\r\n\r\npinch of asafoetida (optional)\r\n\r\n\r\n1 Heat a tsp of oil in a heavy bottomed vessel and add the dals and toss them till they turn red. Add the pepper corns and toss for a minute. Turn of heat and cool.\r\n2 In the same vessel, heat another tsp of oil and add the curry leaves and on low-medium heat, toss them constantly till they change color and turn crisp. Don't burn them. This could take about 4-5 mts. Turn off heat and cool.\r\n3 Grind the toasted dals and pepper corns to a coarse powder. Add the toasted curry leaves and grind to a coarse pwd. Remove and keep aside.\r\n4 Heat oil for tempering in the same vessel, add the mustards seeds and let them splutter. Add the asafoetida and toss for a few seconds. Turn off heat.\r\n5 Add the cooked rice to the tempering, sprinkle salt and turmeric pwd. Add the ground curry leaves-spices pwd and combine till well blended. Adjust salt.\r\n6 Serve hot with yogurt (perugu) or pachadi of your choice.\r\n\r\n\r\nGood read: Curry Leaf Heaven ~Essay by Kurma\r\nScientific Name : Murraya Koenigii, Telugu - Karivepaaku, Hindi - Kadi Patha\r\nNutritional value: one of the richest sources of micronutrients, antioxidants, vitamins (carotene, thiamine, riboflavin, niacin, folic acid & vitamin C), calcium, iron, phosphorus, protein, fat, carbohydrates, energy, soluble & insoluble fiber\r\nBenefits of curry leaves: Used as a traditional medicinal herb in Ayurveda, as vata-kapha pacifying and mildly stimulating pitta. Curry leaves are pungent and act as an appetizer and digestive stimulant. Known for its healing properties - strengthen the functions of stomach and kidneys. Also known to strength hair roots and a home remedy for pre-mature greying of hair. \r\nHelpful resources: How to grow a curry leaf plant and take care of it? (in US-cold weather)\r\nMore about this aromatic nutrition-packed herb\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/karivepaaku_annam.JPG","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/karivepaaku_annam-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/karivepaaku_annam-300x300.jpg","main-ingredient":["curry leaves"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Indian Vegetarian Recipes"],"tags":["curry_leaf","indian_vegan_recipe"]}