{"id":968,"permalink":"http:\/\/www.sailusfood.com\/2008\/07\/15\/nilava-allam-pachadi-ginger-pickle\/","title":"Nilava Allam Pachadi - Ginger Pickle","content":"Amma prepares pickles which are out of the world and today I'm blogging one of her most-relished pickle recipes using ginger. A bright, unique flavored achar, nilava allam pachadi aka ginger pickle is a perfect combination of sweet and spice. During the pickle preparation the gingery aroma that fills the kitchen is intoxicating and makes your taste buds sing.:) Prepared from fresh ginger root, dry red chillis, tamarind and jaggery, this fiery gingery pickle can spice up your meal be it with rice, rotis, dosas or idlis and works as a digestive aid too. Stays fresh for quite a while if refrigerated. \r\n\r\nnilava allam pachadi\r\nNilava Allam Pachadi Recipe\r\n\r\nRecipe Source: Amma\r\nPrep & Cooking: 30 mts\r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n100 gms ginger root, remove skin, wash, dry and slice \r\n\r\n100 gms tamarind\r\n\r\n100 gms grated jaggery or sugar\r\n\r\n5 Kashmiri red chillis (adjust to suit your spice level)\r\n\r\n1 1\/2 - 2 tbsps salt \r\n\r\na little over one-fourth cup oil\r\n\r\n1 tsp methi\/fenugreek seeds\/menthulu\r\n\r\n2 tsp coriander seeds\/dhania\/dhanyalu\r\n\r\n1 tsp cumin seeds\/jeera\/jeelakara\r\n\r\nFor tempering\/poppu\/tadka:\r\n\r\n1 tsp mustard seeds\r\n\r\n10 fresh curry leaves\r\n\r\n8-10 cloves garlic\r\n\r\n2-3 tsps oil \r\n\r\n\r\n\r\n1 Heat oil in a heavy bottomed vessel, add the sliced ginger and fry till light pink, approx 3-4 mts. Remove and cool.\r\n2 Meanwhile, add just enough hot water to the tamarind such that its immersed and let it soak such that it softens. Cool.\r\n3 In a pan, add one or two tsps oil, add methi seeds and fry till they turn slightly red, add the coriander seeds, cumin seeds and red chillis and fry for 2-3 mts. Cool, make a fine powder and keep aside.\r\n4 Once cool, grind the fried ginger slices, softened tamarind, jaggery and salt to a fine paste. Remove onto a dish and add the ground spice pwd. \r\n5 Heat 2 tsps oil in a pan, add the mustards seeds and let them crackle. Add the curry leaves and crushed garlic and fry for a few seconds. Add this to the ginger pickle and combine well. Store the pickle in an airtight container and refrigerate.\r\n\r\nginger pickle\r\n\r\nNote: Alternately, you can add store bought or pre-ground red chilli pwd (used for preparing pickles) 1 1\/2 -2 tbsps and 1 tsp methi pwd to the ground ginger mixture instead of frying the dry red chillis and methi seeds. Coriander seeds and cumin are optional ingredients. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/07\/allam_pachadi_ginger_pickle.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/allam_pachadi_ginger_pickle-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/allam_pachadi_ginger_pickle-300x300.jpg","main-ingredient":["ginger"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Indian Pickles"],"tags":["allam","ginger","pickle"]}