{"id":975,"permalink":"http:\/\/www.sailusfood.com\/2008\/04\/09\/rava-dosa-a-photo-tutorial\/","title":"Rava Dosa - A Photo Tutorial","content":"\r\n\r\nIts raining dosas in the food blogosphere, thanks to Srivalli's Dosa Mela. Not to be left behind, I'm joining in to have some fun with this entry - instant, golden, crispy, Rava Dosa, my most favorite breakfast\/tiffin item (other than Masala Dosa, of course):). My whole family are fans of dosas, all varieties. We used to have Punjabi neighbours who LOVED rava dosas like they could eat it for breakast, lunch and dinner. They would send home hot Aloo Parathas or Chole Bhature for breakfast, whenever they craved for Amma's rava dosas. Their dinner, including ours, was Rava Dosa, courtesy Amma.:)\r\n\r\nI have had innumerable emails from my visitors and readers on one question - How to make rava dosa? Here's what goes into the making of rawa dosa:\r\n \r\n2 cups semolina\/rava\r\n1\/2 cup rice flour \r\n1\/2 cup maida (all-purpose flour)\r\n1 1\/2 tsps cumin seeds\r\n1 tsp grated ginger\r\ncoriander leaves - 2 tbsps (optional)\r\ncurry leaves - few (optional)\r\nfinely chopped green chillies - 1 or 2\r\nsalt to taste\r\nwater - 6 cups (approx) \r\noil as required\r\n\r\n\r\nCombine all the above ingredients except oil and let the rava dosa batter sit for half an hour to an hour. It might thicken after a while as rava  absorbs the water. At the time of making dosas add more water such that it is of pouring consistency (like thick buttermilk). Pre-heat an iron tawa on high for a minute. Do the water test (sprinkle few drops of water over the hot tawa such that it sizzles) and reduce heat. Pour a ladle full of dosa batter from the outward base of the tawa in a circular motion (as shown in the picture below). Fill the gap in the middle with dosa batter. Don't drop batter like a thick lump but pour all over, evenly, filling the gaps. Pour 1-2 tsps of oil like drops along the edge of the dosa and the gaps in the middle.\r\n\r\nIncrease heat to medium flame and let the dosa cook for around 3 mts. At this point increase flame to high and let the dosa roast for a half a minute or so. If you want a slightly softer dosa, remove the dosa at this point.\r\n\r\nBut for a crisper dosa, let the dosa roast further on high for another one mt or till it reaches a nice golden brown stage like shown in the image below. Serve hot with chutney or sambar.\r\n\r\nIt takes practice to prepare rava dosas. You need to keep in mind a few things while making dosas. \r\n~ Prepare the batter at least an hour or half an hour before you actually want to eat the dosas. \r\n~ There is no need of fermentation for ravva dosa batter unlike masala dosa batter. Its instant. \r\n~ The batter should not be thick but of pouring consistency like a thick buttermilk consistency.\r\n~ Letting the batter sit in the refrigerator for a few hours also helps in attaining crisp dosas not that you cannot prepare crisp dosas with batter sitting for just an hour. Infact the dosas you see in this post were prepared from dosa batter that was mixed just an hour before preparation.\r\n~ Infact the most important factor in the making of ravva dosa is adjusting the heat control. An iron tawa requires higher heat as compared to non-stick pan. I have used an iron tawa and so adjust heat according to the pan you use to prepare dosas. You need to be around the stove while preparing these dosas.\r\n~ There are many variations in preparing rava dosa. You could add grated carrot and coconut to the batter along with rest of ingredients. Or add some sliced onions while the dosa is cooking. Broken cashewnut pieces can also be added to the dosa batter.\r\n~ At the time of preparing rava dosa, use the ladle to stir the dosa batter well, as the flours tend to sink to the bottom of the vessel like a thick residue. So combine well each time you pour the dosa batter over the tawa.\r\n~ You can flip the dosa and cook the other side as well but I don't usually flip the dosa. I let it cook on one side only.\r\n~ A cast-iron tawa is best or a non-stick pan (used exclusively for dosas) can be used to prepare rawa dosas. \r\n~ Don't skimp on the oil to save a few calories, as it helps the rawa dossa get crisp. (don't ever think of calories when you want to relish rava dosa):)\r\n~ The batter can be stored in the refrigerator for 2-3 days after which it will turn sour (i.e the dosas prepared from batter more than 3-4 days old).\r\n\r\n\r\nRavva dosa, coconut chutney, besan chutney and home-made tomato pickle ~ Our Breakfast\r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/rava-dosa.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava-dosa-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/rava-dosa-300x300.jpg","main-ingredient":["rice flour","maida"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Flour Recipes","How To Cook","Indian Breakfast Recipes","South Indian Recipes"],"tags":["features","rava_dosa","tiffins"]}