{"id":9779,"permalink":"http:\/\/www.sailusfood.com\/2010\/06\/19\/vaamu-aaku-bajji-ajwain-patta-fresh-carom-leaves-ke-pakode\/","title":"Vaamu Aaku Bajji ~ Ajwain Patta (Fresh Carom Leaves) ke Pakode","content":"Vaamu Aaku Bajji\r\n\r\nVizag is experiencing pleasant weather conditions with light drizzles and cool breeze. Its hard to resist the temptation of savoring hot off the stove snacks with a cup of masala chai. \r\n\r\nHandful of ingredients and a simple recipe come together into an incredibly magical monsoon snack. Placed oil in a kadai for deep frying. Went to the garden, plucked few fresh ajwain leaves aka Vaamu aakulu. Washed the leaves and left to drain. Prepared bajji batter using besan. Dipped the aromatic vaamu aakulu in besan batter and deep fried them to golden brown. While the bajjis were frying, prepared masala chai. Everything came together is less than 15 minutes.\r\n \r\nThe invigorating flavor and amazing aroma of fresh carom leaves in bajji avatar is hard to resist and you are sure to reach out for more than your fair share of bajjis. :)\r\n\r\nVaamu Aaku, Ajwain ke Patta, Indian Borage, Spanish Oregano, Carom Leaves\r\n\r\nVaamu Aaku Bajji Recipe\r\nPrep & Cooking Time: 15-20 mts \r\nCuisine: Andhra\r\n.\r\n\r\nIngredients:\r\n\r\n18-20 fresh carom leaves\/ajwain ke patta\/vaamu aakulu\r\n\r\n1 cup besan\/senaga pindi\/chickpea flour\r\n\r\n2 tsps rice flour (optional)\r\n\r\n1\/2 tsp red chilli pwd\r\n\r\npinch of asafoetida\/hing\/inguva OR 1\/4 tsp ginger garlic paste\r\n\r\n2 tsps hot oil OR pinch of soda bi carb\r\n\r\nsalt to taste\r\n\r\noil for deep frying\r\n\r\n1 Combine both the flours with salt, soda, hing, chilli pwd and oil. Add little water and mix well that it forms a smooth thick batter. Do not add too much water. \r\n2 Heat enough oil in a deep frying vessel. It should be piping hot. Dip each leaf into the besan batter such that it is well coated and place in the hot oil. Reduce heat to medium and deep fry till they turn golden brown. Use a ladle to turn them so that it cooks on both sides.\r\n3 Once they turn golden brown, remove them on to absorbent paper. Serve as evening snack over a hot cup of masala chai (spiced tea).\r\n\r\nAjwain Patta ke Pakode","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2010\/06\/vaamu-aaku-bajji.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vaamu-aaku-bajji-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/vaamu-aaku-bajji-300x300.jpg","style":["easy","modern","quick"],"course":["indian"],"special-diet":["nut free","eggless","vegetarian","vegan","dairy free","kid friendly","pregnancy"],"cook-time":"15","prep-time":"5","main-ingredient":["carom leaves","vaamu aaku","ajwain patta"],"serves":"8","goes-well-with":["tomato sauce","tea"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Indian Snacks and Starter Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes"],"tags":["bajji","carom","fritters","pakode","vaamu-aaku"]}