{"id":98,"permalink":"http:\/\/www.sailusfood.com\/2006\/02\/25\/ulli-garelu-medu-vadai-lentil-dumplings\/","title":"Ulli Garelu - Lentil Dumplings","content":"No festive meal is complete without the classic dish 'garelu' or 'garellu' in most Andhra homes, be it for Sankranti, Ugadi, Ganesh Chaturthi or Diwali. Infact during Sankranti,our major harvest festival, on Kanumu day, the sons-in-law of the family are treated to delectable delicacies and one savory dish prepared is garellu served with meat curry,  sambar and coconut chutney.\r\n\r\n\r\n\r\nSouth Indian Tiffins boast of a variety of Vadas or Garelu like Medu Vada, Masala Vada, Parappu Vadai, Ulundu Vadai or Thayir Vadai aka Perugu Garellu aka Dahi Bhalla (a North Indian style vada smothered in yogurt and tamarind sauce). What ever their name, the vadas or garelu with a crispy and crunchy exterior and a soft and fluffy inside are sure to delight your palettes. Garelu are prepared with whole black gram lentil batter. When chopped onions and green chillis are added to the batter, the prepared dumplings are called 'Ulli Garellu'. (ulli = onion in telugu)\r\n\r\nIngredients:\r\n\r\n1 1\/2 cup whole urad dal\/black gram dal\/minappappu\r\n1 tbsp raw rice\r\n2\" ginger very finely chopped\r\n2-3 green chillies very finely chopped\r\n1 big onion finely chopped\r\nsalt to taste\r\noil for deep frying\r\n\r\nSoak whole black gram dal and 1 tbsp raw rice for 5-6 hours.\r\nStrain the water from the dal and grind to a paste sprinkling little water and salt. Don't grind all the dal at once, use small portions to grind batch wise as its easier to grind into a soft paste. Add salt while grinding to a fluffy paste.\r\nThen add chopped onions, finely chopped ginger and green chillies to the batter and mix well.\r\n\r\n\r\n\r\nTake a heavy bottomed vessel and add enough oil for deep frying. The oil should be hot.\r\nWet your hands with water and take a lemon sized ball and flatten it into a vada on a greased sheet or banana leaf.\r\nMake a hole in the centre of the vada or gare so that it cooks evenly all over.\r\n\r\n\r\n\r\nSlowly drop it into the hot oil carefully and fry it on both sides on medium heat to a golden brown colour.\r\n\r\nServe hot with chicken curry or mutton kurma, sambar or coriander chutney.\r\n\r\nNow head to your kitchens and make this 'tiffin with a hole' which is sure to give your tastes buds a delectable treat. Another variation is the addition of 1 tsp of pepper corns, few curry leaves and 1\/4 tsp asafoetida to the ground gram dal batter, ginger and green chillis.\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2006\/02\/ulli-garelu1.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ulli-garelu1-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/ulli-garelu1-300x300.jpg","main-ingredient":["urad dal","onions"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Chaat Recipes","Festival Foods","Indian Breakfast Recipes","Indian Dal Recipes","Indian Vegetarian Recipes","South Indian Recipes"]}