{"id":99,"permalink":"http:\/\/www.sailusfood.com\/2006\/03\/01\/pav-bhaji-medley-of-spiced-mashed-vegetables-with-toasted-buns\/","title":"Pav Bhaji -Medley of  Spiced Mashed Vegetables With Toasted Buns","content":"Yet another Tuesday and its time for Sweetnick's Antioxidant Rice Foods 5-A-Day.The earlier recipes I submitted for this event were Cauliflower Tomato Curry ,Uthappams  and Bisi Bele Bath which is a rice dish with loads of vegetables.Actually I have started looking forward to this event as it really encourages me to think of recipes which include a lot more vegetables than usual.So this got me thinking as to what dish I should prepare which had atleast 4 to 5 vegetables,no,actually more than 5 and that's when Pav Bhaji, the quintessential Mumbai street food,immediately came to my mind.Can you guess how many veggies went into making the bhaji(vegetable)?Well, not 5 or 6 but 10 ..yes,you heard right,its 'TEN' vegetables!If that were not enough,the spice mix which give this dish its unique flavour, the pav bhaji masala,is a mix of more than 20 odd spices.And the herbs that liven up the pav bhaji even further are ginger,garlic,turmeric and coriander leaves.\r\nAmong the ten vegetables required to prepare the bhaji , eight were sitting in the fridge and I only had to buy some bell peppers, beetroot and the most essential ingredients of this dish, Pav Bhaji Masala and Pav (bread).You can prepare the bhaji without beetroot too but its just that I wanted to bring in that extra color to my version of the bhaji..:).Probably cant compare it to the authentic 'pav bhaji', the mumbai street food vendors churn out but it was very colorful,flavorful,satisfying and comforting medley of spicy veggies,not to mention nutritional,I have cooked and eaten this past week.\r\nIngredients:\r\n\r\nFor Bhaji:\r\n2 onions chopped finely\r\n1 tsp ginger garlic paste\r\n2 green chillis slit length wise\r\n1 capsicum finely chopped\r\n2 tomatoes finely chopped\r\n1 small cup each of chopped mixed vegetables (french beans, carrots, cauliflower, beetroot,potatoes,green peas,cabbage)\r\n3 tsps pav bhaji masala (any good brand,I used Everest)\r\n1 1\/2 tsp red chilli powder\r\n1\/4 tsp turmeric powder\r\n1\/2 tsp sugar (optional)\r\nsalt to taste\r\n2 tbsp oil\r\n1 tbsp butter\r\n1\/2 lemon juice\r\n2 tbsps chopped fresh coriander leaves,onion rings and lemon wedges for garnish\r\n\r\n8 pavs (buns)with butter to shallow fry the pavs\r\n\r\nPressure cook all the vegetables except onions,capsicum and tomatoes.Once they are cooked till soft,mash them with a masher while they are hot.Dont drain away the left over water from the cooked vegetables.\r\nHeat oil in a heavy bottomed vessel and add onions. Fry till the onions turn golden brown in colour. Add ginger-garlic paste and green chillies and fry for 2-3 minutes.Now add the bell peppers and fry for another 2 minutes.\r\nAdd pav bhaji masala,red chilli pwd,turmeric pwd,sugar and salt.Stir to combine and then add the tomatoes and fry till oil separates.\r\nAdd the mashed vegetables and stir to combine.Add a cup of water and adjust salt, let it cook on slow fire for 20 minutes.Turn off heat and add butter and lemon juice.Combine.\r\nGarnish with onions rings and chopped coriander leaves.\r\nServe this bhaji with hot pavs lightly toasted in butter.\r\n\r\nNote: Bhaji can be prepared with even 2-3 vegetables like carrots,peas,cauliflower or bottle gourd.You can serve this bhaji with plain bread or roti too.\r\n\r\nThat sure was a lot of Indian street food fare we have had the past week..aloo tikki , corn bhel and Pao Bhaji.Couldnt ask for more luring foods to treat my taste buds especially a dish like pav bhaji...:)\r\n\r\nFood,Food Blogs,Vegetarian,Indian Cooking,Antioxidants,Flickr","main-ingredient":["carrots","beans","cauliflower","potatoes"],"author":null,"type":"post","categories":["All Recipes","Chaat Recipes","Indian Bread Recipes","Indian Vegetarian Recipes","North Indian Recipes","Recipes Vegetable Dishes"]}