{"id":992,"permalink":"http:\/\/www.sailusfood.com\/2008\/04\/16\/senaga-pachadi-besan-chutney\/","title":"Senaga Pachadi - Besan Chutney","content":"\r\nOne of those recipes that I make whenever I run out of vegetables or coconut to prepare a chutney to go with a South Indian breakfast like idly or dosa, is besan (chickpea flour) chutney or senagapindi pachadi. Chickpea flour is my trusted stand by when unexpected guests arrive. \r\n\r\nA unique recipe with the combined goodness of tamarind and besan (gluten free flour that is high in protein, fibre and low carb). It's all in the seasoning and roasting of chick pea flour till you achieve that golden brown color and you experience that heady fragrant smell which decides the final flavor of this pacchadi.  Eat it with idlis and you have an easy way to fill up on protein and fibre in one light, tasty, vegan breakfast or dinner meal. \r\nSenaga Pachadi Recipe\r\nPreparation: 15-18 mts\r\nServes 3-4 persons\r\nCuisine: Andhra\r\n.\r\n\r\n\r\nIngredients:\r\n\r\n1 1\/4 cup besan\/senaga pindi\/chickpea flour\r\n\r\ngooseberry sized tamarind (soak in 2 1\/2 -3 cups of water, extract juice and discard pulp)\r\n\r\nsalt to taste\r\n\r\nFor popu\/tadka\/seasoning:\r\n\r\n1\/2 tsp mustard seeds\r\n\r\n1 tsp cumin seeds\r\n\r\n5-6 garlic cloves (crushed)\r\n\r\n2 dry red chillis (de-seed and tear)\r\n\r\n10-12 curry leaves\r\n\r\n1\/2 tbsp oil\r\n\r\n\r\n\r\n1 Heat oil in a kadai, add the mustard seeds and as they begin to pop add cumin seeds, garlic cloves, red chillis and curry leaves and toast them for a half a minute. (Take care not to burn the tempering). \r\n2 Add chickpea flour and salt and roast along with the tempering base. On low to medium flame, constantly keep frying the besan till it changes colour (and lovely aroma emanates and the rawness of chickpea flour disappears). This could take some time, approx 8-9 mts. Take care not to burn the senaga pindi. Turn off heat. Remove onto a plate and cool.\r\n3 Once cool, add the tamarind extract along with water and combine well. It should be of a slightly runny consistency. Add more water if required. For a more tangy flavor, add more tamarind extract.\r\n4 Use your hand to bring them all together and also crush the tempering base as you combine. The flavors of spices come out well as you crush them. Adjust salt.\r\n5 Serve with hot idlis or dosas for a complete vegan diet that is also gluten free. \r\n\r\n","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/04\/senaga_chutney.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/senaga_chutney-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/senaga_chutney-300x300.jpg","main-ingredient":["chickpea flour"],"author":null,"type":"post","categories":["All Recipes","Andhra Recipes","Ayurvedic Cooking - Ayurveda Recipes","Flour Recipes","Indian Chutney Recipes - Pachadi"],"tags":["besan","chickpea_flour","gluten_free","vegan_diet"]}