{"id":998,"permalink":"http:\/\/www.sailusfood.com\/2008\/04\/21\/quick-easy-summer-meals\/","title":"Quick & Easy Summer Meals ","content":"I receive many e-mail requests from visitors to blog recipes for pregnant and post-pregnant women, toddler recipes, lunch-box recipes, 30 minute Indian meals, tiffins, party recipes, how to cook for more than 50 people and many many more. I usually blog about the food our family eats and its very difficult to cater to the many requests of my dear readers and visitors. \r\n\r\nRecently, I received two e-mail requests from my readers asking me to blog quick and light summer meals\/recipes and ideas. Its hot and humid here in Vizag and past few days have been very light and easy on the stomach kind of meals. I find my appetite diminishing during this season and crave for light meals. I complied all the images of meals we had this past week into a single post - 8 simple, quick, light and healthy (calcuim-rich) summer time meals. They are by no means authentic or traditional but healthy nevertheless. (Not all are complete balanced meals and I prepared them depending on what we had for breakfast) \r\n\r\n\r\nCarrot - Raw Mango Sesame Salad : Sliver carrot, mango and cucumber. For salad dressing: Dry roast sesame (til) seeds for 3 mts on low-medium heat. Combine toasted sesame seeds, 1 dry red chilli (de-seed and tear), 1\/2 tbsp jaggery syrup and 1 tbsp peanut powder and pinch of salt. Toss the carrot, mango and cucumber slivers in this dressing and serve. I served this salad with a glass of panakam (cardamom flavored jaggery water). (Vegan recipe) \r\n\r\n\r\nVegetable (Roti) Rolls: For vegetable filling: Finely chop cabbage, capsicum, onion and grate carrot. Heat olive oil in a pan. Add cumin seeds and let them splutter. Add the finely chopped onions and fry for 3 mts. Next add rest of the vegetables and toss them they turn slightly soft, approx 4-5 mts. Add freshly ground black pepper pwd and salt to taste. Prepare rotis and roll them with the vegetable filling. I served them with papaya and a glass of majjiga\/buttermilk. (Vegan recipe, replace buttermilk with any drink of your choice)\r\n\r\n\r\nSesame flavored Vegetable Noodles: Boil noodles, drain, run through cold water, toss them in oil and keep aside. Prepare a mixture of 1 tbsp soya sauce, 1 1\/2 tbsps toasted sesame seed powder, 1 tsp ginger, salt, black pepper powder, 1 1\/2 tbsps honey and 1 tbsp vinegar and keep aside. Heat sesame oil in a wok, add spring onions and chopped garlic and toss them on high flame for a minute. Add carrot, capsicum, cabbage and french beans (juliennes) and toss them on high flame for 2-3 mts. Add the prepared soya sauce mix and combine well with the vegetables. Add the noodles and combine while tossing. I served the noodles along with a glass of mango juice. (Vegan recipe) \r\n\r\n\r\nVegetable Paneer Salad: Finely slice onions and capsicum. Chop paneer, cabbage, cucumber, french beans, carrots and tomatoes into small pieces. (I blanched beans and cabbage for a minute). Combine all of them in a large bowl. Prepare a dressing of curds\/yogurt (with water drained), sweet mango chutney (teepi magai, the recipe of which I will blog in another post), roasted cumin powder. Combine this yogurt dressing with the vegetables along with coriander leaves and adjust the salt. I served this salad along with a glass of watermelon juice.\r\n\r\n\r\nEgg Cashewnut Salad: Boil eggs, remove shell, quarter each egg and keep aside. Soak few cashewnuts in water for 5 mts. Heat olive oil in a vessel. Add curry leaves, chopped onions, slit green chilli and toss them for a minute. Add pinch of turmeric powder, roasted cumin powder, chaat masala pwd and cashewnuts and combine. Add the quartered eggs and toss. Turn off heat, garnish with chopped coriander leaves. I served the egg salad along with a bowl of mixed fruits.\r\n\r\n\r\nMethi Carrot Rice: Cook rice and keep aside (this recipe is for 3 cups of cooked rice). Grate carrot, chop beans finely and wash methi leaves. Heat a kadai and dry roast 1\/4 tsp cumin seeds, 1 tbsp sesame seeds, 1 tbsp channa dal, small cinnamon stick and few black pepper corns and make a fine powder. Heat oil in a vessel, add curry leaves, carrot, beans and methi leaves and cook them for a few minutes. Add the ground powder, salt and combine. Add the rice and combine with this mixture. I served this rice with cucumber and tomato raita. (Vegan recipe and replace raita with a dish of your choice) \r\n\r\n\r\nBeetroot  Chickpea Salad - Soak chickpeas overnight, drain and cook till soft. Grate beetroot and chop cucumber into small pieces. Heat olive oil in a kadai, add mustard seeds and let them splutter. Add split black gram dal and let them turn red, add curry leaves, green chilli and pinch of hing. Turn off heat and combine the seasoning with cooked chickpeas, beetroot and cucumber pieces. Garnish with fresh coriander leaves and a dash of lime. I served it along with a glass of majjiga\/buttermilk. (Vegan recipe, replace buttermilk with any drink of your choice) \r\n\r\n\r\nTender Coconut Water & Coconut Meat - Remove the tender coconut meat with the help of a spoon off the shell of the coconut. Sprinkle some brown sugar or grated jaggery and serve along with tender coconut water. (Vegan recipe) \r\n\r\nI hope to share sandwich recipes that are child-friendly that I usually prepare for breakfast or an evening snack. ","image":"http:\/\/www.sailusfood.com\/wp-content\/uploads\/2008\/10\/salads.jpg","image-small":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/salads-150x150.jpg","image-large":"https:\/\/storage.googleapis.com\/turtle-sailusfood\/salads-300x300.jpg","main-ingredient":["beetroot","chickpeas"],"author":null,"type":"post","categories":["All Recipes","Indian Vegan Recipes","Indian Vegetarian Recipes","Lunch Box Recipes","Recipes Vegetable Dishes","Salad Recipes"],"tags":["features","quick_summer_meals"]}